import 'package:flutter/material.dart';

//doharUpJela
class doharUpjela extends StatelessWidget {
  const doharUpjela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে দোহার উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "দোহার বাংলাদেশের ঢাকা জেলার অন্তর্গত সর্বদক্ষিণের উপজেলা। আয়তন ও জনসংখ্যার বিবেচনায় ঢাকা জেলার সবচেয়ে ছোট উপজেলা হিসেবেও পরিচিত (১২১.৪১ বর্গ কিলোমিটার)। দোহার উপজেলা ১৯১৭ সালের ১৫ই জুলাই প্রতিষ্ঠা লাভ করে। একই বছরের ২১শে সেপ্টেম্বর গেজেট বিজ্ঞপ্তি প্রকাশিত হবার পর ১৯১৮ সালের পহেলা জানুয়ারি আনুষ্ঠানিক ভাবে দোহার উপজেলা, তৎকালীন দোহার থানার কার্যক্রম শুরু হয়।\n\n"
                "অবস্থান:  ২৩°৩১' হতে ২৩°৪১' উত্তর অক্ষাংশ ও ৯০°০১' হতে ৯০°১৩' পূর্ব দ্রাঘিমাংশ। জেলা সদর হতে দূরত্ব ৬০ কিলোমিটার। উত্তরে নবাবগঞ্জ উপজেলা, দক্ষিণে পদ্মা নদী ও ফরিদপুর জেলার সদরপুর উপজেলা, পূর্বে মুন্সিগঞ্জ জেলার শ্রীনগর উপজেলা ও নবাবগঞ্জ উপজেলার কিছু অংশ এবং পশ্চিমে মানিকগঞ্জ জেলার হরিরামপুর উপজেলা, পদ্মা নদী ও ফরিদপুর জেলার চরভদ্রাসন উপজেলা অবস্থিত।\n\n"
                "প্রশাসনিক এলাকা:  দোহার উপজেলায় ১টি পৌরসভা (দোহার পৌরসভা), ৮টি ইউনিয়ন, ৯৩টি মৌজা এবং ১৩৯টি গ্রাম রয়েছে।\n\n"
                "জনসংখ্যা: মোট জনসংখ্যা ২,২৬,৪৩৯ জন (প্রায়)। যার মধ্যে- পুরুষ ১,০৭,০৪১ জন (প্রায়)।, মহিলা ১,১৯,৩৯৮ জন (প্রায়)। লোক সংখ্যার ঘনত্ব ১,৪০২ জন (প্রতি বর্গ কিলোমিটারে)। মোট ভোটার সংখ্যা ১,৫১,৭৭০ জন। পুরুষভোটার সংখ্যা ৭৩,১২০ জন। মহিলা ভোটার সংখ্যা ৭৮,৬৫০ জন। বাৎসরিক জনসংখ্যা বৃদ্ধির হার ১.৩০%।মোট পরিবার(খানা) ৪৯,৪০০ টি।\n\n"
                "স্বাস্থ্য: উপজেলা স্বাস্থ্য কমপ্লেক্স ০১টি, উপজেলা স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র ১৬টি, বেডের সংখ্যা ৫০টি, ডাক্তারের মঞ্জুরীকৃত পদ সংখ্যা ৩৭টি, কর্মরত ডাক্তারের সংখ্যা ইউএইচসি ১৭, ইউনিয়ন পর্যায়ে ১৬, ইউএইচএফপিও ১টি। সিনিয়র নার্স সংখ্যা ১৫ জন। কর্মরত ১৩ জন, সহকারী নার্স সংখ্যা ১ জন।\n\n"
                "দর্শনীয় স্থান: দোহার উপজেলার দর্শনীয় স্থানগুলোর মধ্যে উল্লেখযোগ্য হচ্ছে নুরুল্লাহপুর ওরস শরীফ এর মেলা (সুন্দরীপাড়া), মিনি কক্সবাজার খ্যাত মৈনট ঘাট, পদ্মাপাড়ের বাহ্রা ঘাট, কোঠাবাড়ি বিল, পদ্মাপাড়ের নারিশা, আড়িয়াল বিল (নিকড়া), ডাক বাংলো (মুকসুদপুর), দুবলী হতে নবাবগঞ্জ সড়ক, সাইনপুকুর বড়বাড়ি, কাটাখালী পাক দরবার শরীফের উরস উপলক্ষে সুফি অনুসারীদের মাহফিল ও মেলা (২১ শে ফাল্গুন, ৪ঠা মার্চ) ইত্যাদি। উল্লেখযোগ্য যে বর্তমান সংসদ সদস্য সালমান এফ রহমান মিনি কক্সবাজার খ্যাত মৈনট ঘাটকে পরিকল্পিত ও উন্নতমানের পর্যটনকেন্দ্র হিসেবে গড়ে তুলতে এলাকাবাসীর নিকট প্রতিশ্রুতিবদ্ধ।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
