import 'package:flutter/material.dart';

//savarUpjela
class savarUpjela extends StatelessWidget {
  const savarUpjela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে সাভার উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "সাভার বাংলাদেশের ঢাকা বিভাগের ঢাকা জেলার অন্তর্গত একটি উপজেলা। এটি রাজধানী শহর ঢাকা হতে প্রায় ২৪ কিলোমিটার উত্তরে (গুলিস্তান জিরো পয়েন্ট থেকে সড়ক পথের দূরত্ব) অবস্থিত বাংলাদেশের অন্যতম বড় শহর এবং ঢাকা মেগাসিটির অন্তর্ভুক্ত এলাকা। সাভার বাংলাদেশের অন্যতম ঘনবসতিপূর্ন উপজেলাগুলোর মধ্যে একটি। জনসংখ্যা অত্যধিক বেশি হওয়ায় দিন দিন এই অঞ্চল ক্রমাগত দুষিত ও বসবাস অযোগ্য হয়ে পড়ছে। সাভারে জনসংখ্যা ১৫ লক্ষাধিক। এছাড়া প্রচুর গার্মেন্ট প্রতিষ্ঠান থাকায় পরিবেশও দুষিত হচ্ছে দ্রুত।\n\n"
                "ভৌগোলিক উপাত্ত:  সাভার ২৩.৮৫৮৩° উত্তর এবং ৯০.২৬৬৭° পূর্বে অবস্থিত। এখানে প্রায় ৬৬,৯৫৬ টি পরিবার বসবাস করছে এবং এর সামগ্রিক আয়তন হচ্ছে ২৮০.১২ বর্গ কিলোমিটার। এটি উত্তরে কালিয়াকৈর উপজেলা এবং গাজীপুর সদর উপজেলা; দক্ষিণে কেরানীগঞ্জ উপজেলা; পূর্বে মিরপুর, মোহাম্মদপুর, পল্লবী থানা এবং উত্তরা থানা এবং পশ্চিমে ধামরাই উপজেলা এবং সিঙ্গাইর উপজেলা দিয়ে বেষ্টিত। সাভারের ভূমি প্লেইস্টোসিন সময়সীমার পাললিক মাটি দ্বারা গঠিত। ভূমির উচ্চতা পূর্ব থেকে পশ্চিমে ধীরে ধীরে বৃদ্ধি পেয়েছে। সাভারের দক্ষিণাংশ বংশাই এবং ধলেশ্বরী নদীর পলল দ্বারা গঠিত। এখানকার প্রধান নদীসমূহ হচ্ছে বংশী (বংশাই), তুরাগ ও ধলেশ্বরী। এছাড়াও বুড়িগঙ্গা ও গাজীখালী নামে আরো দুটি নদী রয়েছে। বর্তমানে বিভিন্ন শিল্প-কারখানা ও ট্যানারী শিল্পের বর্জ্যের কারণে নদীগুলো মারাত্বকভাবে দূষিত হয়ে পড়ছে এবং দখলের কারণে এসব নদীর অস্তিত্ব ক্রমাগত হুমকির সম্মুখীন। এখানে ১০,৫৫১.১৮ হেক্টর পতিত জমি ছাড়াও মোট আবাদি জমির পরিমাণ হচ্ছে ১৬,৭৪৫.৭১ হেক্টর।\n\n"
                "প্রশাসনিক এলাকা:  সাভার থানা ১৯১২ সালে প্রতিষ্ঠিত হয়। এটি ১৯৮১ সালে একটি উপজেলায় পরিণত হয়। বর্তমানে সাভার উপজেলা ২ টি থানায় বিভক্ত; যার একটি হচ্ছে সাভার মডেল থানা এবং অন্যটি আশুলিয়া থানা। এই উপজেলায় নির্বাচনী এলাকা রয়েছে ০২ টি; (ক) ১৯২, ঢাকা-১৯, (উপজেলার মোট ০৯ টি ইউনিয়ন) এবং (খ) ১৭৫, ঢাকা-২, (এর সাথে উপজেলার ০৩ টি ইউনিয়ন)\n\n"
                "জনসংখ্যার উপাত্ত:  ২০১১ সালের আদমশুমারী অনুযায়ী এ উপজেলার মোট জনসংখ্যা ১৪,৪২,৮৮৫ জন। এর মধ্যে পুরুষ ৭,৬৯,১১৭ জন এবং মহিলা ৬,৭৩,৬৬৮ জন। উপজেলার শিক্ষার হার ৬৮% । মোট জনসংখ্যার মধ্যে মুসলমান ৯১.৩৮%, হিন্দু ৭.৭৪% এবং অন্যান্য ০.৮৮% । সাভারে জনসংখ্যা বৃদ্ধির হার ঢাকা মেগাসিটির মধ্যে সবচেয়ে বেশি ৮ দশমিক ৫৯ শতাংশ।\n\n"
                "ধর্মীয় ও শিক্ষাপ্রতিষ্ঠান:  মসজিদ ৮৮২ টি, মন্দির ৭৪ টি এবং গির্জা ৮ টি।\n\n"
                "অর্থনীতি: সাভার থেকে কাঁঠাল, পেঁপে, ফুল, চারা, দুগ্ধজাত পণ্য, মাংস, রূপান্তরিত কাপড়, ছোপানো, ঔষধ, তৈরি পোশাক প্রস্তুত, ইলেকট্রনিক্স এবং বৈদ্যুতিক পণ্য, জুতা, ইট, সন্দেশ ইত্যাদি রপ্তানী করা হয়।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
