import 'package:flutter/material.dart';

//kisorgongSadar
class kisorgongSadar extends StatelessWidget {
  const kisorgongSadar({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে  কিশোরগঞ্জ সদর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "কিশোরগঞ্জ সদর উপজেলা বাংলাদেশের কিশোরগঞ্জ জেলার অন্তর্গত একটি উপজেলা এবং কিশোরগঞ্জ জেলার প্রধান শহর। এর উত্তরে ময়মনসিংহ জেলার নান্দাইল উপজেলা ও কিশোরগঞ্জ জেলার তাড়াইল উপজেলা, দক্ষিণে পাকুন্দিয়া উপজেলা ও কটিয়াদি উপজেলা, পূর্বে করিমগঞ্জ উপজেলা এবং পশ্চিমে হোসেনপুর উপজেলা অবস্থিত। এই উপজেলার উপর দিয়ে নরসুন্দা নদী ও ধলেশ্বরী নদী প্রবাহিত হয়েছে।১৮৪৫ থেকে ১৮৬০ সালের মধ্যে কোন সময় কিশোরগঞ্জ থানা প্রতিষ্ঠিত হয়েছিল। পরবর্তী কালে ১৯৮৪ সালে এই জনপদকে উপজেলায় উত্তীর্ণ করা হয়। বাংলাদেশ জাতীয় সংসদ নির্বাচনে এই উপজেলাটি কিশোরগঞ্জ-১ সংসদীয় আসনের অন্তর্গত।\n\n"
                "ইতিহাস:  উনবিংশ শতাব্দীর প্রথমভাগে এই শহরের নামকরণ করা হয় কিশোরগঞ্জ। এখানকার জমিদার কৃষ্ণদাস প্রামাণিকের ষষ্ঠপুত্র ব্রজ কিশোর প্রামাণিক নরসুন্দা নদীর দুই তীরে গঞ্জ প্রতিষ্ঠা করেন। ব্রজ কিশোরের কিশোর ও তার প্রতিষ্ঠিত গঞ্জ নিয়ে এই এলাকার নামকরণ করা হয় কিশোরগঞ্জ। ধারণা করা হয় ১৮৪৫ থেকে ১৮৬০ সালের মধ্যে কোন সময় কিশোরগঞ্জ থানা প্রতিষ্ঠিত হয়েছিল।\n\n"
                "ভৌগোলিক সীমানা:  কিশোরগঞ্জ সদর উপজেলার ভৌগোলিক অবস্থান ২৪.৪৩৩৩° উত্তর ৯০.৭৮৩৩° পূর্ব। এই উপজেলাটির আয়তন ১৯৩.৭৩ বর্গকিলোমিটার। উত্তরে ময়মনসিংহ জেলার নান্দাইল উপজেলা ও কিশোরগঞ্জ জেলার তাড়াইল উপজেলা, দক্ষিণে পাকুন্দিয়া উপজেলা ও কটিয়াদি উপজেলা, পূর্বে করিমগঞ্জ উপজেলা এবং পশ্চিমে হোসেনপুর উপজেলা। এই উপজেলায় ২টি নদী প্রবাহিত হয়েছে, সেগুলো হল নরসুন্দা নদী ও ধলেশ্বরী নদী।\n\n"
                "জনসংখ্যা:  ঐতিহাসিক জনসংখ্যা-২০১১ সালের আদমশুমারি অনুযায়ী কিশোরগঞ্জ সদরের জনসংখ্যা ৪১৪,২০৮ জন, তন্মধ্যে ২০৫,০৭৫ জন পুরুষ ও ২০৯,১১৩ জন নারী। এই উপজেলার জনসংখ্যার ঘনত্ব প্রতি বর্গকিমিতে ২,১৩৮ জন। কিশোরগঞ্জ সদর মুসলমান সংখ্যাগরিষ্ঠ অঞ্চল। ২০১১ সালের আদমশুমারি অনুযায়ী এই উপজেলার জনসংখ্যার ৯৪.৫৬% ইসলাম, ৫.৬২% হিন্দু এবং বাকিরা অন্যান্য ধর্মাবলম্বী।\n\n"
                "শিক্ষা:  ২০১১ সালের আদমশুমারি অনুযায়ী কিশোরগঞ্জ সদর উপজেলায় সাক্ষরতার হার ৪৮.৯%। কিশোরগঞ্জ সদর উপজেলায় অসংখ্য সরকারি ও বেসরকারি শিক্ষা প্রতিষ্ঠান রয়েছে, যেখান থেকে শিক্ষার্থীরা শিক্ষাগ্রহণ করে।\n\n"
                "স্বাস্থ্য:  কিশোরগঞ্জ সদর উপজেলায় একটি ২৫০ শয্যাবিশিষ্ট সরকারি জেলা হাসপাতাল রয়েছে। এছাড়া এই উপজেলার লোকজনের স্বাস্থ্য সেবা প্রদানের জন্য ১১টি বেসরকারি হাসপাতাল ও ক্লিনিক রয়েছে।[২৭] উপজেলার লতিবাবাদ লতিবাবাদ এলাকায় কিশোরগঞ্জ চক্ষু হাসপাতাল অবস্থিত।[২৮] ২০০৬ সালের ১৪ মে উপজেলার লোকজনদের চোখের চিকিৎসা প্রদানের লক্ষ্যে বেসরকারি সংস্থা নারী উদ্যোগ কেন্দ্র (নউক) এর উদ্যোগে এই হাসপাতাল প্রতিষ্ঠিত হয়।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
