import 'package:flutter/material.dart';

//pakundiya
class pakundiya extends StatelessWidget {
  const pakundiya({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে পাকুন্দিয়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "পাকুন্দিয়া বাংলাদেশের ঢাকা বিভাগের কিশোরগঞ্জ জেলার অন্তর্গত একটি উপজেলা। এর আয়তন ১৮০.৫২ বর্গকিলোমিটার (৬৯.৭০ বর্গমাইল) এবং মোট জনসংখ্যা ২,৩৭,২১৮। এটি ১৯২২ সালে একটি থানা হিসেবে গঠিত হয়। এটি ১৯৮৩ সালের সেপ্টেম্বর মাসের ১৪ তারিখে উপজেলায় রূপান্তরিত হয়।\n\n"
                "অবস্থান:  পাকুন্দিয়া কিশোরগঞ্জ জেলার সীমান্তবর্তী একটি উপজেলা। এর আয়তন ১৮০.৫২ বর্গ-কিলোমিটার। পাকুন্দিয়াকে ঘিরে, পশ্চিমে পুরাতন ব্রহ্মপুত্র নদী দ্বারা ময়মনসিংহ জেলার গফরগাঁও উপজেলা, দক্ষিণ পশ্চিমে গাজীপুর জেলার কাপাসিয়া উপজেলা, দক্ষিণে নরসিংদীর মনোহরদী উপজেলা, পূর্ব-দক্ষিণে কটিয়াদি উপজেলা, উত্তর দিকে কিশোরগঞ্জ সদর উপজেলা, উত্তর-পশ্চিমে হোসেনপুর উপজেলা। প্রধান নদী পুরাতন ব্রহ্মপুত্র নদী। উপজেলার অভ্যন্তরে সিংগুয়া নামে আর একটি নদী বিল মইসবের থেকে কালিয়াচাপড়া হয়ে জেলার ভাটি এলাকা নিকলীর সাথে ঘোড়াউত্রা নদীতে মিশেছে।\n\n"
                "প্রশাসনিক এলাকা:  ৯টি ইউনিয়ন ও ১টি পৌরসভা নিয়ে গঠিত এই উপজেলা কিশোরগঞ্জ শহর থেকে দক্ষিণ-পশ্চিমে অবস্থিত। কিশোরগঞ্জ জেলা সদর থেকে পাকুন্দিয়া উপজেলা সদরের দূরত্ব ১৫ কিলোমিটার।\n\n"
                "জনসংখ্যার উপাত্ত:  পাকুন্দিয়া উপজেলার মোট জনসংখ্যা ২,৩৭,২১৮ (প্রায়)। এর মধ্যে পুরুষ ৫১.২৬ শতাংশ এবং মহিলা ৪৮.৭৪ শতাংশ (ধর্মীয় দৃষ্টিকোণ থেকে ৯৫.৭৫ শতাংশ মুসলমান ও ৪.২৫ শতাংশ হিন্দু)।\n\n"
                "উচ্চমাধ্যমিক ও স্নাতক:  পাকুন্দিয়া উপজেলায় মোট কলেজের সংখ্যা ৮টি। সেগুলো হলো – পাকুন্দিয়া আদর্শ মহিলা কলেজ, পাকুন্দিয়া সরকারি কলেজ, হোসেন্দী আদর্শ কলেজ, হাজী জাফর আলী কলেজ, শিমুলিয়া স্কুল এন্ড কলেজ, জাঙ্গালিয়া ইউনিয়ন উচ্চ বিদ্যালয় এন্ড কলেজ, চর আদর্শ কলেজ ও চরটেকী গার্লস কলেজ। উচ্চমাধ্যমিক ও স্নাতক পর্যায়ের মাদ্রাসাসমূহ হলো – পাঁচলগোটা সিনিয়র আলিম মাদ্রাসা, শৈলজানী আলিম মাদ্রাসা ও মঙ্গলবাড়িয়া কামিল মাদ্রাসা।\n\n"
                "শিল্প প্রতিষ্ঠান:  কালিয়া চাপড়া চিনিকল (বিলুপ্ত) বর্তমানে নিটল-‌নিলয় চিনিকল হিসেবে বেসরকারী পর্যায়ে চালু আছে। পাকু‌ন্দিয়ায় এক‌টি ঔষধ উৎপাদনকারী প্র‌তিষ্টান আছে যার নাম ডেল্টা ফার্মা‌সি‌টিক্যাল। একটি কোল্ড স্টোরেজ আছে যার নাম এগারসিন্দুর কোল্ডস্টোরেজ। এছাড়া সরকারি বিএডিসি স্টোরেজ, একটি ময়দা ফ্যাক্টরি, এবং অটোরাইসমিল আছে।\n\n"
                "অর্থনীতি:  এ উপজেলা সবজির জন্য বিখ্যাত। প্রতি বছর এখানে অনেক সবজি ও ফল উৎপাদিত হয়। এখানের সবজি ও ফল বিশেষ করে সিলেট, ঢাকা সহ সারা দেশে সারা বছর সরবরাহ করা হয়। মংগলবাড়িয়ার লিচুর ঐতিহাসিক খ্যাতি এ উপজেলাতেই। তাছাড়া এখানে প্রচুর ধানও উৎপাদিত হয়, যা এখানের খাবারের চাহিদা পূরণ করে থাকে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
