import 'package:flutter/material.dart';

//vairab
class vairab extends StatelessWidget {
  const vairab({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ভৈরব উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান::  এটি ঢাকা-সিলেট মহাসড়ক এবং ঢাকা-ময়মনসিংহ মহাসড়কের পাশে মেঘনা নদীর তীরে অবস্থিত একটি বাণিজ্যিক শহর। ভৈরব উপজেলার উত্তরে কুলিয়ারচর উপজেলা, পশ্চিমে নরসিংদী জেলার রায়পুরা উপজেলা, দক্ষিণে ব্রাহ্মণবাড়িয়া জেলার বাঞ্ছারামপুর উপজেলা এবং পুর্বে ব্রাহ্মণবাড়িয়া জেলার আশুগঞ্জ উপজেলা অবস্থিত।\n\n"
                "প্রশাসনিক এলাকা:  ভৈরবে থানা হিসেবে ঘোষিত হয় ১৯০৬ সালে। পরে এ থানাকে বর্তমানের ভৈরব উপজেলায় উন্নীত করা হয় ১৯৮৩ সালে। এ উপজেলায় ১টি পৌরসভা, ৭টি ইউনিয়ন, ৩২টি মৌজা ও ৮৪টি গ্রাম রয়েছে।\n\n"
                "জনসংখ্যার উপাত্ত:  ২০০১ সালের আদমশুমারি অনুসারে ভৈরবের মোট জনসংখ্যা ২,৪৬,৮২০ জন। পুরুষের সংখ্যা ১,২৭,৬২০ জন। আর নারীর সংখ্যা ১,১৯,২০০। পুরুষের অনুপাত মোট জনসংখ্যার ৫১% আর নারীর অনুপাত ৪৯%। সর্বমোট গৃহের সংখ্যা গ্রামে ২৮,৯৪২ টি এবং শহরে ১৭,৬৯২ টি। সর্বমোট জমির পরিমাণ ৩০,০৮০ একর। চাষযোগ্য জমির পরিমাণ ১৭,৬১৬ একর। সেচের আওতায় অন্তর্ভুক্ত জমির পরিমাণ ২০,৩০২ একর।\n\n"
                "শিক্ষা:   বাংলাদেশ পরিসংখ্যান ব্যুরোর ২০০৭ সালের রিপোর্ট অনুযায়ী ভৈরব উপজেলায় আলিয়া মাদ্রাসা আছে ৩ টি, জুনিয়র হাই স্কুল ২ টি, কওমী (ফুরকানিয়া) মাদ্রাসা ২৬১ টি, কলেজ আছে ৬ টি, ভোকেশনাল ইন্সটিটিউট ১ টি, দৃষ্টি-প্রতিবন্ধীদের জন্য বিশেষ স্কুল আছে ১ টি, প্রাইমারি স্কুল আছে ৯২ টি, কিন্ডার গার্ডেন আছে ২৬ টি এবং শিক্ষক প্রশিক্ষণ কেন্দ্র আছে ১ টি।\n\n"
                "অর্থনীতি:  বন্দরনগরী ভৈরবের বেশিরভাগ মানুষ ব্যবসায়ী। বাংলাদেশ পরিসংখ্যান ব্যুরোর ২০০৭ সালের রিপোর্ট অনুযায়ী ভৈরবে মোট ২০ একর জায়গায় গমের চাষ হয়ে ৬ মেট্রিক টন গম উৎপন্ন হয়। ১৪,২১৯ একর জায়গায় ধান চাষ হলে ২১,৪৭৮ মেট্রিক টন ধান উৎপন্ন হয়। ১,৬৬৬,০০০,০০০ টি ডিম উৎপন্ন হয়। ৩ মেট্রিক টন করে দুধ ও মিষ্টি উৎপন্ন হয়। এছাড়াও ভৈরবে ১,৪৮৪ একর জায়গায় পাট চাষ হয় যেখানে ১,০৮৫ মেট্রিক টন পাট উৎপন্ন হয়। ভাটি এলাকার অন্তর্ভুক্ত হওয়ায় কিছু অংশ মৎস্য আহরণের সাথে জড়িত। এখানকার প্রধান ফসল ধান। এছাড়া এখানে প্রচুর পরিমানে শীতকালীন সবজি উৎপন্ন্য হয়। এখানকার প্রধান অর্থকরি ফসল পাট।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
