import 'package:flutter/material.dart';

//srinagor
class srinogor extends StatelessWidget {
  const srinogor({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে শ্রীনগর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  উত্তরে ঢাকার নবাবগঞ্জ উপজেলা এবং সিরাজদীখান উপজেলা, পূর্বে সিরাজদীখান উপজেলা, পশ্চিমে পদ্মা নদী, ঢাকা জেলার দোহার উপজেলা, দক্ষিণে পদ্মা নদী এবং লৌহজং উপজেলা।\n\n"
                "প্রশাসনিক এলাকা:  শ্রীনগর উপজেলা প্রতিষ্ঠার তারিখ ১২ আগস্ট ১৯৮৩। উপজেলার আয়তন ২০২ বর্গ কি: মি:। ইউনিয়নের সংখ্যা ১৪টি । গ্রাম : ১৪৭টি, মৌজা ১০২টি, ওয়ার্ড/গ্রাম সরকার ১২৬টি ।\n\n"
                "ইতিহাস:  শ্রীনগররের প্রাচীন নাম রায়েসবর। নবাব মীর কাসিম কর্তৃক নিযুক্ত বাংলা বিহার উড়িশ্যার গভর্নর লালা কীর্তিনারায়ণ বসু রায়েসবরের শ্রীবৃদ্ধি করে এর নামকরণ করেন শ্রীনগর। তিনি শ্রীনগর তথা বিক্রমপুরে একটি মনোরম প্রাসাদ নির্মাণ করেন যা বর্তমানে শ্রীনগর পাইলট স্কুল ভবন হিসেবে পরিচিত। শ্রীনগররের সাংষ্কৃতিক অঙ্গন প্রাচীন কাল হতেই সরগরম। এখানে যাত্রা, থিয়েটর,পালাগান, জারিগান, সারিগাণ,প্রাচীন কাল হতেই প্রচলিত। উপমহাদেশ খ্যাত শ্রীনগরের রথযাত্রার উৎসবে দেশের বিভিন্ন অঞ্চল থেকে জনসমাবেশ ঘটত। নিপুণ কারুকার্য খচিত কাঠ ও টিনের মনোরম ঘরবাড়ি এবং আসবাবপত্র তৈরি এ অঞ্চলের প্রধান ঐতিহ্য। কাঠের কারুকার্যময় পানসি নৌকা, মাটির তৈরি নানা রকম খেলনা, পুতুল,হাড়ি-পাতিল প্রভৃতির জন্য এ অঞ্চল বিখ্যাত। শ্রীনগর তাঁতশিল্প দেশের অন্যতম ঐতিহ্য।এছাড়া শ্রীনগরে তৈরি তামা কাসার জিনিসপত্র বিখ্যাত।\n\n"
                "জনসংখ্যার উপাত্ত:  লোক সংখ্যা : ২,৫৯,৮৮৭ জন । পুরুষ : ১,২৭,৩৭৪ জন । মহিলা : ১,৩২,৫১৩ জন । পরিবার সংখ্যা : ৩৬,৩৪৪টি । শিশু মৃত্যুর হার : ৩.৩৩ জন (প্রতি হাজারে) । জনসংখ্যা বৃদ্ধির হার : ২.০১% ।\n\n"
                "শিক্ষা:  সরকারী প্রাথমিক বিদ্যালয় : ৯২টি। বেসরকারী রেজিঃ: প্রাথমিক বিদ্যালয় : ৪টি। নিম্ন মাধ্যমিক বিদ্যালয় : ১টি। মাধ্যমিক বিদ্যালয় : ২১টি। মহাবিদ্যালয় : ৪টি।মাদ্রাসা : ৫টি্‌। ভোকেশনাল ইনস্টিটিউশন : ১টি। শিক্ষার হার : ৪৯.৫%।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
