//jamalpur Jela
import 'package:flutter/material.dart';

class jamalpurJela extends StatelessWidget {
  const jamalpurJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে জামালপুর জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা:  উত্তরে ভারতের মেঘালয় রাজ্য ও গারো পাহাড়, কুড়িগ্রাম জেলা, পূর্বে শেরপুর ও ময়মনসিংহ জেলা, দক্ষিণে টাঙ্গাইল জেলা এবং পশ্চিমে যমুনা নদীর তীরবতী সিরাজগঞ্জ, বগুড়া, গাইবান্ধা ও কুড়িগ্রাম জেলা।\n\n"
                "প্রশাসনিক এলাকাসমূহ:  জামালপুর জেলা ৭টি উপজেলা, ৭টি থানা, ৮টি পৌরসভা, ৬৮টি ইউনিয়ন, ৮৪৪টি মৌজা, ১৩৪৬টি গ্রাম ও ৫টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                "ইতিহাস:  ঐতিহাসিক সূত্রে জানা যায়, দিল্লির সম্রাট আকবরের রাজত্বকালে (১৫৫৬-১৬০৫) হযরত শাহ জামাল (রহ.) নামে একজন ধর্মপ্রচারক ইয়েমেন থেকে ইসলাম প্রচারের উদ্দেশ্যে ২০০ জন অনুসারী নিয়ে এ অঞ্চলে এসেছিলেন। পরবর্তীতে ধর্মীয় নেতা হিসাবে তিনি দ্রুত প্রাধান্য বিস্তার লাভ করেন। ধারণা করা হয়, শাহ জামাল-এর নামানুসারে এই শহরের নামকরণ হয় জামালপুর। ১৯৭১ সালে ১০ ডিসেম্বর জামালপুর হানাদার বাহিনী মুক্ত হয়। ১৯৭৮ সালে ২৬ ডিসেম্বর ময়মনসিংহ থেকে পৃথক করে জামালপুরকে বাংলাদেশের ২০ তম জেলা হিসেবে ঘোষণা করা হয়। ১৯৮৪ সালে জামালপুর জেলা ভেঙ্গে শেরপুর জেলা গঠন করে।\n\n"
                "বিবরণ:  জনসংখ্যা ২৩,৮৪,৮১০ জন। পুরুষ ৫০.৫৮%, মহিলা ৪৯.৪২%। মুসলিম ৯৭.৭৪%, হিন্দু ১.৯২%, খ্রিষ্টান ০.০৭%, বৌদ্ধ ০.০৪% এবং অন্যান্য ০.১৪%। উপজাতিগোষ্ঠী - গারো, হদি, কুর্মী এবং মাল অন্যতম।\n\n"
                "ধর্মীয় প্রতিষ্ঠান - মসজিদ ৪২০২ টি, মন্দির ৪৪ টি, গীর্জা ৩৯, সমাধি ১৩। সবচেয়ে সুপরিচিত শৈলেরকান্ধা জামে মসজিদ, গৌরীপুর কাঁচারী জামে মসজিদ, শাহ জামাল সমাধি, শাহ কামাল সমাধি, হযরত দেওয়ান শাহ এর মাজার এবং দয়াময়ী মন্দির।\n\n"
                "শিক্ষা:  শিক্ষার গড় হার ৩৮.৫%; যার মধ্যে পুরুষ ৪১.১% ও মহিলা ৩৫.৯%।\n\n"
                "খাবার:  জামালপুর জেলার লোকজন সাধারণত ভাত, মাছ, মাংশ, ডাল ও শাক-সবজি খেতে পছন্দ করে। তবে কারো মৃত্যু উপলক্ষে বা কোন বিশেষ অনুষ্ঠান উপলক্ষে এ জেলার মানুষ একটি বিশেষ খাবার খেয়ে থাকে। তা হলো মেন্দা বা মিল্লি বা মিলানি বা পিঠালি। দেখতে অনেকটাই হালিমের মতো। যেটি গরু বা খাসি বা মহিষের মাংশের সাথে সামান্য চালের গুঁড়া ও আলু দিয়ে রান্না করা হয়। তার সাথে সাদা ভাত ও মাশকলাইয়ের ডাল। অনেক জায়গায় খাবার শেষে দই ও মিষ্টিও দিয়ে থাকে।\n\n"
                "গবেষক:  প্রফেসর ডাঃএ বি এম আব্দুল্লাহ,প্রধানমন্ত্রীর ব্যক্তিগত চিকিৎসক ও খ্যাতনামা একুশে পদক প্রাপ্ত মেডিসিন বিশেষজ্ঞ\n\n"
                "ক্রীড়া ব্যক্তিত্ত্ব: রকিবুল হাসান (জন্মঃ ১৯৮৭) - ক্রিকেটার; জুবায়ের হোসেন - ক্রিকেটার।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
