import 'package:flutter/material.dart';

class gopalgongJelaUpjela extends StatelessWidget {
  const gopalgongJelaUpjela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: <Widget>[
            Column(
              children: [
                SizedBox(height: 10),
                Container(
                  height: 50,
                  width: 400,
                  color: Colors.grey,
                  child: Center(
                    child: Text(
                      "গোপালগঞ্জ জেলার উপজেলা সমূহ",
                      style:
                          TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                    ),
                  ),
                ),
                SizedBox(height: 1),
                Center(
                  child: TextButton(
                    onPressed: () {
                      Navigator.push(context, MaterialPageRoute(builder: (context) =>gopalgongSadar()));
                    },
                    child: Text(
                      "গোপালগঞ্জ সদর",
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.w900),
                    ),
                  ),
                ),
                SizedBox(height: 0.1),
                Center(
                    child: TextButton(
                  onPressed: () {
                    Navigator.push(context, MaterialPageRoute(builder: (context) =>kashiyani()));
                  },
                  child: Text("কাশিয়ানী",
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.w900)),
                )),
                SizedBox(height: 0.1),
                Center(
                    child: TextButton(
                  onPressed: () {
                    Navigator.push(context, MaterialPageRoute(builder: (context) =>tongipara()));
                  },
                  child: Text("টুংগীপাড়া",
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.w900)),
                )),
                SizedBox(height: 0.1),
                Center(
                    child: TextButton(
                  onPressed: () {
                    Navigator.push(context, MaterialPageRoute(builder: (context) =>kutalipara()));
                  },
                  child: Text("কোটালীপাড়া",
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.w900)),
                )),
                SizedBox(height: 0.1),
                Center(
                    child: TextButton(
                  onPressed: () {
                    Navigator.push(context, MaterialPageRoute(builder: (context) =>muksudpur()));
                  },
                  child: Text("মুকসুদপুর",
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.w900)),
                )),
                SizedBox(height: 1),
                RaisedButton(
                  onPressed: () {
                    Navigator.pop(context);
                  },
                  child: Text("BACK",
                      style: TextStyle(fontWeight: FontWeight.bold)),
                ),
              ],
            ),
          ],
        ),
      ),
    ));
  }
}

//gopalgongSadar
class gopalgongSadar extends StatelessWidget {
  const gopalgongSadar({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে গোপালগঞ্জ সদর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  গোপালগঞ্জ সদর উপজেলার ভৌগোলিক অবস্থান ২৩.০১৬৭° উত্তর ৮৯.৮৩৩৩° পূর্ব। এই উপজেলাটির আয়তন ৩৮৯.৪২ বর্গকিলোমিটার। গোপালগঞ্জ সদর উপজেলার উত্তরে মুকসুদপুর-কাশিয়ানী উপজেলা ও নড়াইল জেলার লোহাগড়া উপজেলা, পূর্বে কোটালীপাড়া উপজেলা ও মাদারীপুর জেলার রাজৈর উপজেলা, দক্ষিণে টুঙ্গিপাড়া উপজেলা ও বাগেরহাট জেলার মোল্লাহাট উপজেলা এবং পশ্চিমে নড়াইল জেলার কালিয়া উপজেলা ও বাগেরহাটের মোল্লাহাট উপজেলা অবস্থিত।\n\n"
                    "প্রশাসনিক এলাকা:  ১৯৮৪ সালের ফেব্রুয়ারিতে গোপালগঞ্জ সদর থানা উপজেলায় উন্নীত হয়। গোপালগঞ্জ সদর উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ২১টি ইউনিয়ন, ১২৭টি মৌজা ও ১৯৭টি গ্রাম রয়েছে। বর্তমানে উপজেলা চেয়ারম্যান হিসেবে দায়িত্ব পালন করছেন শেখ লুৎফার রহমান বাচ্চু। ১৯৭২ সালের ২০ জানুয়ারী গোপালগঞ্জ পৌরসভা প্রতিষ্ঠিত হয়। উপজেলা নির্বাহী অফিসার পৌর প্রশাসকের দায়িত্ব পালন করেন। পৌরসভাটি স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয় কর্তৃক ২০ জানুয়ারী ১৯৭২ তৃতীয় শ্রেণী (গ-শ্রেণী), ২৬ ডিসেম্বর, ১৯৮৯ দ্বিতীয় শ্রেণীর (খ-শ্রেণী) এবং ১০ জুলাই ১৯৯৬ প্রথম শ্রেণীর (ক-শ্রেণী) পৌরসভা হিসেবে স্বীকৃত পায়। পৌরসভার আয়তন ১৩.৮২ বর্গ কি:মি:। পৌরসভার ওয়ার্ড সংখ্যা ৯টি। বর্তমানে কাজী লিয়াকত আলী পৌরসভার মেয়র হিসেবে দায়িত্ব পালন করছেন।\n\n"
                    "জনসংখ্যার উপাত্ত:  ২০১১ সালের জেলা পরিসংখ্যান অনুযায়ী গোপালগঞ্জ সদর উপজেলার মোট জনসংখ্যা ৩,৪৪,০০৮ জন যাদের মধ্যে পুরুষ ১,৭২,৯৯১ এবং নারী ১,৭১,০১৭ জন।\n\n"
                    "শিক্ষা প্রতিষ্ঠান:  ২০১১ সালের হিসেব অনুযায়ী গোপালগঞ্জ শহরের গড় সাক্ষরতার হার শতকরা ৬১.৮ ভাগ (পুরুষ ৬৪.৪%, মহিলা-৫৯.২%)। ২০১১ সালে উপজেলার গোবরা ইউনিয়নে প্রতিষ্ঠিত বঙ্গবন্ধু শেখ মুজিবুর রহমান বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয় জেলার প্রথম এবং একমাত্র পাবলিক বিশ্ববিদ্যালয় ।পরবর্তীতে, ২০১২ সালে এখানে শেখ সায়েরা খাতুন মেডিকেল কলেজ প্রতিষ্ঠিত হয়। এ উপজেলায় ১৩৩টি সরকারি প্রাথমিক বিদ্যালয়, ৭৭টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৪১টি কিন্ডারগার্টেন স্কুল, ১১টি কমিউনিটি প্রাথমিক বিদ্যালয়, ২টি সরকারি মাধ্যমিক বিদ্যালয়, ৪৭টি বেসরকারি মাধ্যমিক বিদ্যালয়, ৩টি সরকারি ও ১৬টি বেসরকারি কলেজ, ৬টি মাদ্রাসা, ৭১ টি কওমি মাদ্রাসা এবং ১৯টি এবতেদায়ী মাদ্রাসা রয়েছে।\n\n"
                    "অর্থনীতি:  গোপালগঞ্জ মূলত কৃষি প্রধান অঞ্চল। এখানে ধান, গম, পাট, আখ, নানা ধরনের সবজি জন্মে। এছাড়া মৎস্য আহরণসহ এ জায়গার লোকজন বিভিন্ন পেশায় নিয়োজিত থেকে জীবিকা নির্বাহ করছে। বর্তমানে প্রবাসে বসবাসকারীদের সংখ্যা দিন দিন বৃদ্ধি পাচ্ছে।\n\n"
                    "নদনদী:  গোপালগঞ্জ সদর উপজেলায় অনেকগুলো নদী আছে। সেগুলো হচ্ছে মধুমতি নদী, মাদারীপুর নদী এবং আঠারোবাঁকি নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

//kashiyani
class kashiyani extends StatelessWidget {
  const kashiyani({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে কাশিয়ানী উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  কাশিয়ানী উপজেলা ৩০০১৪' উত্তর অক্ষাংশ এবং ৮৯০১২' পূর্ব দ্রাঘিমাংশে অবস্থিত। কাশিয়ানী উপজেলার উত্তরে ফরিদপুর জেলার বোয়ালমারী উপজেলা, পশ্চিমে আলফাডাংগা, পূর্বে গোপালগঞ্জ জেলার মুকসুদপুর উপজেলা এবং দক্ষিণে গোপালগঞ্জ সদর উপজেলা। মধুমতি ও বারাশিয়া নদী কাশিয়ানীকে অন্য উপজেলা হতে পৃথক করেছে।\n\n"
                    "প্রশাসনিক এলাকা:  কাশিয়ানী উপজেলায় মোট ১৪ ইউনিয়ন ও ১৫৩ টি মৌজা আছে।\n\n"
                    "ইতিহাস:  এককালের একটি বিখ্যাত গ্রাম। এখন গোপালগঞ্জ জেলার একটি উপজেলা। কাশিয়ানী-ভাটিয়াপাড়া রেলপথ এই উপজেলার যোগাযোগের একটি বড় মাধ্যম। মধুমতি নদী এবং বারাশিয়া নদীও এই উপজেলার মূখ্য নৌপথ। নওয়াব আলীবর্দি খাঁর আমলে এই গ্রামের জমিদার ছিলেন বাবু দর্পনারায়ণ সেন। নিজ গ্রামে তিনি স্থাপন করেছিলেন কাশীনাথ দেবের ৫টি মূর্তি সহ ৫টি সুদৃশ্য মন্দির। কাশীনাথ দেবের নামানুসারে দর্পনারায়ণ সেনের গ্রামটির নাম হয়ে যায় কাশিয়ানী। অন্যমতে শোনা যায় যে, এ অঞ্চলে পূর্বে প্রচুর কাশফুল হতো, এজন্য এ উপজেলার নাম হযেছে কাশিয়ানী। ভটিয়াপাড়া ও ফুকরা মুক্তিযুদ্ধের স্মৃতি বিজড়িত স্থান, ওড়াকান্দি ঠাকুরবাড়ী সমধিক পরিচিত তীর্থস্থান। ১৯০৮ সালে মুকসুদপুরকে ভেঙ্গে কাশিয়ানী একটি সতন্ত্র থানা হিসেবে প্রতিষ্ঠিত হয়। ১৯৮৩ সালে কাশিয়ানী মানউন্নিত থানায় রম্নপান্তরিত হয়।\n\n"
                    "জনসংখ্যার উপাত্ত:  জনসংখ্যা ২,২৮,৬৪৭ জন। ঘনত্ব- ৭৬২ জন (প্রতি ব:কি:মি:)৷\n\n"
                    "নদনদী:  কাশিয়ানী উপজেলায় তিনটি নদী আছে। সেগুলো হচ্ছে মধুমতি নদী,কুমার নদী এবংচন্দনা-বারাশিয়া নদী।\n\n"
                    "রেলপথ:  গোবরা-কাশিয়ানী একক ডিজেল রেলপথ এই উপজেলার মধ্য দিয়ে গিয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

//tongipara
class tongipara extends StatelessWidget {
  const tongipara({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে টুংগীপাড়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা:  টুংগীপাড়া উপজেলার ভৌগোলিক অবস্থান ২২.৯০০০° উত্তর ৮৯.৮৮৩৩° পূর্ব। এই উপজেলাটির আয়তন ১২৭.২৫ বর্গকিলোমিটার। টুংগীপাড়া উপজেলার কেন্দ্র থেকে পূর্বে কোটালীপাড়া উপজেলা, পশ্চিম ও উত্তরে গোপালগঞ্জ সদর এবং দক্ষিণে চিতলমারী ও বাগেরহাট উপজেলা অবস্থিত। এই উপজেলার উপর দিয়ে মধুমতি নদী, বাঘিয়ার নদ, শৈলদাহ নদী সহ বেশ কয়েকটি নদী প্রবাহিত হয়েছে।\n\n"
                    "প্রশাসন:  ১৯৭৪ সালে গোপালগঞ্জ সদর থানাকে ভেঙ্গে টুংগীপাড়া থানা গঠন করা হয়। পরবর্তীতে, ১৯৯৫ সালে এটি থানা থেকে উপজেলায় রুপান্তরিত হয়। টুংগীপাড়া উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ৫টি ইউনিয়ন, ৩৩টি মৌজা ও ৬৯টি গ্রাম রয়েছে। ১৯৯৭ সালের ১০ জানুয়ারী টুংগীপাড়াকে পৌরসভায় রূপান্তর করা হয় এবং উপজেলা নির্বাহী অফিসার পৌর প্রশাসকের দায়িত্ব পালন করেন। বর্তমানে পৌরসভাটি স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয় কর্তৃক দ্বিতীয় শ্রেণীর (খ-শ্রেণী) পৌরসভা হিসেবে স্বীকৃত। পৌরসভার আয়তন ২.৫৭ বর্গ কি:মি:। পৌরসভার ওয়ার্ড সংখ্যা ৯টি। ১৯৯৯ সালের ২৪শে ফেব্রুয়ারি প্রথম পৌরসভা নির্বাচন অনুষ্ঠিত হয়। বর্তমানে শেখ আহমেদ হোসেন মির্জা পৌরসভার মেয়র হিসেবে দায়িত্ব পালন করছেন।\n\n"
                    "অর্থনীতি:  টুংগীপাড়ার জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৭০.০৮%। এছাড়া অকৃষি শ্রমিক ২.১৯%, ব্যবসা ১১.৩৬%, পরিবহন ও যোগাযোগ ০.৯৯%, চাকরি ৮.৮২%, নির্মাণ ০.৫৮%, ধর্মীয় সেবা ০.৪১%, রেন্ট অ্যান্ড রেমিটেন্স ০.৩৫% এবং অন্যান্য ৫.২২%।[৭] এখানকার প্রধান ফসল ধান, পাট, সরিষা, ডাল, মিষ্টি আলু, চীনাবাদাম, সূর্যমুখী, আখ, গম, পান, শাকসবজি ইত্যাদি। উৎপাদিত ফলের মধ্যে আম, কাঁঠাল, কলা, পেঁপে, নারিকেল, তাল, পেয়ারা, লেবু, লিচু অন্যতম। এছাড়াও এই উপজেলায় বাণিজ্যিকভাবে মাছ, গবাদিপশু ও হাঁস-মুরগির চাষ করা হয়।\n\n"
                    "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী টুংগীপাড়ার গড় সাক্ষরতার হার শতকরা ৫৬.৬%; (পুরুষ ৫৭.২%, নারী ৫৬.০%)। এ উপজেলায় ৪২ টি সরকারি প্রাথমিক বিদ্যালয়, ৫৩টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৮টি কিন্ডারগার্টেন স্কুল, ৪১টি কমিউনিটি প্রাথমিক বিদ্যালয়, ১টি সরকারি মাধ্যমিক বিদ্যালয়, ১৬টি বেসরকারি মাধ্যমিক বিদ্যালয়, ১টি সরকারি ও ১ টি বেসরকারি কলেজ, ১৪টি মাদ্রাসা এবং ০৩টি এবতেদায়ী মাদ্রাসা রয়েছে। এই উপজেলার উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠানের মধ্যে রয়েছে সরকারি শেখ মুজিবুর রহমান কলেজ যেটি ১৯৮৬ সালের ১৩ই সেপ্টম্বর প্রতিষ্ঠিত হয় এবং জামিয়া ইসলামিয়া দারুল উলুম খাদেমুল ইসলাম গওহরডাঙ্গা মাদ্রাসা যেটি ১৯৩৭ সালে শামসুল হক ফরিদপুরী প্রতিষ্ঠা করেন এবং বর্তমানে এটি একটি কওমি মাদ্রাসা শিক্ষা বোর্ড হিসেবে পরিচালিত হচ্ছে। এছাড়াও রয়েছে গিমাডাঙ্গা প্রাথমিক বিদ্যালয় যেখানে ভর্তির মাধ্যমে শেখ মুজিবুর রহমান শিক্ষাজীবন শুরু করেন।\n\n"
                    "স্বাস্থ্য:  সামগ্রিকভাবে এই উপজেলার স্বাস্থ্য ব্যবস্থা বাংলাদেশের অন্যান্য অঞ্চলের মতই। ফলে এই অঞ্চলের মানুষ অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগে বেশি আক্রান্ত হয়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ২টি বেসরকারি হাসপাতাল রয়েছে। ৫টি স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ১টি পরিবার পরিকল্পনা ক্লিনিক এবং ৭টি কমিউনিটি ক্লিনিক রয়েছে। এছাড়াও এখানে শেখ রাসেল দুঃস্থ শিশু প্রশিক্ষণ ও পূর্ণবাসন কেন্দ্র নামে একটি বিশেষায়িত প্রতিষ্ঠান রয়েছে।\n\n"
                    "যোগাযোগ ব্যবস্থা:  টুংগীপাড়া উপজেলায় কোনো জাতীয় বা আঞ্চলিক মহাসড়ক নেই। টুংগীপাড়াকে জেলা সড়ক জেড৮৪৩০ (টুঙ্গিপাড়া-কোটালীপাড়া সড়ক) কোটালীপাড়া উপজেলার সাথে এবং জেলা সড়ক জেড৭০৫৪ (চিতলমারী-টুংগীপাড়া-পাটগাতি সড়ক) চিতলমারী হয়ে বাগেরহাট জেলার সাথে স্থলপথে সংযুক্ত করেছে। টুংগীপাড়া থেকে ঢাকাগামী অধিকাংশ বাস গোপালগঞ্জ হয়ে সায়েদাবাদ বাস টার্মিনাল, গুলিস্থান ও গাবতলী বাস টার্মিনালে এসে থামে। টুংগীপাড়া জিরো পয়েন্ট থেকে গোপালগঞ্জ জেলা সদরের দূরুত্ব ২২ কিলোমিটার, রাজধানী ঢাকার দূরত্ব ২০০ কিলোমিটার। এ উপজেলায় কোন রেললাইন বা ট্রেন যোগাযোগের ব্যবস্থা নেই। এখানে এক ইউনিয়ন হতে অন্য ইউনিয়নে চলাচল বা অভ্যন্তরীন নৌযাতায়াতের এর জন্য স্থানীয় নৌযান রয়েছে। এছাড়া এই উপজেলার পাটগাতী, বাঁশবাড়ীয়া এবং তারাইল নৌ-বন্দর সমূহ থেকে ঢাকা, খুলনা, বরিশাল, পিরোজপুর, নাজিরপুর, বাগেরহাট, বানারীপাড়া, কোটালীপাড়াসহ অন্যান্য স্থানে নৌ-যান চলাচল করে থাকে।\n\n"
                    "নদনদী:  টুঙ্গিপাড়া উপজেলায় তিনটি নদী আছে। সেগুলো হচ্ছে ঘাঘর নদী, মধুমতি নদী, দাড়ির গাঙ নদী, কাটাখাল নদী এবং শালদহ নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

//kutalipara
class kutalipara extends StatelessWidget {
  const kutalipara({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে কোটালীপাড়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  কোটালীপাড়া উপজেলার ভৌগোলিক অবস্থান ২২°৫২´ থেকে ২৩°০৮´ উত্তর অক্ষাংশ এবং ৮৯°৫৫´ থেকে ৮৯°০৮´ পূর্ব দ্রাঘিমাংশ। এর মোট আয়তন ৩৫৫.৯০ বর্গ কিলোমিটার।[১৩] কোটালীপাড়া উপজেলার কেন্দ্র থেকে উত্তরে মাদারীপুর পশ্চিমে গোপালগঞ্জ জেলা সদর অবস্থিত। কোটালীপাড়া উপজেলার উত্তরে মাদারীপুর জেলার রাজৈর ও মাদারীপুর সদর উপজেলা, দক্ষিণে পিরোজপুর জেলার নাজিরপুর ও বরিশাল জেলার উজিরপুর উপজেলা, পূর্বে বরিশালের আগৈলঝাড়া, গৌরনদী ও মাদারীপুরের কালকিনি উপজেলা, পশ্চিমে গোপালগঞ্জ সদর ও টুঙ্গিপাড়া উপজেলা অবস্থিত।\n\n"
                    "প্রশাসন:  ১৮১২ সালে বাকেরগঞ্জ জেলার অধীনে কোটালীপাড়া থানা গঠন করা হয়, যা ১৮৫৪ সালে সৃষ্ট মাদারীপুর মহকুমার অন্তর্ভুক্ত করা হয়। পরবর্তীতে ১৯০৯ সালে গোপালগঞ্জ মহকুমা গঠন করা হলে কোটালীপাড়া গোপালগঞ্জের অন্তর্ভুক্ত হয়। ১৯৮৪ সালে গোপালগঞ্জ জেলা হিসেবে স্বীকৃতি পায় এবং তখন কোটালীপাড়া থানা উপজেলায় রুপান্তরিত হয়। কোটালীপাড়া উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ১২টি ইউনিয়ন, ১০০টি মৌজা ও ১৯৭টি গ্রাম রয়েছে।\n\n"
                    "অর্থনীতি:  কোটালিপাড়ার জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৭০.৪০%, অকৃষি শ্রমিক ১.১১%, শিল্প ০.৪০%, ব্যবসা ১৩.৮০%, পরিবহন ও যোগাযোগ ১.০০%, চাকরি ৬.১৪%, নির্মাণ ১.৩৪%, ধর্মীয় সেবা ০.২৫%, রেন্ট অ্যান্ড রেমিটেন্স ০.০৬% এবং অন্যান্য ৫.৫০%। এছাড়াও এখানে ধান, গম, চীনাবাদাম, মেসতা বাণিজ্যিকভাবে চাষ হয়। রবি ও খরিফ ফসল হিসেবে চীনাবাদাম চাষ হয়। ২০০১ সালের ভূমি জরিপ অনুসারে কোটালিপাড়ার ৮৪.৪৬ শতাংশ বসবাসকারীর কৃষিভূমির মালিকানা রয়েছে। কোটালিপাড়ার প্রধান কৃষিজ ফসল ধান, পাট, গম, পান, চীনাবাদাম ও শাকসবজি। ফলের মধ্যে তরমুজ, ফুটি, তাল সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, মৎস খামার ও নার্সারি রয়েছে।\n\n"
                    "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী কোটালিপাড়ার গড় সাক্ষরতার হার শতকরা ৫৮.১%; (পুরুষ ৬০.৩%, নারী ৫৬.০%)। এ উপজেলায় ১০৪ টি সরকারি প্রাথমিক বিদ্যালয়, ৬৯টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৫টি কিন্ডারগার্টেন স্কুল, ৩৯ টি কমিউনিটি প্রাথমিক বিদ্যালয়, ৪৪ টি মাধ্যমিক বিদ্যালয়, ০৫ টি মাদ্রাসা, ০৭ টি এবতেদায়ী মাদ্রাসা, ০৬ টি কলেজ, ০১ টি কারিগরি কলেজ রয়েছে।\n\n"
                    "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। কোটালীপাড়া অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ১২টি বেসরকারি হাসপাতাল রয়েছে। ১০টি স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ১টি পরিবার পরিকল্পনা ক্লিনিক, ৫টি উপ-স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র রয়েছে। এছাড়াও ২৯টি কমিউনিটি ক্লিনিক রয়েছে।\n\n"
                    "যোগাযোগ ব্যবস্থা:  কোটালীপাড়া উপজেলায় কোনো জাতীয় বা আঞ্চলিক মহাসড়ক নেই। জেলা সড়ক জেড৮৪৩০ (টুঙ্গিপাড়া-কোটালীপাড়া সড়ক) টুঙ্গিপাড়া উপজেলার সাথে এবং জেলা সড়ক জেড৮০৩১ (গৌরনদী-পয়সারহাট-কোটালীপাড়া-গোপালগঞ্জ সড়ক) কোটালীপাড়াকে জাতীয় মহাসড়ক এন৮ এর গৌরনদী থেকে কোটালীপাড়া হয়ে গোপালগঞ্জ সদর উপজেলার সাথে সংযোগ স্থাপন করেছে। এছাড়া কোটালীপাড়া-রাজৈর সড়ক কোটালীপাড়ার সাথে রাজৈর ও জাতীয় মহাসড়ক এন৮ এর সংযোগ স্থাপন করেছে। কোটালীপাড়া থেকে গোপালগঞ্জ হয়ে ঢাকাগামী অধিকাংশ বাস সায়েদাবাদ বাস টার্মিনাল, গুলিস্থান ও গাবতলী বাস টার্মিনালে এসে থামে। কোটালীপাড়া জিরো পয়েন্ট থেকে গোপালগঞ্জ জেলা সদরের দূরুত্ব ২০ কিলোমিটার, রাজধানী ঢাকার দূরত্ব ২০০ কিলোমিটার। ২০১১ সালের হিসেব অনুযায়ী এ উপজেলায় ২০০ কিলোমিটার পাকারাস্তা, ১২৬ কিলোমিটার আধা-পাকারাস্তা ও ৩৬৩ কিলোমিটার কাঁচারাস্তা রয়েছে।[২৯] এ উপজেলায় কোন রেললাইন বা ট্রেন যোগাযোগের ব্যবস্থা নেই। ঢাকা সদরঘাট লঞ্চ টার্মিনাল হতে পয়সারহাট লঞ্চ টার্মিনালে নৌপথ নিয়মিত নৌযাতায়াতের ব্যবস্থা রয়েছে। এছাড়া এক ইউনিয়ন হতে অন্য ইউনিয়নে চলাচল বা অভ্যন্তরীন নৌযাতায়াতের এর জন্য স্থানীয় নৌযান রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

//muksudpur
class muksudpur extends StatelessWidget {
  const muksudpur({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে মুকসুদপুর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান ও আয়তন:  মুকসুদপুর উপজেলার আয়তন ৩০৯.৬৩ বর্গ কিমি। এটি ২৩°১০´ থেকে ২৩°২২´ উত্তর অক্ষাংশ এবং ৮৯°৪৮´ থেকে ৯০°০৮´ পূর্ব দ্রাঘিমাংশে অবস্থিত। মুকসুদপুর উপজেলার উত্তরে ফরিদপুর জেলার নগরকান্দা ও সালথা উপজেলা, দক্ষিণাংশে গোপালগঞ্জ সদর ও কাশিয়ানি উপজেলা, পশ্চিমে ফরিদপুরের বোয়ালমারী উপজেলা, পূর্বে মাদারীপুরের রাজৈর উপজেলা ও ফরিদপুরের ভাঙ্গা উপজেলা অবস্থিত।\n\n"
                    "প্রশাসনিক এলাকা:  মুকসুদপুর থানা গঠিত হয়েছিল ১৯৬১ সালে৷ বর্তমানে এটি উপজেলা৷ এই উপজেলার একটি পৌরসভা (১৬.৭৭ বর্গ কিঃ মিঃ), ২০৬ টি মৌজা, ২৫৪ টি গ্রাম আছে৷ এ উপজেলাটিতে প্রায় ২৮৪২০৫ জনের বসবাস৷ শিক্ষার হার প্রায় ৪৭ শতাংশ ৷\n\n"
                    "অর্থনীতি:  মুকসুদপুর উপজেলার জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৬৩%। এছাড়া আয়ের অন্যান্য উৎসের মধ্যে অকৃষি শ্রমিক ২.১৪%, শিল্প ০.৫৩%, ব্যবসা ১৩.০৫%, পরিবহন ও যোগাযোগ ১.২১%, চাকরি ৮.৯%, নির্মাণ ২.৪%, ধর্মীয় সেবা ০.২২%, রেন্ট অ্যান্ড রেমিটেন্স ০.৭% এবং অন্যান্য ৭.৮৫%। এই উপজেলায় উৎপাদিত প্রধান ফসল হচ্ছে ধান, পাট, সরিষা, ডাল, আখ, গম, পান, পিঁয়াজ, মিষ্টি আলু এবং শাকসবজি ইত্যাদি। উৎপাদিত ফলের মধ্যে আম, কাঁঠাল, কলা, পেঁপে, নারিকেল, তাল, পেয়ারা, লেবু, লিচু অন্যতম। এছাড়াও এই উপজেলায় বাণিজ্যিকভাবে মাছ, গবাদিপশু ও হাঁস-মুরগির চাষ করা হয়। এ উপজেলার চান্দার বিল এলাকায় পীট কয়লার সন্ধান পাওয়া গেছে।\n\n"
                    "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী মুকসুদপুরের গড় সাক্ষরতার হার শতকরা ৫২.৫%; (পুরুষ ৫৪.৮%, নারী ৫০.৫%)। এ উপজেলায় ১২৮টি সরকারি প্রাথমিক বিদ্যালয়, ৬১টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৭টি কিন্ডারগার্টেন স্কুল, ৯টি কমিউনিটি প্রাথমিক বিদ্যালয়, ৪৩টি বেসরকারি মাধ্যমিক বিদ্যালয়, ১টি সরকারি ও ৪টি বেসরকারি কলেজ, ৮১টি মাদ্রাসা, ৪৪টি কওমি মাদ্রাসা এবং ১৯টি এবতেদায়ী মাদ্রাসা রয়েছে। উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠানের মধ্যে রয়েছে\n\n"
                    "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। দেশের অন্যান্য অঞ্চলের মত এই অঞ্চলেও অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ৪টি বেসরকারি হাসপাতাল রয়েছে। ১৩টি স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ১টি পরিবার পরিকল্পনা ক্লিনিক, ১টি মিশনারি হাসপাতাল রয়েছে।\n\n"
                    "নদনদী:  মুকসুদপুরের উল্লেখযোগ্য নদী কুমার। মুকসুদপুর উপজেলার মধ্য দিয়ে কুমার নদী বয়ে গেছে। নদীর দুই তীর পানি উন্নয়ণ বোর্ড কর্তৃক বেড়ী বাধ নির্মাণ করা আছে। এছাড়াও মুকসুদপুর উপজেলার মধ্য দিয়ে মধুমতি বিলরুট ক্যানেল বয়ে গেছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
