import 'package:flutter/material.dart';

//gopalgongSadar
class gopalgongSadar extends StatelessWidget {
  const gopalgongSadar({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে গোপালগঞ্জ সদর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  গোপালগঞ্জ সদর উপজেলার ভৌগোলিক অবস্থান ২৩.০১৬৭° উত্তর ৮৯.৮৩৩৩° পূর্ব। এই উপজেলাটির আয়তন ৩৮৯.৪২ বর্গকিলোমিটার। গোপালগঞ্জ সদর উপজেলার উত্তরে মুকসুদপুর-কাশিয়ানী উপজেলা ও নড়াইল জেলার লোহাগড়া উপজেলা, পূর্বে কোটালীপাড়া উপজেলা ও মাদারীপুর জেলার রাজৈর উপজেলা, দক্ষিণে টুঙ্গিপাড়া উপজেলা ও বাগেরহাট জেলার মোল্লাহাট উপজেলা এবং পশ্চিমে নড়াইল জেলার কালিয়া উপজেলা ও বাগেরহাটের মোল্লাহাট উপজেলা অবস্থিত।\n\n"
                "প্রশাসনিক এলাকা:  ১৯৮৪ সালের ফেব্রুয়ারিতে গোপালগঞ্জ সদর থানা উপজেলায় উন্নীত হয়। গোপালগঞ্জ সদর উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ২১টি ইউনিয়ন, ১২৭টি মৌজা ও ১৯৭টি গ্রাম রয়েছে। বর্তমানে উপজেলা চেয়ারম্যান হিসেবে দায়িত্ব পালন করছেন শেখ লুৎফার রহমান বাচ্চু। ১৯৭২ সালের ২০ জানুয়ারী গোপালগঞ্জ পৌরসভা প্রতিষ্ঠিত হয়। উপজেলা নির্বাহী অফিসার পৌর প্রশাসকের দায়িত্ব পালন করেন। পৌরসভাটি স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয় কর্তৃক ২০ জানুয়ারী ১৯৭২ তৃতীয় শ্রেণী (গ-শ্রেণী), ২৬ ডিসেম্বর, ১৯৮৯ দ্বিতীয় শ্রেণীর (খ-শ্রেণী) এবং ১০ জুলাই ১৯৯৬ প্রথম শ্রেণীর (ক-শ্রেণী) পৌরসভা হিসেবে স্বীকৃত পায়। পৌরসভার আয়তন ১৩.৮২ বর্গ কি:মি:। পৌরসভার ওয়ার্ড সংখ্যা ৯টি। বর্তমানে কাজী লিয়াকত আলী পৌরসভার মেয়র হিসেবে দায়িত্ব পালন করছেন।\n\n"
                "জনসংখ্যার উপাত্ত:  ২০১১ সালের জেলা পরিসংখ্যান অনুযায়ী গোপালগঞ্জ সদর উপজেলার মোট জনসংখ্যা ৩,৪৪,০০৮ জন যাদের মধ্যে পুরুষ ১,৭২,৯৯১ এবং নারী ১,৭১,০১৭ জন।\n\n"
                "শিক্ষা প্রতিষ্ঠান:  ২০১১ সালের হিসেব অনুযায়ী গোপালগঞ্জ শহরের গড় সাক্ষরতার হার শতকরা ৬১.৮ ভাগ (পুরুষ ৬৪.৪%, মহিলা-৫৯.২%)। ২০১১ সালে উপজেলার গোবরা ইউনিয়নে প্রতিষ্ঠিত বঙ্গবন্ধু শেখ মুজিবুর রহমান বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয় জেলার প্রথম এবং একমাত্র পাবলিক বিশ্ববিদ্যালয় ।পরবর্তীতে, ২০১২ সালে এখানে শেখ সায়েরা খাতুন মেডিকেল কলেজ প্রতিষ্ঠিত হয়। এ উপজেলায় ১৩৩টি সরকারি প্রাথমিক বিদ্যালয়, ৭৭টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৪১টি কিন্ডারগার্টেন স্কুল, ১১টি কমিউনিটি প্রাথমিক বিদ্যালয়, ২টি সরকারি মাধ্যমিক বিদ্যালয়, ৪৭টি বেসরকারি মাধ্যমিক বিদ্যালয়, ৩টি সরকারি ও ১৬টি বেসরকারি কলেজ, ৬টি মাদ্রাসা, ৭১ টি কওমি মাদ্রাসা এবং ১৯টি এবতেদায়ী মাদ্রাসা রয়েছে।\n\n"
                "অর্থনীতি:  গোপালগঞ্জ মূলত কৃষি প্রধান অঞ্চল। এখানে ধান, গম, পাট, আখ, নানা ধরনের সবজি জন্মে। এছাড়া মৎস্য আহরণসহ এ জায়গার লোকজন বিভিন্ন পেশায় নিয়োজিত থেকে জীবিকা নির্বাহ করছে। বর্তমানে প্রবাসে বসবাসকারীদের সংখ্যা দিন দিন বৃদ্ধি পাচ্ছে।\n\n"
                "নদনদী:  গোপালগঞ্জ সদর উপজেলায় অনেকগুলো নদী আছে। সেগুলো হচ্ছে মধুমতি নদী, মাদারীপুর নদী এবং আঠারোবাঁকি নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
