import 'package:flutter/material.dart';

//kutalipara
class kutalipara extends StatelessWidget {
  const kutalipara({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে কোটালীপাড়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  কোটালীপাড়া উপজেলার ভৌগোলিক অবস্থান ২২°৫২´ থেকে ২৩°০৮´ উত্তর অক্ষাংশ এবং ৮৯°৫৫´ থেকে ৮৯°০৮´ পূর্ব দ্রাঘিমাংশ। এর মোট আয়তন ৩৫৫.৯০ বর্গ কিলোমিটার।[১৩] কোটালীপাড়া উপজেলার কেন্দ্র থেকে উত্তরে মাদারীপুর পশ্চিমে গোপালগঞ্জ জেলা সদর অবস্থিত। কোটালীপাড়া উপজেলার উত্তরে মাদারীপুর জেলার রাজৈর ও মাদারীপুর সদর উপজেলা, দক্ষিণে পিরোজপুর জেলার নাজিরপুর ও বরিশাল জেলার উজিরপুর উপজেলা, পূর্বে বরিশালের আগৈলঝাড়া, গৌরনদী ও মাদারীপুরের কালকিনি উপজেলা, পশ্চিমে গোপালগঞ্জ সদর ও টুঙ্গিপাড়া উপজেলা অবস্থিত।\n\n"
                "প্রশাসন:  ১৮১২ সালে বাকেরগঞ্জ জেলার অধীনে কোটালীপাড়া থানা গঠন করা হয়, যা ১৮৫৪ সালে সৃষ্ট মাদারীপুর মহকুমার অন্তর্ভুক্ত করা হয়। পরবর্তীতে ১৯০৯ সালে গোপালগঞ্জ মহকুমা গঠন করা হলে কোটালীপাড়া গোপালগঞ্জের অন্তর্ভুক্ত হয়। ১৯৮৪ সালে গোপালগঞ্জ জেলা হিসেবে স্বীকৃতি পায় এবং তখন কোটালীপাড়া থানা উপজেলায় রুপান্তরিত হয়। কোটালীপাড়া উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ১২টি ইউনিয়ন, ১০০টি মৌজা ও ১৯৭টি গ্রাম রয়েছে।\n\n"
                "অর্থনীতি:  কোটালিপাড়ার জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৭০.৪০%, অকৃষি শ্রমিক ১.১১%, শিল্প ০.৪০%, ব্যবসা ১৩.৮০%, পরিবহন ও যোগাযোগ ১.০০%, চাকরি ৬.১৪%, নির্মাণ ১.৩৪%, ধর্মীয় সেবা ০.২৫%, রেন্ট অ্যান্ড রেমিটেন্স ০.০৬% এবং অন্যান্য ৫.৫০%। এছাড়াও এখানে ধান, গম, চীনাবাদাম, মেসতা বাণিজ্যিকভাবে চাষ হয়। রবি ও খরিফ ফসল হিসেবে চীনাবাদাম চাষ হয়। ২০০১ সালের ভূমি জরিপ অনুসারে কোটালিপাড়ার ৮৪.৪৬ শতাংশ বসবাসকারীর কৃষিভূমির মালিকানা রয়েছে। কোটালিপাড়ার প্রধান কৃষিজ ফসল ধান, পাট, গম, পান, চীনাবাদাম ও শাকসবজি। ফলের মধ্যে তরমুজ, ফুটি, তাল সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, মৎস খামার ও নার্সারি রয়েছে।\n\n"
                "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী কোটালিপাড়ার গড় সাক্ষরতার হার শতকরা ৫৮.১%; (পুরুষ ৬০.৩%, নারী ৫৬.০%)। এ উপজেলায় ১০৪ টি সরকারি প্রাথমিক বিদ্যালয়, ৬৯টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৫টি কিন্ডারগার্টেন স্কুল, ৩৯ টি কমিউনিটি প্রাথমিক বিদ্যালয়, ৪৪ টি মাধ্যমিক বিদ্যালয়, ০৫ টি মাদ্রাসা, ০৭ টি এবতেদায়ী মাদ্রাসা, ০৬ টি কলেজ, ০১ টি কারিগরি কলেজ রয়েছে।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। কোটালীপাড়া অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ১২টি বেসরকারি হাসপাতাল রয়েছে। ১০টি স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ১টি পরিবার পরিকল্পনা ক্লিনিক, ৫টি উপ-স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র রয়েছে। এছাড়াও ২৯টি কমিউনিটি ক্লিনিক রয়েছে।\n\n"
                "যোগাযোগ ব্যবস্থা:  কোটালীপাড়া উপজেলায় কোনো জাতীয় বা আঞ্চলিক মহাসড়ক নেই। জেলা সড়ক জেড৮৪৩০ (টুঙ্গিপাড়া-কোটালীপাড়া সড়ক) টুঙ্গিপাড়া উপজেলার সাথে এবং জেলা সড়ক জেড৮০৩১ (গৌরনদী-পয়সারহাট-কোটালীপাড়া-গোপালগঞ্জ সড়ক) কোটালীপাড়াকে জাতীয় মহাসড়ক এন৮ এর গৌরনদী থেকে কোটালীপাড়া হয়ে গোপালগঞ্জ সদর উপজেলার সাথে সংযোগ স্থাপন করেছে। এছাড়া কোটালীপাড়া-রাজৈর সড়ক কোটালীপাড়ার সাথে রাজৈর ও জাতীয় মহাসড়ক এন৮ এর সংযোগ স্থাপন করেছে। কোটালীপাড়া থেকে গোপালগঞ্জ হয়ে ঢাকাগামী অধিকাংশ বাস সায়েদাবাদ বাস টার্মিনাল, গুলিস্থান ও গাবতলী বাস টার্মিনালে এসে থামে। কোটালীপাড়া জিরো পয়েন্ট থেকে গোপালগঞ্জ জেলা সদরের দূরুত্ব ২০ কিলোমিটার, রাজধানী ঢাকার দূরত্ব ২০০ কিলোমিটার। ২০১১ সালের হিসেব অনুযায়ী এ উপজেলায় ২০০ কিলোমিটার পাকারাস্তা, ১২৬ কিলোমিটার আধা-পাকারাস্তা ও ৩৬৩ কিলোমিটার কাঁচারাস্তা রয়েছে।[২৯] এ উপজেলায় কোন রেললাইন বা ট্রেন যোগাযোগের ব্যবস্থা নেই। ঢাকা সদরঘাট লঞ্চ টার্মিনাল হতে পয়সারহাট লঞ্চ টার্মিনালে নৌপথ নিয়মিত নৌযাতায়াতের ব্যবস্থা রয়েছে। এছাড়া এক ইউনিয়ন হতে অন্য ইউনিয়নে চলাচল বা অভ্যন্তরীন নৌযাতায়াতের এর জন্য স্থানীয় নৌযান রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
