import 'package:flutter/material.dart';

//tongipara
class tongipara extends StatelessWidget {
  const tongipara({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে টুংগীপাড়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা:  টুংগীপাড়া উপজেলার ভৌগোলিক অবস্থান ২২.৯০০০° উত্তর ৮৯.৮৮৩৩° পূর্ব। এই উপজেলাটির আয়তন ১২৭.২৫ বর্গকিলোমিটার। টুংগীপাড়া উপজেলার কেন্দ্র থেকে পূর্বে কোটালীপাড়া উপজেলা, পশ্চিম ও উত্তরে গোপালগঞ্জ সদর এবং দক্ষিণে চিতলমারী ও বাগেরহাট উপজেলা অবস্থিত। এই উপজেলার উপর দিয়ে মধুমতি নদী, বাঘিয়ার নদ, শৈলদাহ নদী সহ বেশ কয়েকটি নদী প্রবাহিত হয়েছে।\n\n"
                "প্রশাসন:  ১৯৭৪ সালে গোপালগঞ্জ সদর থানাকে ভেঙ্গে টুংগীপাড়া থানা গঠন করা হয়। পরবর্তীতে, ১৯৯৫ সালে এটি থানা থেকে উপজেলায় রুপান্তরিত হয়। টুংগীপাড়া উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ৫টি ইউনিয়ন, ৩৩টি মৌজা ও ৬৯টি গ্রাম রয়েছে। ১৯৯৭ সালের ১০ জানুয়ারী টুংগীপাড়াকে পৌরসভায় রূপান্তর করা হয় এবং উপজেলা নির্বাহী অফিসার পৌর প্রশাসকের দায়িত্ব পালন করেন। বর্তমানে পৌরসভাটি স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয় কর্তৃক দ্বিতীয় শ্রেণীর (খ-শ্রেণী) পৌরসভা হিসেবে স্বীকৃত। পৌরসভার আয়তন ২.৫৭ বর্গ কি:মি:। পৌরসভার ওয়ার্ড সংখ্যা ৯টি। ১৯৯৯ সালের ২৪শে ফেব্রুয়ারি প্রথম পৌরসভা নির্বাচন অনুষ্ঠিত হয়। বর্তমানে শেখ আহমেদ হোসেন মির্জা পৌরসভার মেয়র হিসেবে দায়িত্ব পালন করছেন।\n\n"
                "অর্থনীতি:  টুংগীপাড়ার জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৭০.০৮%। এছাড়া অকৃষি শ্রমিক ২.১৯%, ব্যবসা ১১.৩৬%, পরিবহন ও যোগাযোগ ০.৯৯%, চাকরি ৮.৮২%, নির্মাণ ০.৫৮%, ধর্মীয় সেবা ০.৪১%, রেন্ট অ্যান্ড রেমিটেন্স ০.৩৫% এবং অন্যান্য ৫.২২%।[৭] এখানকার প্রধান ফসল ধান, পাট, সরিষা, ডাল, মিষ্টি আলু, চীনাবাদাম, সূর্যমুখী, আখ, গম, পান, শাকসবজি ইত্যাদি। উৎপাদিত ফলের মধ্যে আম, কাঁঠাল, কলা, পেঁপে, নারিকেল, তাল, পেয়ারা, লেবু, লিচু অন্যতম। এছাড়াও এই উপজেলায় বাণিজ্যিকভাবে মাছ, গবাদিপশু ও হাঁস-মুরগির চাষ করা হয়।\n\n"
                "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী টুংগীপাড়ার গড় সাক্ষরতার হার শতকরা ৫৬.৬%; (পুরুষ ৫৭.২%, নারী ৫৬.০%)। এ উপজেলায় ৪২ টি সরকারি প্রাথমিক বিদ্যালয়, ৫৩টি রেজিস্টার্ড প্রাথমিক বিদ্যালয়, ৮টি কিন্ডারগার্টেন স্কুল, ৪১টি কমিউনিটি প্রাথমিক বিদ্যালয়, ১টি সরকারি মাধ্যমিক বিদ্যালয়, ১৬টি বেসরকারি মাধ্যমিক বিদ্যালয়, ১টি সরকারি ও ১ টি বেসরকারি কলেজ, ১৪টি মাদ্রাসা এবং ০৩টি এবতেদায়ী মাদ্রাসা রয়েছে। এই উপজেলার উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠানের মধ্যে রয়েছে সরকারি শেখ মুজিবুর রহমান কলেজ যেটি ১৯৮৬ সালের ১৩ই সেপ্টম্বর প্রতিষ্ঠিত হয় এবং জামিয়া ইসলামিয়া দারুল উলুম খাদেমুল ইসলাম গওহরডাঙ্গা মাদ্রাসা যেটি ১৯৩৭ সালে শামসুল হক ফরিদপুরী প্রতিষ্ঠা করেন এবং বর্তমানে এটি একটি কওমি মাদ্রাসা শিক্ষা বোর্ড হিসেবে পরিচালিত হচ্ছে। এছাড়াও রয়েছে গিমাডাঙ্গা প্রাথমিক বিদ্যালয় যেখানে ভর্তির মাধ্যমে শেখ মুজিবুর রহমান শিক্ষাজীবন শুরু করেন।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে এই উপজেলার স্বাস্থ্য ব্যবস্থা বাংলাদেশের অন্যান্য অঞ্চলের মতই। ফলে এই অঞ্চলের মানুষ অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগে বেশি আক্রান্ত হয়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ২টি বেসরকারি হাসপাতাল রয়েছে। ৫টি স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ১টি পরিবার পরিকল্পনা ক্লিনিক এবং ৭টি কমিউনিটি ক্লিনিক রয়েছে। এছাড়াও এখানে শেখ রাসেল দুঃস্থ শিশু প্রশিক্ষণ ও পূর্ণবাসন কেন্দ্র নামে একটি বিশেষায়িত প্রতিষ্ঠান রয়েছে।\n\n"
                "যোগাযোগ ব্যবস্থা:  টুংগীপাড়া উপজেলায় কোনো জাতীয় বা আঞ্চলিক মহাসড়ক নেই। টুংগীপাড়াকে জেলা সড়ক জেড৮৪৩০ (টুঙ্গিপাড়া-কোটালীপাড়া সড়ক) কোটালীপাড়া উপজেলার সাথে এবং জেলা সড়ক জেড৭০৫৪ (চিতলমারী-টুংগীপাড়া-পাটগাতি সড়ক) চিতলমারী হয়ে বাগেরহাট জেলার সাথে স্থলপথে সংযুক্ত করেছে। টুংগীপাড়া থেকে ঢাকাগামী অধিকাংশ বাস গোপালগঞ্জ হয়ে সায়েদাবাদ বাস টার্মিনাল, গুলিস্থান ও গাবতলী বাস টার্মিনালে এসে থামে। টুংগীপাড়া জিরো পয়েন্ট থেকে গোপালগঞ্জ জেলা সদরের দূরুত্ব ২২ কিলোমিটার, রাজধানী ঢাকার দূরত্ব ২০০ কিলোমিটার। এ উপজেলায় কোন রেললাইন বা ট্রেন যোগাযোগের ব্যবস্থা নেই। এখানে এক ইউনিয়ন হতে অন্য ইউনিয়নে চলাচল বা অভ্যন্তরীন নৌযাতায়াতের এর জন্য স্থানীয় নৌযান রয়েছে। এছাড়া এই উপজেলার পাটগাতী, বাঁশবাড়ীয়া এবং তারাইল নৌ-বন্দর সমূহ থেকে ঢাকা, খুলনা, বরিশাল, পিরোজপুর, নাজিরপুর, বাগেরহাট, বানারীপাড়া, কোটালীপাড়াসহ অন্যান্য স্থানে নৌ-যান চলাচল করে থাকে।\n\n"
                "নদনদী:  টুঙ্গিপাড়া উপজেলায় তিনটি নদী আছে। সেগুলো হচ্ছে ঘাঘর নদী, মধুমতি নদী, দাড়ির গাঙ নদী, কাটাখাল নদী এবং শালদহ নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
