import 'package:flutter/material.dart';

class bandhorbonJela extends StatelessWidget {
  const bandhorbonJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে বান্দরবান জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/jela/chittagong divition jela/BD_Bandarban_District_locator_map.svg.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "বান্দরবান জেলার মোট আয়তন ৪৪৭৯.০২ বর্গ কিলোমিটার।\n\n"
                  "বান্দরবান জেলা বাংলাদেশের সবচেয়ে কম জনবসতিপূর্ণ জেলা। ২০১১ সালের আদমশুমারি অনুযায়ী এ জেলার মোট জনসংখ্যা ৩,৮৮,৩৩৫ জন। এর মধ্যে পুরুষ ২,০৩,৩৫০ জন এবং মহিলা ১,৮৪,৯৮৫ জন। মোট পরিবার ৮০,১০২টি।\n\n"
                  "জনসংখ্যার ঘনত্ব প্রতি বর্গ কিলোমিটারে প্রায় ৮৭ জন।\n\n"
                  "ধর্মবিশ্বাস অনুসারে এ জেলার মোট জনসংখ্যার ৪৯.৩৩% মুসলিম, "
                  "৩.৬২% হিন্দু, ৩৪.৮৮% বৌদ্ধ এবং ১২.১৭% খ্রিস্টান ও অন্যান্য ধর্মাবলম্বী। "
                  "মুসলিম ও হিন্দুরা বাংলাভাষী। এছাড়াও এ জেলায় মারমা, চাকমা, চাক, বম, মুরং, ত্রিপুরা, খেয়াং, "
                  "খুমি, লুসাই প্রভৃতি ক্ষুদ্র-নৃগোষ্ঠীর বসবাস রয়েছে।\n\n"
                  "বাংলাদেশের দক্ষিণ-পূর্বাংশে ২১°১১´ থেকে ২২°২২´ উত্তর অক্ষাংশ এবং ৯২°০৪´ থেকে ৯২°৪১´ পূর্ব দ্রাঘিমাংশ জুড়ে বান্দরবান জেলার অবস্থান।"
                  " রাজধানী ঢাকা থেকে এ জেলার দূরত্ব প্রায় ৩২৫ কিলোমিটার এবং চট্টগ্রাম বিভাগীয় সদর থেকে প্রায় ৭৫ কিলোমিটার। এ জেলার পশ্চিমে কক্সবাজার জেলা ও "
                  "চট্টগ্রাম জেলা, উত্তরে রাঙ্গামাটি জেলা, পূর্বে রাঙ্গামাটি জেলা ও মায়ানমারের চিন প্রদেশ এবং দক্ষিণে ও পশ্চিমে মায়ানমারের রাখাইন প্রদেশ অবস্থিত।\n\n"
                  "এই অঞ্চল সম্পর্কে সর্বপ্রাচীন তথ্য পাওয়া যায় তুংগো সাম্রাজ্য-এর হাইসাওয়াদি রাজ্যের প্রথম সার্কেল প্রধান বা গভর্নর, তবাং শোয়েথী-এর দিনলিপি থেকে, যিনি"
                  " ১৫৩১ খ্রিষ্টাব্দে নিযুক্ত হন। ব্রিটিশ সরকার পঞ্চম বোমং, কং হ্লা প্রু-কে (১৭২৭-১৮১১) সার্কেল প্রধান বা গভর্নর চিহ্নিত এবং ষষ্ঠ বোমং, সাক থাই প্রুকে "
                  "স্বীকৃতি প্রদান করে। পরবর্তী কালে, চিটাগং হিল ট্রাক্টস রেগুলাশন ১৯০০-এর মাধ্যমে তথা আইন প্রয়োগ করে এই অঞ্চলের স্বকীয়তার প্রকাশ করা হয়, যা এখনো "
                  "পর্যন্ত অব্যাহত রয়েছে।\n\n"
                  "বান্দরবান জেলা ৭টি উপজেলা, ৭টি থানা, ২টি পৌরসভা, ৩৩টি ইউনিয়ন, ৯৬টি মৌজা, ১৪৮২টি গ্রাম ও ১টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                  "২০১১ সালের আদমশুমারি অনুযায়ী এ জেলার সাক্ষরতার হার ৩৫.৯%।\n\n"
                  "বান্দরবান অঞ্চলের পাহাড়গুলো মূলত টারসিয়ারী যুগের। পারতপক্ষে ভারতীয় ও ইউরেশীয় টেকটনিক পাত-এর সংঘর্ষের ফলে বান্দরবানের নৈসর্গিক পাহাড়ের সৃষ্টি হয়। কর্কট ক্রান্তি ও বিষুবরেখার মধ্যবর্তী অঞ্চল হওয়ায় এখানকার জলবায়ু নাতিশীতোষ্ণ।\n\n"
                  "এই জেলার অন্যতম নদী সাঙ্গু নদী, যা সাংপো বা শঙ্খ নামেও পরিচিত। এই নদীর বিশেষ বৈশিষ্ট্য হল, এটি বাংলাদেশের একমাত্র নদী যা দক্ষিণ থেকে উত্তরে প্রবাহিত হয়। অন্যান্য নদীর মধ্যে রয়েছে মাতামুহুরী নদী এবং বাঁকখালী নদী।",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
    ;
  }
}
