import 'package:flutter/material.dart';

class chittagongJela extends StatelessWidget {
  const chittagongJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে চট্টগ্রাম জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/800px-Un-bangladesh.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "চট্টগ্রাম জেলা বাংলাদেশের দক্ষিণ-পূর্বাঞ্চলের চট্টগ্রাম বিভাগের একটি প্রশাসনিক অঞ্চল। পাহাড়, সমুদ্র, উপত্যকা, বন‌-বনানীর কারণে চট্টগ্রামের মতো ভৌগোলিক বৈচিত্র "
                  "বাংলাদেশের আর কোন জেলার নেই।\n\nভৌগোলিক অবস্থান : "
                  "বাংলাদেশের দক্ষিণপূর্বে ২০o৩৫' থেকে ২২০৫৯' "
                  "উত্তর অক্ষাংশ এবং ৯১০২৭' থেকে ৯২০২২’ পূর্ব "
                  "দ্রাঘিমাংশ বরাবর এর অবস্থান।\n\nভৌগোলিক সীমানা : চট্টগ্রাম জেলার উত্তরে ফেনী জেলা এবং "
                  "ভারতের ত্রিপুরা রাজ্য, দক্ষিণে কক্সবাজার জেলা, পূর্ব দিকে বান্দরবান, রাঙামাটি, ও খাগড়াছড়ি জেলা, এবং "
                  "পশ্চিমে নোয়াখালী জেলা এবং বঙ্গোপসাগর অবস্থিত। এছাড়া দ্বীপাঞ্চল সন্দ্বীপ চট্টগ্রামের অংশ।\n\n"
                  "চট্টগ্রাম জেলার মোট আয়তন ৫,২৮২.৯২ বর্গ কিলোমিটার (১,৩০৫,৪৩৮ একর)।"
                  "\n\nআয়তনের দিক থেকে এটি বাংলাদেশের দ্বিতীয় বৃহত্তম জেলা।"
                  "\n\n২০১১ সালের আদমশুমারি অনুযায়ী চট্টগ্রাম জেলার মোট জনসংখ্যা ৭৬,১৬,৩৫২ জন। "
                  "এর মধ্যে পুরুষ ৩৮,৩৮,৮৫৪ জন এবং মহিলা ৩৭,৭৭,৪৯৮ জন। মোট পরিবার ১৫,৩২,০১৪টি।জনসংখ্যার ঘনত্ব প্রতি বর্গ কিলোমিটারে প্রায় ১৪৯৮ জন।"
                  " চট্টগ্রামের ধর্মবিশ্বাস-২০১১ইসলাম (৮৬%)হিন্দু ধর্ম (১২%)বৌদ্ধ ও অন্যান্য ধর্ম (২%)ধর্মবিশ্বাস অনুসারে এ "
                  "জেলার মোট জনসংখ্যার ৮৬% মুসলিম, ১২% হিন্দু এবং ২% বৌদ্ধ ও অন্যান্য ধর্মাবলম্বী।"
                  "\n\n১৬৬৬ সালে চট্টগ্রাম জেলা গঠিত হয়। তিন পার্বত্য জেলা এ জেলার অন্তর্ভুক্ত ছিল।"
                  " ১৮৬০ সালে পার্বত্য এলাকা নিয়ে পার্বত্য চট্টগ্রাম জেলা গঠন করা হয়।"
                  "\n\nচট্টগ্রাম জেলা ৪১ ওয়ার্ড বিশিষ্ট ১টি সিটি কর্পোরেশন, ১৫টি উপজেলা, "
                  "৩৩টি থানা (উপজেলায় ১৭টি ও ১৬টি মেট্রোপলিটন থানা), ১৫টি "
                  "পৌরসভা, ১৯০টি ইউনিয়ন, ৮৯০টি মৌজা, ১২৬৭টি গ্রাম ও ১৬টি সংসদীয় আসন নিয়ে গঠিত।"
                  "\n\n২০১১ সালের আদমশুমারি অনুযায়ী চট্টগ্রাম জেলার সাক্ষরতার হার ৫৮.৯%।\n\n"
                  "এ জেলায় রয়েছে:\n\n"
                  "বিশ্ববিদ্যালয় : ১৩টি\n\nসরকারি : ৫টি\n\n"
                  "বেসরকারি : ৮টি\n\nপাবলিক : ৩টি\n\n"
                  "মেডিকেল কলেজ : ৩টি\n\nআইন কলেজ : ৩টি\n\nকলেজ : ১১৯টি\n\nসরকারি (মাস্টার্স) : ৫টি\n\nসরকারি (ডিগ্রী/অনার্স) : ২০টি\n\nবেসরকারি (ডিগ্রী/অনার্স) : ৮২টি\n\n"
                  "সরকারি (উচ্চ মাধ্যমিক) : ১টি\n\n"
                  "বেসরকারি (উচ্চ মাধ্যমিক) : ২৬টি\n\nমাদ্রাসা : ২৯৯টি\n\nকারিগরি শিক্ষা প্রতিষ্ঠান : ১০টি\n\nমাধ্যমিক বিদ্যালয় : ৭১৯টি\n\nসরকারি : ৫৮টি\n\nবেসরকারি : ৬৩২টি\n\n"
                  "স্কুল এন্ড কলেজ : ২৯টি\n\nনিম্ন মাধ্যমিক বিদ্যালয় : ৩২টি\n\nপ্রাথমিক বিদ্যালয় : ২৯৯৭টি\n\nসরকারি : ১৬৩৪টি\n\nবেসরকারি : ৮৪৭টি\n\nরেজিস্টার্ড : ৫১৯টি\n\nপরীক্ষণ : ২টি\n\nঅন্যান্য (কিন্ডারগার্টেন সহ) : ৮৪২টি\n\nশিক্ষক প্রশিক্ষণ কেন্দ্র : ২টি\n\nমেরিন একাডেমী : ১টি\n\nমিলিটারী একাডেমী : ১টি\n\nনেভাল একাডেমী : ১টি\n\n"
                  "মেরিন ফিসারীজ একাডেমী : ১টি\n\nপাবলিক লাইব্রেরী : ৮টি"
                  "\n\nপাহাড়, নদী, সমুদ্র, অরণ্য, উপত্যকা প্রভৃতি প্রাকৃতিক বৈশিষ্ট্যের জন্যে এ জেলা অন্যান্য জেলা থেকে স্বতন্ত্র। "
                  "বার্ষিক গড় তাপমাত্রা ৩৩.৮ ডিগ্রি সেলসিয়াস এবং সর্বনিম্ন ১৪.৫ ডিগ্রি সেলসিয়াস। বার্ষিক বৃষ্টিপাত ৩,১৯৪ মিলিমিটার।"
                  "\n\nচট্টগ্রাম জেলার প্রধান নদীর মধ্যে কর্ণফুলী নদী, হালদা নদী, সাঙ্গু নদী এবং মুহুরী নদী উল্লেখযোগ্য।"
                  "এছাড়াও তুলনামূলক ছোট ডলু নদী ও টংকাবতী নদী রয়েছে।",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
    ;
  }
}
