import 'package:flutter/material.dart';

class comillaJela extends StatelessWidget {
  const comillaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে কুমিল্লা জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/jela/chittagong divition jela/BD_Cumilla_District_locator_map.svg.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "কুমিল্লা জেলার মোট আয়তন ৩,০৮৭.৩৩ "
                  "বর্গ কিলোমিটার (৭,৬২,৮৯৫ একর)।\n\n"
                  "২০১১ সালের পরিসংখ্যান অনুযায়ী কুমিল্লা জেলার মোট "
                  "জনসংখ্যা ৫৬,০২,৬২৫ জন। এর মধ্যে পুরুষ ২৬,৭৮,২৩৫ "
                  "জন এবং মহিলা ২৯,২৪,৩৯০ জন। জনসংখ্যার ঘনত্ব প্রতি "
                  "বর্গ কিলোমিটারে প্রায় ১,৮১৬ জন এবং জনসংখ্যা বৃদ্ধির হার "
                  "প্রায় ১.৫৮%।\n\n"
                  "ধর্মবিশ্বাস অনুসারে কুমিল্লা জেলার মোট জনসংখ্যার ৯৪.৬২% মুসলিম,"
                  "৫.২৬% হিন্দু এবং ০.১২% বৌদ্ধ ও অন্যান্য ধর্মের অনুসারী।"
                  "\n\nবাংলাদেশের দক্ষিণ-পূর্বাংশে ২৩°০২´ থেকে ২৪°৪৭´ উত্তর অক্ষাংশ এবং ৯২°৩৯´ থেকে ৯১°২২´ পূর্ব দ্রাঘিমাংশ জুড়ে কুমিল্লা জেলার অবস্থান।\n\n"
                  " রাজধানী ঢাকা থেকে এ জেলার দূরত্ব প্রায় ১০৫ কিলোমিটার এবং চট্টগ্রাম বিভাগীয় সদর থেকে প্রায় ১৪৯ কিলোমিটার।"
                  " এ জেলার দক্ষিণে ফেনী জেলা ও নোয়াখালী জেলা; পশ্চিমে চাঁদপুর জেলা, মেঘনা নদী ও মুন্সিগঞ্জ জেলা, উত্তর-পশ্চিমে মেঘনা নদী ও নারায়ণগঞ্জ জেলা, "
                  "উত্তরে ব্রাহ্মণবাড়িয়া জেলা এবং পূর্বে ভারতের ও ত্রিপুরা প্রদেশ অবস্থিত।"
                  "\n\nউপজেলা: ১৭ টি\n\n"
                  "সংসদীয় আসন সংখ্যা:  ১১ টি\n\n"
                  "সিটি কর্পোরেশন:  ০১ টি\n\n"
                  "পৌরসভা:  ০৮ টি\n\nইউনিয়ন: ১৯৩ টি\n\nগ্রাম: ৩,৬৮৭ টি\n\n"
                  "জোত: ৫,৩৪,৩০৭ টি\n\nমৌজা: ২,৭০০ টি\n\nইউনিয়ন ভূমি অফিস:  ১৭২ টি"
                  "কুমিল্লা জেলার সাক্ষরতার হার ৬০.০২%। এ জেলায় রয়েছে:"
                  "\n\nবিশ্ববিদ্যালয় (সরকারি) - ১টি\n\nবিশ্ববিদ্যালয় (বেসরকারি) - ২টি\n\nবিশ্ববিদ্যালয় (আর্মি নিয়ন্ত্রিত) - ১টি\n\n"
                  "মেডিকেল কলেজ (সরকারি) - ১টি\n\n"
                  "মেডিকেল কলেজ (বেসরকারি) - ৩টি\n\nমেডিকেল কলেজ (আর্মি নিয়ন্ত্রিত) - ১টি\n\n"
                  "কামিল মাদ্রাসা - ১০টি\n\nক্যাডেট কলেজ - ১টি\n\n"
                  "সরকারি পলিটেকনিক - ১টি\n\n"
                  "কলেজ (সরকারি) - ১০টি\n\n"
                  "বাণিজ্যিক কলেজ (সরকারি) - ২টি\n\n"
                  "কলেজ (বেসরকারি) - ৩১টি\n\n"
                  "ফাজিল মাদ্রাসা - ৬৩টি\n\n"
                  "শিক্ষক প্রশিক্ষণ কলেজ - ১টি\n\n"
                  "পিটিআই - ১টি\n\nএইচএসটিটিআই - ১টি\n\nমেডিকেল এসিসটেন্ট প্রশিক্ষণ কেন্দ্র (সরকারি) - ১টি\n\n"
                  "আলিম মাদ্রাসা - ৭৫টি\n\nমাধ্যমিক বিদ্যালয় (সরকারি) - ৯টি\n\nমাধ্যমিক বিদ্যালয় (অন্যান্য) - ৫৮০টি\n\n"
                  "দাখিল মাদ্রাসা - ২৩৩টি\n\nনিম্ন মাধ্যমিক বিদ্যালয় - ৫৫টি\n\n"
                  "প্রাথমিক বিদ্যালয় - ১৩৩০টি\n\nইবতেদায়ী মাদ্রাসা - ৭১টি\n\n"
                  "পলিটেকনিক ইনস্টিটিউট ( বেসরকারি) - ০৩ টি",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
    ;
  }
}
