import 'package:flutter/material.dart';

class khagdacodiJela extends StatelessWidget {
  const khagdacodiJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে খাগড়াছড়ি জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/800px-Un-bangladesh.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "খাগড়াছড়ি জেলার মোট আয়তন ২৬৯৯.৫৬ বর্গ কিলোমিটার।\n\n"
                  "২০১১ সালের পরিসংখ্যান অনুযায়ী খাগড়াছড়ি জেলার মোট জনসংখ্যা ৫,২৫,৬৬৪ জন। এর মধ্যে পুরুষ ২,৭৭,৬১৪ জন এবং মহিলা ২,৪৮,৩৫০ জন। জনসংখ্যার ঘনত্ব প্রতি বর্গ কিলোমিটারে প্রায় ১৯৫ জন।\n\n"
                  "ধর্মবিশ্বাস অনুসারে এ জেলার মোট জনসংখ্যার ৪৩.৫২% মুসলিম, ১৬.৪৩% হিন্দু, ৩৯.২৮% বৌদ্ধ এবং ০.৭৭% খ্রিস্টান ও অন্যান্য ধর্মাবলম্বী। এ জেলায় বাঙালী জনসাধারণের পাশাপাশি চাকমা, মারমা, ত্রিপুরা, তঞ্চঙ্গ্যা প্রভৃতি ক্ষুদ্র-নৃগোষ্ঠীর বসবাস রয়েছে।\n\n"
                  "বাংলাদেশের দক্ষিণ-পূর্বাংশে ২২°৩৮´ থেকে ২৩°৪৪´"
                  " উত্তর অক্ষাংশ এবং ৯১°৪৪´ থেকে ৯২°১১´ পূর্ব দ্রাঘিমাংশ"
                  " জুড়ে খাগড়াছড়ি জেলার অবস্থান।\n\nরাজধানী ঢাকা থেকে এ জেলার দূরত্ব প্রায় ২৭০ কিলোমিটার এবং চট্টগ্রাম বিভাগীয় সদর থেকে প্রায় ১১১ কিলোমিটার। "
                  "এ জেলার পূর্বে রাঙ্গামাটি জেলা, দক্ষিণে রাঙ্গামাটি জেলা ও চট্টগ্রাম জেলা, পশ্চিমে চট্টগ্রাম জেলা ও ভারতের ত্রিপুরা প্রদেশ এবং উত্তরে ভারতের ত্রিপুরা প্রদেশ অবস্থিত।\n\n"
                  "১৮৬০ সালের ২০ জুন রাঙ্গামাটি, খাগড়াছড়ি ও বান্দরবান- এই তিন পার্বত্য অঞ্চলকে নিয়ে পার্বত্য চট্টগ্রাম জেলা সৃষ্টি হয়। জেলা সৃষ্টির পূর্বে এর নাম ছিল কার্পাস মহল।"
                  " পার্বত্য চট্টগ্রাম জেলা থেকে ১৯৮১ সালে বান্দরবান এবং ১৯৮৩ সালে খাগড়াছড়ি পৃথক জেলা সৃষ্টি করা হয়।\n\n"
                  "খাগড়াছড়ি জেলা ৯টি উপজেলা, ৯টি থানা, ৩টি পৌরসভা, ৩৮টি ইউনিয়ন, ১২১টি মৌজা, ১৩৮৮টি গ্রাম ও ১টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                  "খাগড়াছড়ি জেলার সাক্ষরতার হার ৪৪.০৭%।\n\n"
                  "খাগড়াছড়ি জেলার প্রধান ৩টি নদী মাইনী নদী, চেঙ্গি নদী এবং ফেনী নদী।\n\n"
                  "কৃষিজ সম্পদ:  প্রধান ফসল-ধান, গম, আদা, হলুদ ভুট্টা, সরিষা, তুলা, আখ, শাকসবজি ইত্যাদি।\n\n"
                  "ফলমূল-আম, কাঁঠাল, আনারস, কলা, পেঁপে, পেয়ারা, লেবু, তরমুজ ইত্যাদি।\n\n"
                  "খনিজ সম্পদ-গ্যাস (সিমুতাং গ্যাসফিল্ড, মানিকছড়ি)\n\n"
                  "বনজ সম্পদ-সেগুন, গামারী, কড়ই, গর্জন, চাপালিশ, জারুল, বাঁশ ইত্যাদি।\n\n"
                  "ভাষা ও সংস্কৃতি: সরকারি ভাষা হিসেবে বাংলা প্রচলিত। স্থানীয় বাঙ্গালিরা চট্টগ্রামের আঞ্চলিক ভাষায় কথা বলে।"
                  " এছাড়াও অন্যান্য ক্ষুদ্র জাতিগোষ্ঠীর ভাষা হিসেবে চাকমা, মারমা, ত্রিপুরা, তঞ্চঙ্গ্যা ইত্যাদি প্রচলিত।",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
    ;
  }
}
