import 'package:flutter/material.dart';

class ranghmatiJela extends StatelessWidget {
  const ranghmatiJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে রাঙ্গামাটি জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/800px-Un-bangladesh.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "রাঙ্গামাটি জেলার মোট আয়তন ৬১১৬.১৩ বর্গ কিলোমিটার। এটি আয়তনের দিক থেকে বাংলাদেশের বৃহত্তম জেলা\n\n"
                  "২০১১ সালের পরিসংখ্যান অনুযায়ী রাঙ্গামাটি জেলার মোট জনসংখ্যা ৬,২০,২১৪ জন। এর মধ্যে পুরুষ ৩,২৫,৮২৩ জন এবং মহিলা ২,৯৪,৩৯১ জন।"
                  " জনসংখ্যার ঘনত্ব প্রতি বর্গ কিলোমিটারে প্রায় ১০১ জন।\n\n"
                  "ধর্মবিশ্বাস অনুসারে এ জেলার মোট জনসংখ্যার ৩৬.৮২% মুসলিম, ৫.৩০% হিন্দু, ৫৬.০৬% বৌদ্ধ এবং ১.৮২% খ্রিষ্টান ও অন্যান্য ধর্মাবলম্বী। "
                  "এ জেলায় চাকমা, মারমা, তঞ্চঙ্গ্যা, বম, চাক, মুরং, ত্রিপুরা, খেয়াং, খুমি, লুসাই, ম্রো, পাংখোয়া, সাঁওতাল, মণিপুরী প্রভৃতি ক্ষুদ্র-নৃগোষ্ঠীর বসবাস রয়েছে।\n\n"
                  "বাংলাদেশের দক্ষিণ-পূর্বাংশে ২২°২৭´ থেকে ২৩°৪৪´ উত্তর অক্ষাংশ এবং ৯১°৫৬´ থেকে ৯২°৩৩´ পূর্ব দ্রাঘিমাংশ জুড়ে রাঙ্গামাটি জেলার অবস্থান।\n\n"
                  "রাজধানী ঢাকা থেকে এ জেলার দূরত্ব প্রায় ৩০৮ কিলোমিটার এবং চট্টগ্রাম বিভাগীয় সদর থেকে প্রায় ৭০ কিলোমিটার।"
                  " এ জেলার দক্ষিণে বান্দরবান জেলা, পশ্চিমে চট্টগ্রাম জেলা ও খাগড়াছড়ি জেলা, উত্তরে ভারতের ত্রিপুরা প্রদেশ এবং পূর্বে ভারতের মিজোরাম প্রদেশ"
                  " ও মায়ানমারের চিন প্রদেশ অবস্থিত।"
                  " এটি বাংলাদেশের একমাত্র জেলা, যার সাথে ভারত ও মায়ানমার দুটি দেশেরই আন্তর্জাতিক সীমানা রয়েছে।\n\n"
                  "১৮৬০ সালের ২০ জুন রাঙ্গামাটি, খাগড়াছড়ি ও বান্দরবান- এই তিন পার্বত্য অঞ্চলকে নিয়ে পার্বত্য চট্টগ্রাম জেলা সৃষ্টি হয়।"
                  " জেলা সৃষ্টির পূর্বে এর নাম ছিল কার্পাস মহল। পার্বত্য চট্টগ্রাম জেলা থেকে ১৯৮১ সালে বান্দরবান এবং ১৯৮৩ সালে খাগড়াছড়ি পৃথক"
                  " জেলা সৃষ্টি করা হলে পার্বত্য চট্টগ্রাম জেলার মূল অংশ রাঙ্গামাটি পার্বত্য জেলা হিসাবে আত্মপ্রকাশ করে।"
                  " প্রথাগত রাজস্ব আদায় ব্যবস্থায় রাঙ্গামাটি পার্বত্য জেলায় রয়েছে চাকমা সার্কেল চীফ। চাকমা রাজা হলেন নিয়মতান্ত্রিক চাকমা সার্কেল চীফ।\n\n"
                  "রাঙ্গামাটি জেলা ১০টি উপজেলা, ১২টি থানা, ২টি পৌরসভা, ৫০টি ইউনিয়ন, ১৫৯টি মৌজা, ১৩৪৭টি গ্রাম ও ১টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                  "রাঙ্গামাটি জেলার সাক্ষরতার হার ৪৩.৬০%।\n\n"
                  "রাঙ্গামাটি জেলার প্রধান নদী কর্ণফুলী। এ নদী ভারতের লুসাই পাহাড় থেকে উৎপন্ন হয়ে রাঙ্গামাটির উত্তর-পূর্ব সীমান্ত দিয়ে "
                  "ঠেগা নদীর মোহনা হয়ে এ অঞ্চলে প্রবেশ করেছে। কর্ণফুলী নদীর উপনদীগুলো হল কাচালং, মাইনী, চেঙ্গি, ঠেগা, সলক, রাইংখ্যং।"
                  " এছাড়া এ জেলায় রয়েছে বাংলাদেশের বৃহত্তম কাপ্তাই হ্রদ।"
                  " এ উপনদীগুলো বর্ষাকালে যথেষ্ট খরস্রোতা থাকলেও শুষ্ক মৌসুমে নাব্যতাসহ পানির পরিমাণ প্রায় থাকেনা।\n\n"
                  "ভাষা ও সংস্কৃতি: সরকারি ভাষা হিসেবে বাংলা প্রচলিত। স্থানীয় বাঙ্গালিরা চট্টগ্রামের আঞ্চলিক ভাষায় কথা বলে।"
                  " এছাড়াও অন্যান্য ক্ষুদ্র জাতিগোষ্ঠীর ভাষা হিসেবে চাকমা, মারমা, ম্রো, ত্রিপুরা, বম, লুসাই, তঞ্চঙ্গ্যা, চাক, খেয়াং, খুমী, পাংখুয়া ইত্যাদি প্রচলিত।",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
  }
}
