//capainababgong Jela
import 'package:flutter/material.dart';

class capainobabgongJela extends StatelessWidget {
  const capainobabgongJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে চাঁপাইনবাবগঞ্জ জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা:  মোট ১,৭৪৪ বর্গ কিলোমিটার আয়তনের চাঁপাইনবাবগঞ্জ জেলার অবস্থান বাংলাদেশের মানচিত্রে সর্ব পশ্চিমে। এর পূর্বে রাজশাহী ও নওগাঁ জেলা, উত্তরে ভারতের পশ্চিমবঙ্গ রাজ্যের মালদহ জেলা, পশ্চিমে পদ্মা নদী ও মালদহ জেলা দক্ষিণে পদ্মা নদী ও ভারতের পশ্চিমবঙ্গ রাজ্যের মুর্শিদাবাদ জেলা। এটি ভৌগোলিকভাবে ২৪°২২′ হতে ২৪°৫৭′ উত্তর অক্ষাংশে এবং ৮৭°৫৫′ হতে ৮৮°২৩′ পূর্ব দ্রাঘিমার মধ্যে অবস্থিত।\n\n"
                "প্রশাসনিক এলাকাসমূহ: চাঁপাইনবাবগঞ্জ জেলা ৫টি উপজেলায় বিভক্ত।\n\n"
                "জনসংখ্যা: চাঁপাই নবাবগঞ্জ জেলার জনসংখ্যা ১৬৪৭৫২১ জন। পুরুষ জন ও নারী জন। মোট জনসংখ্যার ৯৫.৩৬% ইসলাম ধর্মালম্বী, ৪.০৪% হিন্দু ধর্মালম্বী, ০.৩৫ % খ্রিস্টান ধর্মালম্বী এবং ০.২৫% জনগণ অন্যান্য ধর্মের অনুসারী।\n\n"
                "অর্থনীতি: চাঁপাইনবাবগঞ্জ জেলার অর্থনীতি মূলত কৃষি নির্ভর। এই জেলার বেশিরভাগ মানুষ গ্রামে বাস করে। তারা মূলত কৃষিকাজ করে তাদের দৈনন্দিন প্রয়োজন মিটিয়ে থাকে। তার মধ্যে কিছু মৌসুমি ব্যবসায়ী আছে যারা মৌসুমের সময় অর্থ উপার্জন করে। তার মধ্যে আম ব্যবসায়ী প্রধান। চাঁপাই নবাবগঞ্জের শিবগঞ্জ উপজেলা এই মৌসুমি আম ব্যবসায়ীদের জন্য ব্যবসার উপযুক্ত স্থান। আমের মৌসুমে এই শিবগঞ্জ উপজেলা হয়ে উঠে লোকে লোকারণ্য। আমের মৌসুমে এখানে চাঁপাই নবাবগঞ্জের সবচেয়ে বড় আমের বাজার বসে যা বাংলাদেশের আর কোথাও দেখা যায় না। "
                "আম ব্যবসায়ী ছাড়াও এখানে টমেটো ব্যবসায়ী,কাঁসা-পিতল ব্যবসায়ী, পান ব্যবসায়ী দেখতে পাওয়া যায়। তবে আমের ব্যবসায়ীই প্রধান। উল্লেখ্য যে সদর উপজেলার যাদুপুর গ্রামের পান এই অঞ্চলের সেরা পান। অধিকাংশ পান ব্যবসায়ীই এই অঞ্চলের।\n\n"
                "শিক্ষা: শিক্ষা ক্ষেত্রে চাঁপাইনবাবগঞ্জ বেশ উন্নত। এখানে রয়েছেঃ ৩৭০টি সরকারী প্রাথমিক বিদ্যালয়; ২৮২টি বেসরকারি প্রাথমিক বিদ্যালয়; ৪টি সরকারী উচ্চ বিদ্যালয়; ২০৪টি বেসরকারি উচ্চ বিদ্যালয়; ৪টি সরকারি কলেজ; ৪৮টি বেসরকারি কলেজ; ১২৮টি মাদ্রাসা; ১টি সরকারী কারিগরি প্রশিক্ষণ কেন্দ্র; ১টি বেসরকারী কারীগরি প্রশিক্ষণ কেন্দ্র"
                "১টি বিশ্ববিদ্যালয় এবং, ১টি যুব উন্নয়ন কেন্দ্র । ২টি PTI আছে।\n\n"
                "সংস্কৃতি: ভাষা-চাঁপাইনবাবগঞ্জের মানুষেরা বাংলাতে কথা বললেও তাদের উচ্চারণশৈলী প্রমিত বাংলা থেকে একটু আলাদা। তাদের কিছু শব্দের উচ্চারণ এখানে দেয়া হলঃ অ্যাইগন্যা = উঠান, আইলস্যা = অলস, কাড়ি, আইড় = ধানের খড়, ইন্দারা/কুমহা = কুয়া, উফাদিক = উপাধিক/অকর্মন্য, উসকাঠী = রান্নার কাজে ব্যবহৃত একটি দন্ড যা দ্বারা জ্বালানী চুলার মধ্যে পাঠানো হয় (পাট গাছের কাণ্ড), কান্টা = বাড়ির পিছনের জায়গা, গঁঢ়্যা = ছোট ডোবা, ভূঁইশ = মহিষ, বল/আঁইড়্যা = ষাঁড়, বকরী = ছাগল, পাঘা = দড়ি, লাহি = নাভী, ঘুটা/নোন্দা = গরুর গোবর দিয়ে তৈরি এক প্রকার জ্বালানি।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
