//Joypurhat Jela
import 'package:flutter/material.dart';

class joypurhutJela extends StatelessWidget {
  const joypurhutJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে জয়পুরহাট জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান ও আয়তন: জয়পুরহাট জেলার উত্তরে রয়েছে গাইবান্ধা জেলা, দিনাজপুর জেলা এবং ভারত সীমান্ত, দক্ষিণে রয়েছে বগুড়া জেলা ও নওগাঁ জেলা, পূর্বে বগুড়া জেলা ও গাইবান্ধা জেলা, এবং পশ্চিমে নওগাঁ জেলা ও ভারত সীমান্ত। জেলাটির মোট এলাকার পরিমাণ ৯৬৫.৮৮ বর্গ কিলোমিটার।\n\n"
                "ইতিহাস:  স্বাধীন বাংলায় ব্রিটিশ শাসনামলে ১৮২১ সালে বৃহত্তর রাজশাহী জেলার চারটি, রংপুর জেলার ২টি ও দিনাজপুর জেলার ৩টি থানা নিয়ে যে বগুড়া জেলা গঠিত হয়েছিল তারই অংশ নিয়ে ১৯৭১ সালে প্রথমে জয়পুরহাট মহকুমা এবং পরবর্তীকালে ১৯৮৪ সালে জয়পুরহাট জেলা গঠিত হয়।\n\n"
                "প্রশাসনিক এলাকাসমূহ:  জয়পুরহাট জেলা ৫টি উপজেলায় বিভক্ত। এছাড়া এখানে ৫টি পৌরসভা, ৩২টি ইউনিয়ন, ৯৮৮টি গ্রাম, ও ৭৬২টি মৌজা রয়েছে।\n\n"
                "শিক্ষা ব্যবস্থা:  জয়পুরহাট জেলার শিক্ষার হার ৭৫.৭%। জয়পুরহাট বাংলাদেশের ৭ টি নিরক্ষরমুক্ত জেলার মধ্যে অন্যতম। জেলায় সরকারী কলেজ- ৩টি, বেসরকারী কলেজ- ৩৯টি, মহিলা ক্যাডেট কলেজ- ১টি, সরকারী মাধ্যমিক বিদ্যালয়- ৪টি, বেসরকারী মাধ্যমিক বিদ্যালয়- ১৬১টি, সরকারী প্রাথমিক বিদ্যালয়- ২৬৩টি, বেসরকারী প্রাথমিক বিদ্যালয়- ৮৭টি, সরকারী কারিগরি শিক্ষা প্রতিষ্ঠান- ১টি, বেসরকারী কারিগরি শিক্ষা প্রতিষ্ঠান- ১৩টি, কামিল মাদ্রাসা- ৪টি, ফাজিল মাদ্রাসা- ১০টি, আলিম মাদ্রাসা- ১৭টি, দাখিল মাদ্রাসা- ৮০টি, পিটিআই- ১টি, মডেল মাদ্রাসা- ১ টি রয়েছে, টিটিসি ১ টি, ১টি শিশু কল্যাণ বিদ্যালয় রয়েছে। এগুলোর মধ্যে জয়পুরহাট গার্লস ক্যাডেট কলেজ, জয়পুরহাট সরকারি কলেজ, ক্ষেতলাল এস. এ. ডিগ্রী কলেজ, কালাই ডিগ্রী কলেজ, নান্দাইল দিঘী কলেজ, রামদেও বাজলা সরকারি উচ্চ বিদ্যালয়, জয়পুরহাট সরকারি বালিকা উচ্চ বিদ্যালয়, জয়পুরহাট সদর থানা উচ্চ বিদ্যালয়, কালাই সরকারি এম. ইউ. উচ্চ বিদ্যালয়, ক্ষেতলাল সরকারি পাইলট উচ্চ বিদ্যালয় জেলার মধ্যে অন্যতম ।\n\n"
                "অর্থনীতি:  জয়পুরহাট জেলার অর্থনীতি সম্পূর্ণরূপে কৃষি নির্ভর। জয়পুরহাট উত্তরাঞ্চলের শস্যভান্ডার খ্যাত। এখানকার মৃৎ শিল্পের কাজ এখন বিলুপ্তির পথে।[২] জয়পুরহাট চিনিকল বাংংলাদেশের বৃহৎ চিনিকল। জামালগঞ্জ কয়লা খনি দেশের বৃৃহত্তম কয়লা খনি।\n\n"
                "ধর্ম: অধিকাংশ মানুষ ইসলাম ধর্মাবলম্বী। সংখ্যা গরিষ্ঠ মুসলমান হলেও এখানে হিন্দু, বৌদ্ধ ধর্মাবলম্বী সহ কিছু আদিবাসী জনবসতি রয়েছে । এদের ভিতরে সাঁওতাল,ওরাও, মুনডা, মাহালি , বুনা, কোচ,হো, রাজবংশী, পাহান ইত্যাদি জনগোষ্টীর সংখ্যা প্রায় ২.২৫% । মোট ক্ষুদ্র জনগোষ্ঠীর সংখ্যা ৪৮০০০ জন(২০০১)\n\n"
                "প্রধান শস্য:  ধান, আলু, ইক্ষু, লতিরাজ এবং কলা,মাল্টা।\n\n"
                "নদী: ছোট যমুনা নদী, তুলসীগঙ্গা নদী, হারাবতী নদী, চিরি নদী\n\n"
                "সড়ক যোগাযোগ:  পাকা রাস্তা- ৩৪২.৫৯ কি. মি., আধা পাকা রাস্তা- ৬১.৯৫ কি. মি., কাঁচা রাস্তা- ১,৫৯৬ কি.মি.।\n\n"
                "রেল যোগাযোগ: মোট রেলপথ- ৩৮.৮৬ কি. মি., মোট রেল স্টেশনের সংখ্যা- ০৭ টি (জয়পুরহাট, পাঁচবিবি, জামালগঞ্জ, আক্কেলপুর, জাফরপুর, তিলকপুর ও বাগজানা)।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
