//notor Jela
import 'package:flutter/material.dart';

class notorJela extends StatelessWidget {
  const notorJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে নাটোর জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "নাটোর জেলা বাংলাদেশের রাজশাহী বিভাগে অবস্থিত একটি জেলা। জেলার উত্তরে নওগাঁ জেলা ও বগুড়া জেলা, দক্ষিণে পাবনা জেলা ও কুষ্টিয়া জেলা, পূর্বে পাবনা জেলা ও সিরাজগঞ্জ জেলা এবং পশ্চিমে রাজশাহী জেলা অবস্থিত। জেলাটি ১৯০৫.০৫ বর্গ কিলোমিটার আয়তন।এই জেলাটি মূলত বাংলাদেশের উত্তর-পশ্চিমের আটটি জেলার মধ্য একটি জেলা।আয়তনের দিক দিয়ে নাটোর বাংলাদেশের ৩৫ তম জেলা। নাটোর জেলা দূর্যোগপ্রবণ এলাকা না হলেও সিংড়া ও লালপুর উপজেলায় আত্রাই এবং পদ্মা নদীতে মাঝে মাঝে বন্যা দেখা দেয়। সদর ও নাটোরের সকল উপজেলার আবহাওয়া একই হলেও লালপুরে গড় তাপমাত্রা তুলনামূলক বেশি। পুরোনো নিদর্শনের মধ্য এই জেলার এক সমৃদ্ধ ঐতিহ্য রয়েছে।\n\n"
                "জনসংখ্যা: জনসংখ্যা	১৭০৬৬৭৩ জন, পুরুষ	৮৫৪১৮৩ জন, মহিলা	৮৫২৪৯০ জন, মুসলিম	১৫৯০৯১৯ জন, হিন্দু	১০৩৭৪৭ জন, খ্রিস্টান	৮০৫৮ জন, বৌদ্ধ	৭ জন\n\n"
                "ভৌগোলিক সীমানা: এই জেলার উত্তরে নওগাঁ জেলা ও বগুড়া জেলা, দক্ষিণে পাবনা জেলা ও কুষ্টিয়া জেলা, পূর্বে পাবনা জেলা ও সিরাজগঞ্জ জেলা এবং পশ্চিমে রাজশাহী জেলা অবস্থিত। আয়তন ১৯০৫.০৫ বর্গ কিলোমিটার। নাটোরসহ এর পার্শ্ববর্তী বগুড়া ও সিরাজগঞ্জে অবস্থিত চলন বিল হচ্ছে বাংলাদেশের সবচেয়ে বড় বিল। বাংলাদেশের মধ্যে সবচেয়ে কমবৃষ্টিপাত হয় নাটোরের লালপুর উপজেলায়।\n\n"
                "প্রধান নদী: পদ্মা নদী, আত্রাই, বড়াল নদী, নারদ নদ, তুলসীগঙ্গা, নাগর নদ সহ এই জেলায় ৩২ টি নদ-নদী এবং চলনবিল ও হালতির বিল সহ অসংখ্য খাল-বিল রয়েছে।\n\n"
                "প্রশাসনিক এলাকাসমূহ: নাটোর জেলা ৭ টি উপজেলা,৭টি থানা এবং ৮টি পৌরসভা রয়েছে।নাটোরে সংসদীয় আসন ৪টি।\n\n"
                "শিক্ষা ও চিকিৎসা: শিক্ষাঃ নাটোর জেলায় সাক্ষরতার হার ৭০%।এই জেলায় ১ টি সরকারি কৃষি বিশ্ববিদ্যালয়, ১টি আর্মি প্রকৌশল ও প্রযুক্তি বিশ্ববিদ্যালয়, ১টি বেসরকারি বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়, ১টি সরকারি টেক্সটাইল ইনিস্টিটিউট,৮টি সরকারি কলেজ সহ অনেক শিক্ষা প্রতিষ্ঠান রয়েছে। চিকিৎসাঃ জেলা হাসপাতাল ১টি,উপজেলা স্বাস্থ্য কমপ্লেক্স ৬টি,মাতৃসদন ২টি, কমিউনিটি ক্লিনিক ১২৪টি, বেসরকারি হাসপাতাল ২৮টি,ডায়াগনস্টিক সেন্টার ৫২টি,সামরিক হাসপাতাল ১টি, মিশন হাসপাতাল ২টি। এই জেলায় কোন মেডিকেল কলেজ ও হাসপাতাল নেই ফলে বিভিন্ন সময় এ জেলার মানুষকে চিকিৎসা সেবার জন্য পাশ্ববর্তী জেলার নির্ভর করতে হয় যা অনেক কষ্টকর। এই জেলায় একটি মেডিকেল কলেজ ও হাসপাতাল প্রতিষ্ঠা কেবলমাত্র সময়ের দাবি।\n\n"
                "সাংস্কৃতিক প্রতিষ্ঠান: জেলা শিল্পকলা একাডেমী, মনোবীণা সংঘ, সাকাম সাংস্কৃতিক প্রতিষ্ঠান, নাটোর সংগীত বিদ্যালয়, উষা খেলাঘর আসর, ভোলামন বাউল সংগঠন, ইছলাবাড়ী বাউল সংগঠন, নৃত্যাঙ্গন, তরুণ নাট্য সম্প্রদায়, ডিং ডং ড্যান্স ক্লাব, দিব্য সাংস্কৃতিক প্রতিষ্ঠান, সারেগামা, সুরের ছোঁয়া, ঝংকার নৃত্য গোষ্ঠি, বঙ্গবন্ধু সাংস্কৃতিক পরিষদ, ইঙ্গিত থিয়েটার ইত্যাদি।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
