//Pabna Jela
import 'package:flutter/material.dart';

class pabnaJela extends StatelessWidget {
  const pabnaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে পাবনা জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "পাবনা জেলা বাংলাদেশের মধ্যভাগের একটি গুরুত্বপূর্ণ প্রশাসনিক অঞ্চল। উপজেলার সংখ্যানুসারে পাবনা বাংলাদেশের একটি “এ” শ্রেণিভুক্ত জেলা।\n\n"
                "ভৌগোলিক সীমানা: বাংলাদেশে অবস্থিত পাবনা জেলা রাজশাহী বিভাগের দক্ষিণ-পূর্ব কোণ সৃষ্টি করেছে। এটি ২৩°৪৮′ হতে ২৪°৪৭′ উত্তর অক্ষাংশ এবং ৮৯°০২′ হতে ৮৯°৫০′ পূর্ব দ্রাঘিমাংশে অবস্থিত। এর উত্তর দিক ঘিরে আছে সিরাজগঞ্জ জেলা আর দক্ষিণে পদ্মা নদী একে রাজবাড়ী ও কুষ্টিয়া জেলা হতে পৃথক করেছে। এর পূর্ব প্রান্তদিয়ে যমুনা নদী বয়ে গেছে এবং পশ্চিমে নাটোর জেলা। পাবনার আমিনপুর থানার দক্ষিণ-পূর্ব প্রান্তে এসে পদ্মা ও যমুনা নদী পরস্পর মিলিত হয়েছে।\n\n"
                "সাধারণ তথ্যাবলী: উপজেলার সংখ্যা ৯টি, থানার সংখ্যা ১১টি, পৌরসভার সংখ্যা ১০টি (কাশীনাথপুর পৌরসভা), গ্রামের সংখ্যা ১,৫৪৯টি, ইউনিয়নের সংখ্যা ৭৪টি\n\n"
                "জনসংখ্যা: মোট জনসংখ্যা ২৬,২৪,৬৮৪ জন । পুরুষ ১৩,১৩,৭৭১, মহিলা ১৩,১০,৯১৩, মুসলিম ৯৫.১২%, হিন্দু ৪.৫০%, খ্রীষ্টান ০.২২%, অন্যান্য ০.১৬%।\n\n"
                "যোগাযোগ ব্যবস্থা: এই জেলার সড়ক, স্থল, জলপথ ও বিমানপথে যোগাযোগ ব্যবস্থা রয়েছে। "
                "পাবনার বাসগুলো দেশের অনেক গুরুত্বপূর্ণ রুটেই চলাচল করে। পাবনা কেন্দ্রীয় বাস টার্মিনালের কাছাকাছি পাবনা রেলওয়ে স্টেশন অবস্থিত। কাছাকাছি রেল স্টেশনগুলি টেবুনিয়া, দাশুড়িয়া, চাটমোহর উপজেলা ও ঈশ্বরদী উপজেলায় অবস্থিত। ঈশ্বরদী উপজেলা উত্তর বাংলার এবং বাংলাদেশের গুরুত্বপূর্ণ একটি রেলওয়ে শাখা। এই জেলায় দশটি রেলওয়ে স্টেশন আছে: ঈশ্বরদী জংশন, পাকশি, মুলাডুলী, গফুরাবাদ, চাটমোহর, ভাঙ্গুড়া, বড়াল সেতু, শারত নগর, দিলপাশার এবং গুয়াকারা। পাবনা টু ঢালারচর নতুন রেলপথ তৈরী হয়েছে। ২৬ জানুয়ারী ২০২০ তারিখ, রোববার, প্রধানমন্ত্রী শেখ হাসিনা গণভবন থেকে ভিডিও কনফারেন্সের মাধ্যমে হুইসেল বাজিয়ে ‘ঢালারচর এক্সপ্রেস’ ট্রেন উদ্বোধন করেন। বর্তমানে ‘ঢালারচর এক্সপ্রেস’ আন্তঃনগর ট্রেনটি ঢালারচর-রাজশাহী-ঢালারচর রুটে নিয়মিত চলাচল করছে। এছাড়াও পানিপথে আরিচা - কাজিরহাট হয়ে দিনে বেশ কয়েকটি লঞ্চ ও স্পীডবোর্ড চলাচল করে। ২৭ ফেব্রুয়ারি ২০২১ তারিখে মানিকগঞ্জের আরিচা ও পাবনার কাজিরহাট নৌপথে দীর্ঘ ২০ বছর পর আবার ফেরি চলাচল শুরু হয়েছে। ফেরি সার্ভিসের উদ্বোধন করেন নৌপরিবহন প্রতিমন্ত্রী খালিদ মাহমুদ চৌধুরী। যার ফলে রাজধানী থেকে খুব সহজে পাবনাতে যাতায়াত করা যায়।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
