//sheletJela
import 'package:flutter/material.dart';

class sheletJela extends StatelessWidget {
  const sheletJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে সিলেট জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা:  সিলেট জেলার ভৌগোলিক অবস্থান ২৪­° ৪০’ থেকে ২৫° ১১’’ উত্তর অক্ষাংশ এবং ৯১° ৩’’ থেকে ৯২° ৩’’ পূর্ব দ্রাঘিমাংশ। সিলেট জেলার উত্তরে ভারতের মেঘালয় ও খাশিয়া-জৈন্তিয়া পাহাড়, পূ্র্বে ভারতের আসাম, দক্ষিণে মৌলভীবাজার জেলা ও পশ্চিমে সুনামগঞ্জ ও হবিগঞ্জ জেলা অবস্থিত। এই জেলার আয়তন ৩,৪৯০.৪০ বর্গ কিমি। বাৎসরিক সর্বচ্চো তাপমাত্রা ৩৩.২° সেলসিয়াস ও সর্বনিম্ন তাপমাত্রা ১৩.৬° সেলসিয়াস। বাৎসরিক বৃষ্টিপাত ৩৩৩৪ মিলিমিটার। প্রধান নদী সুরমা ও কুশিয়ারা। হাওড় সংখ্যা ৮২ টি। সংরক্ষিত বনাঞ্চল ২৩৬.৪২ বর্গ কিলোমিটার। ভারতের খাশিয়া-জয়ান্তা পাহারের কিছু অংশ এই জেলায় পরেছে। এছাড়াও কিছু ছোট পাহাড় ও টিলা রয়েছে এখানে। এদের মধ্যে উল্লেখযোগ্য হচ্ছে জৈন্তাপুর (৫৪ মাইল), সারি টিলা (৯২ মাইল), লালখান টিলা (১৩৫ মাইল), ঢাকা দক্ষিণ টিলাসমুহ (৭৭.৭ মাইল)।\n\n"
                "প্রশাসনিক এলাকাসমূহ:  ১৭৮২ সালের ৩ জানুয়ারি সিলেট জেলা প্রতিষ্ঠিত হয়। ১৮৭৪ সাল পর্যন্ত সিলেট জেলা ছিল চট্টগ্রাম বিভাগের অর্ন্তভূক্ত। ঐ বছরেরই ১২ সেপ্টেম্বর নবসৃষ্ট আসাম প্রদেশের সাথে সিলেটকে সংযুক্ত করা হয়। ১৯৪৭ এর আগ পর্যন্ত (১৯০৫-১৯১১ পর্যন্ত বঙ্গভঙ্গ সময়ের কালটুকু বাদ দিয়ে) সিলেট আসামের অংশ ছিল। ১৯৪৭ সালে ভারত বিভিক্তির সময় গণভোটের মাধ্যমে সিলেট জেলা তদানীন্তন পূর্ব পাকিস্তান এর সাথে সম্পৃক্ত হয়। তখন প্রশাসনিকভাবে সিলেট ছিল চট্টগ্রাম বিভাগের অর্ন্তভূক্ত। ১৯৮৩-৮৪ সালে প্রশাসনিক পুনর্গঠন এর সময় বৃহত্তর সিলেট জেলাকে ০৪(চার)টি নতুন জেলায় বিভক্ত করা হয়।\n\n"
                "সিলেট জেলা ২৭ ওয়ার্ড বিশিষ্ট ১টি সিটি কর্পোরেশন, ১৩টি উপজেলা, ১৭টি থানা, ৫টি পৌরসভা, ১০৬টি ইউনিয়ন, ১৬৯৩টি মৌজা, ৩৪৯৭টি গ্রাম ও ৬টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                "সিলেট নামের উৎপত্তি:  প্রাচীন গ্রন্থাদিতে এ অঞ্চলের (সিলেট বিভাগ) বিভিন্ন নামের উল্লেখ আছে।\n\n"
                "হিন্দুশাস্ত্র অনুসারে শিবের স্ত্রী সতি দেবীর কাটা হস্ত (হাত) এই অঞ্চলে পড়েছিল, যার ফলে 'শ্রী হস্ত' হতে শ্রীহট্ট নামের উৎপত্তি বলে হিন্দু সম্প্রদায় বিশ্বাস করেন।\n\n"
                "খ্রিস্টপূর্ব চতুর্থ শতকের ঐতিহাসিক এরিয়ান লিখিত বিবরণীতে এই অঞ্চলের নাম সিরিওট বলে উল্লেখ আছে। এছাড়া, খ্রিস্টীয় দ্বিতীয় শতকে এলিয়েনের (Ailien) বিবরণে সিরটে, এবং পেরিপ্লাস অব দ্যা এরিথ্রিয়ান সী নামক গ্রন্থে এ অঞ্চলের নাম সিরটে এবং সিসটে এই দুইভাবে লিখিত হয়েছে।\n\n"
                "চীনা মানুষ—অতঃপর ৬৪০ খ্রিষ্টাব্দে যখন চীনা পরিব্রাজক হিউয়েন সাং এই অঞ্চল ভ্রমণ করেন। তিনি তার ভ্রমণ কাহিনীতে এ অঞ্চলের নাম শিলিচতল উল্লেখ করেছেন। তুর্কি সেনাপতি\n\n"
                "ইখতিয়ার উদ্দীন মুহম্মদ বখতিয়ার খলজী দ্বারা বঙ্গবিজয়ের মধ্য দিয়ে এদেশে মুসলিম সমাজব্যবস্থার সূত্রপাত ঘটলে মুসলিম শাসকগণ তাদের দলিলপত্রে শ্রীহট্ট নামের পরিবর্তে সিলাহেট, সিলহেট ইত্যাদি নাম লিখেছেন বলে ইতিহাসে প্রমাণ মিলে। আর এভাবেই শ্রীহট্ট থেকে রূপান্তর হতে হতে একসময় সিলেট নামটি প্রসিদ্ধ হয়ে উঠেছে বলে ঐতিহাসিকরা ধারণা করেন।"
                "\n\nযখন সিলেটে, হযরত শাহ্ জালাল আসেন তখন শত্রু পক্ষ তাকে এবং তার অনুসারী ৩৬০ আউলিয়াদেরকে শিলা বা পাথর দ্বারা আটকেে দিয়েছিল। তখন মহান আল্লাহ্ তায়ালার অশেষ মেহেরবানীতে তিনি বলেন শিলাহাট(অর্থ্যাৎ- পাথর সরে যা)। তখন, তথখনাৎ পাথর গুলো সরে যায়। এই থেকে নাম রাখা হয় শিলাহাট। তারপর নাম সহজ করতে করতে হয় শিলহাট, সিলাহেট, সিলেট (বর্তমানে)।\n\n"
                "শিক্ষা প্রতিষ্ঠান: শিক্ষার হার ৫১.২%।\n\n"
                "ভাষা:  ভাষা নিয়ত পরিবর্তনশীল এবং ভাষার পরিবর্তন হয় এলাকা ভিত্তিক এবং দুরত্বের উপর নির্ভর করে। সিলেটিদের কথ্য ভাষা প্রকৃত বাংলা ভাষা হতে বেশ আলাদা। সিলেট ঐতিহাসিক ভাবেই আলাদা ভাষা এবং আলাদা সংস্কৃতি ধারণ ও লালন করে আসছে। এখানে বিভিন্ন সম্প্রদায়ের বসবাস যার ফলে ভাষার ক্ষেত্রেও রয়েছে বৈচিত্র্য। পূর্বে সিলেট আসাম রাজ্যের অন্তর্গত থাকার ফলে সিলেটের ভাষা ও সংস্কৃতিতে আসামের প্রভাব লক্ষ্য করা যায়। এছাড়াও সিলেটের রয়েছে এক বৈচিত্র্যময় নিজস্ব ভাষা যা নাগরী লিপি হিসাবে পরিচিত।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
