//sonamgongJela
import 'package:flutter/material.dart';

class sonamgongJela extends StatelessWidget {
  const sonamgongJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে সুনামগঞ্জ জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "নামকরণ: ‘সুনামদি’ নামক জনৈক মোগল সিপাহীর নামানুসারে সুনামগঞ্জের নামকরণ করা হয়েছিল বলে জানা যায়। ‘সুনামদি’ (সুনাম উদ্দিনের আঞ্চলিক রূপ) নামক উক্ত মোগল সৈন্যের কোন এক যুদ্ধে বীরোচিত কৃতিত্বের জন্য সম্রাট কর্তৃক সুনামদিকে এখানে কিছু ভূমি পুরস্কার হিসাবে দান করা হয়। তার দানস্বরূপ প্রাপ্ত ভূমিতে তারই নামে সুনামগঞ্জ বাজারটি স্থাপিত হয়েছিল। এভাবে সুনামগঞ্জ নামের ও স্থানের উৎপত্তি হয়েছিল বলে মনে করা হয়ে থাকে\n\n"
                "ভৌগোলিক সীমানা:  উত্তরে খাসিয়া ও জৈন্তিয়া পাহাড়, পূর্বে সিলেট জেলা, দক্ষিণে হবিগঞ্জ জেলা, পশ্চিমে নেত্রকোণা জেলা ও কিশোরগঞ্জ জেলা।\n\n"
                "প্রশাসনিক এলাকাসমূহ: সুনামগঞ্জ জেলা ১২টি উপজেলা, ১২টি থানা, ৪টি পৌরসভা, ৮৮টি ইউনিয়ন, ১৫৩৫টি মৌজা, ২৮৮৭টি গ্রাম ও ৫টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                "শিক্ষাব্যবস্থা:  সুনামগঞ্জ জেলার সাক্ষরতার হার ৪৯.৭৫%। সুনামগঞ্জ জেলায় শিক্ষার আলো ছড়িয়ে দেওয়ার জন্য জেলায় অনেক শিক্ষা প্রতিষ্ঠান রয়েছে।\n\n"
                "সড়ক যোগাযোগ: সুনামগঞ্জ-সিলেট মহাসড়কটিই জেলার সড়ক যোগাযোগের প্রধানতম পথ। এ পথেই রাজধানীসহ দেশের অন্যান্য জেলার সাথে সরাসরি যোগাযোগ রক্ষা হয়। সুনামগঞ্জ-জামালগঞ্জ-ধর্মপাশা হয়ে নেত্রকোণা জেলার সাথে সরাসরি সড়ক যোগাযোগ স্থাপনের নিমিত্তে সড়ক ও জনপথ বিভাগের প্রকল্প নির্মাণাধীন। এছাড়া সুনামগঞ্জ-ছাতক আঞ্চলিক সড়ক, সুনামগঞ্জ-দিরাই আঞ্চলিক সড়ক, সুনামগঞ্জ-বিশ্বম্ভরপুর-তাহিরপুর আঞ্চলিক সড়ক, সুনামগঞ্জ-জগন্নাথপুর আঞ্চলিক সড়কের মাধ্যমে জেলার সাথে যোগাযোগ রক্ষা করে উপজেলাগুলো।\n\n"
                "রেল যোগাযোগ:  জেলার ছাতক উপজেলার সাথে সিলেটের রেল যোগাযোগ রয়েছে। রাজধানী ঢাকার সাথে সরাসরি রেল যোগাযোগ স্থাপনে সিলেট-ছাতক হয়ে সুনামগঞ্জ সদর পর্যন্ত রেলপথ পরিকল্পনাধীন।\n\n"
                "নৌ যোগাযোগ: প্রাচীন কাল থেকে সুনামগঞ্জের সাথে ঢাকা শহরের নৌ যোগাযোগ ছিল। সুরমা নদী হয়ে এ যোগাযোগ এখনো অব্যাহত আছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
