import 'package:flutter/material.dart';
class bagerhutJela extends StatelessWidget {
  const bagerhutJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে বাগেরহাট জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",height: 400,width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "বাগেরহাট জেলার উত্তরে গোপালগঞ্জ ও নড়াইল জেলা, পশ্চিমে খুলনা জেলা, দক্ষিণে বঙ্গোপসাগর এবং পূর্বে পিরোজপুর ও বরগুনা জেলা। ২২°৩২’ থেকে ২২°৫৬’ "
                    "উত্তর অক্ষাংশ এবং ৮৯°৩২’ থেকে ৮৯°৪৮’ পূর্ব দ্রাঘিমাংশের মধ্যে বাগেরহাট জেলার অবস্থান। এ জেলার আয়তন ৫৮৮২.১৮ বর্গকিলোমিটার; তারমধ্যে ১৮৩৪.৭৪ বর্গকিলোমিটার বনাঞ্চল, ৪০৫.৩ বর্গকিলোমিটার জলাশয় এবং অবশিষ্টাংশ নিম্ন-সমভূমি। বাগেরহাট জেলা সদরের অধিকাংশ ভৈরব নদীর পশ্চিম তীরে এবং শহরের বর্ধিত অংশ ভৈরবের দক্ষিণ প্রবাহ দড়াটানার পশ্চিম তীরে অবস্থিত।বঙ্গবসাগরেের উত্তরে এটি অবস্থিত।\n\n"
                    "পৌরসভা ০৩ টি, গ্রামেরসংখ্যা ১,০৪৭ টি। বাগেরহাট জেলা মোট ৯ টি উপজেলায় বিভক্ত।\n\n"
                    "বাগেরহাট জেলায় সাক্ষরতারহার ৭৪.৬২% (পুরষ ৭৬.৭৫%,মহিলা ৭২.৪৮%), শিক্ষারহার ৬৫%, প্রাথমিকবিদ্যালয় মোট ১০৯০টি, মাধ্যমিকবিদ্যালয় ২৮২টি, নিম্নমাধ্যমিকবিদ্যালয় ৫০টি,কলেজিয়েট ০৬টি, মহাবিদ্যালয় ৩৩টি, মাদ্রাসা ২৪৫টি।অন্যান্যশিক্ষাপ্রতিষ্ঠান: কারিগরী কলেজ-০১টি, পিটিআই-০১টি, ভিটিআই-০১টি, কারিগরী প্রশিক্ষণকেন্দ্র-০৪টি, কৃষি ও প্রযুক্তি কলেজ ০১টি, যুবপ্রশিক্ষনকেন্দ্র-০১টি, হোমিওপ্যাথিক কলেজ ০১টি, মেডিকেল এ্যাসিস্ট্যান্ট ট্রেনিং স্কুল-০১টি, শারীরিক প্রশিক্ষণকেন্দ্র ০১টি, সরকারি শিশুসদন-০২টি, আইন কলেজ-০১টি, টেক্সটাইল ট্রেনিং ইনস্টিটিউট- ০১টি।\n\n"
                    "বাগেরহাট জেলায় হাসপাতাল ১১টি, শয্যাসংখ্যা ৪১৫টি, (সদরহাসপাতাল-২৫০শয্যা, ০৩টি ৫০শয্যা, ৫টি ৩১শয্যাবিশিষ্ট, মাতৃসদনকেন্দ্র ১০শয্যাবিশিষ্ট), ইউনিয়ন পরিবার কল্যাণকেন্দ্র ৬২টি, জনসংখ্যা বৃদ্ধির হার ১.৩৯%, নলকূপেরসংখ্যা ২০,০৫২টি, গভীরনলকূপ ৫,১৯৯টি (সচল-৫,১৪৩টি, অকেজো-৫৬টি), অগভীরনলকূপ ১৪,৮৫৩টি (সচল-১২,৯৩০টি, অকেজো-১,৯২৩টি), পিএসএফ ১৮৫৮টি (সচল-১৫০৮টি, অকেজো-৩৫০টি), ভিএসএসটি ১২২৮টি (সচল-১০৫০টি, অকেজো-১৭৮টি), এসএসটি ২,৬১৯টি(সচল-২৪৬৪টি, অকেজো-১৫৫টি),"
                    " রেইনওয়াটারহারভেস্টিং ৮৮টি, স্যানিটেশনকভারেজ ১০টি।\n\n"
                    "শিল্পতথ্য: সিমেন্টফ্যাক্টরী ০৪টি, এলপিজিপ্লান্ট ০২টি, ক্ষুদ্রশিল্প ৫৪২টি, কুটিরশিল্প ২,৩০২টি, বিসিকশিল্পনগরী ০১টি।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}