//cowadangha Jela
import 'package:flutter/material.dart';

class cowadanghaJela extends StatelessWidget {
  const cowadanghaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে চুয়াডাঙ্গা জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান ও আয়তন: চুয়াডাঙ্গা জেলার আয়তন ১১৭০.৮৭ বর্গ কিলোমিটার। চুয়াডাঙ্গা জেলার উত্তর-পূর্বদিকে কুষ্টিয়া জেলা, উত্তর-পশ্চিমে মেহেরপুর জেলা, দক্ষিণ ও দক্ষিণ-পূর্বে, ঝিনাইদহ জেলা, দক্ষিণে যশোর জেলা, এবং পশ্চিমে ভারতের নদিয়া জেলা অবস্থিত। জেলার মূল শহর চুয়াডাঙ্গা মাথাভাঙ্গা নদীর তীরে অবস্থিত।\n\n"
                "শাসনিক এলাকাসমূহ: চুয়াডাঙ্গা জেলায় মোট ৪টি উপজেলা রয়েছে, থানা ৫টি, পৌরসভা ৪ টি, ইউনিয়ন ৩৮ টি, মৌজা ৩৭৬ টি\n\n"
                "জনসংখ্যা উপাত্ত: ২০১৮ সালের পরিবার পরিকল্পনা অধিদপ্তরের এক প্রতিবেদন মতে চুয়াডাঙ্গা জেলার বর্তমান জনসংখ্যা ২৫ লক্ষ প্রায়।\n\n"
                "ভৌগোলিক উপাত্ত: বার্ষিক গড় তাপমাত্রা সর্বোচ্চ ৪২.১ ডিগ্রি সেলসিয়াস এবং সর্বনিম্ন ৫.৮ ডিগ্রি সেলসিয়াস। বার্ষিক গড় বৃষ্টিপাত ১,৪৬৭ মিলিমিটার। গোটা চুয়াডাঙ্গা জেলা গাঙ্গেয় অববাহিকায় অবস্থিত; যার ওপর দিয়ে মাথাভাঙ্গা, ভৈরব, কুমার, চিত্রা, এবং নবগঙ্গা নদীসমূহ প্রবাহিত হয়েছে।\n\n"
                "শিক্ষা:  দেশের নিরক্ষরমুক্ত জেলা হিসেবে পরিচিত। সমগ্র জেলার শিক্ষার হার ৫৯ % এবং শহরের জনসংখ্যার ৭০% শিক্ষিত। দামুড়হুদা উপজেলায় বেশ কয়েকটি কলেজ প্রতিষ্ঠিত হয়েছে। এর মধ্যে দর্শনা সরকারি কলেজ, আব্দুল ওদুদ শাহ্ ডিগ্রি কলেজ, কার্পাসডাঙ্গা ডিগ্রি কলেজ, বলদিয়া স্কুল এন্ড কলেজ, দামুড়হুদা ব্র্যাক মাধ্যমিক বিদ্যালয়, দামুড়হুদা পাইলট গালর্স স্কুল এন্ড কলেজ। এবং এতিম ও মিসকিন দের নিরক্ষরমুক্ত করতে ১৯৭৩ ইং সনে কলাবাড়ী দারুল উলুম বহুমুখী কওমী মাদ্রাসা হিফজ্খানা ও লিল্লাহ্ বোর্ডিং স্থাপিত হয়।\n\n"
                "অর্থনীতি: জেলার পেশার মধ্যে রয়েছে কৃষি ৩০.৩৩%, কৃষিশ্রমিক ১৮.০৮%, দিন মজুর ২.৬৯%,ব্যবসা ২২.৯৭% চাকরি ১৩.০৮%, পরিবহন খাত ৪.৯১% এবং অন্যান্য ৮.২২%।\n\n"
                "নদ-নদী: চুয়াডাঙ্গা জেলায় অনেকগুলো নদী রয়েছে। নদীগুলো হচ্ছে নবগঙ্গা নদী, চিত্রা নদী, ভৈরব নদ, কুমার নদ, মাথাভাঙ্গা নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
