//kulna Jela
import 'package:flutter/material.dart';

class kulnaJela extends StatelessWidget {
  const kulnaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে খুলনা জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ঐতিহাসিক ঘটনা প্রায় ৬০০ বছর আগে পীর খানজাহান এই জেলায় এসেছিলেন ধর্ম প্রচারের জন্য। তিনি প্রথমে সুন্দরবন এলাকা প্রতিষ্ঠার মাধ্যমে তার বসতি স্থাপন করেন এবং বাগেরহাটের আশেপাশের এলাকায়"
                " তার শাসন প্রতিষ্ঠা করেন। স্বদেশী আন্দোলনের প্রচারের জন্য মহাত্মা গান্ধী ১৯২৬ সালে খালিসপুরে আসেন।"
                "প্রশাসন জেলা প্রতিষ্ঠিত হয় ১৮৮২ সালে।১২ ডিসেম্বর ১৮৮৪ খুলনা পৌরসভা ঘোষনা করা হয় সালে এবং ১২ "
                "ডিসেম্বর ১৯৮৪ সালে মিউনিসিপ্যাল কর্পোরেশনে উন্নীত করা হয় । খুলনাকে সিটি কর্পোরেশন হিসেবে ঘোষনা"
                " করা হয় ৬ আগস্ট ১৯৯০ সালে‌।\n\n"
                "খুলনা জেলার উত্তরে যশোর ও নড়াইল জেলা; দক্ষিণে বঙ্গোপসাগর; পূর্বে বাগেরহাট জেলা এবং পশ্চিমে সাতক্ষীরা জেলা রয়েছে।\n\n"
                "এর আয়তন ৪৩৯৪.৪৫ কিমি²।\n\n"
                "খুলনা জেলার অবস্থান বাংলাদেশের দক্ষিণ পশ্চিম অঞ্চলে। এই জেলার জলবায়ু নাতিষীতোষ্ণ। খুলনা জেলায় "
                "জনসংখ্যা ২৩৭৮৯৭১; পুরুষ ১২৪৪২২৬, মহিলা ১১৩৪৭৪৫। মুসলিম ১৮২১১১৯, হিন্দু ৫৪০৬৯৩, "
                "বৌদ্ধ ১৫৮১৮, খ্রিস্টান ২৮৯ এবং অন্যান্য ১০৫২।"
                "উপজেলা :  ০৯টি\n\n"
                "খুলনা জেলায় রয়েছে উল্লেখযোগ্য সংখ্যক নদী। এখানকার নদীগুলো হচ্ছে রূপসা নদী, ভৈরব নদ, "
                "শিবসা নদী, পশুর নদী, কপোতাক্ষ নদ, নবগঙ্গা নদী, চিত্রা নদী, পশুর নদী, আঠারোবাঁকি নদী, ভদ্রা নদী,"
                " বুড়িভদ্রা নদী, শৈলমারী নদী, কাজিবাছা নদী, ডাকাতিয়া নদী, শাকবাড়িয়া নদী, কাঁকরী নদী, ঝপঝপিয়া নদী, "
                "তেলিগঙ্গা-ঘেংরাইল নদী, "
                "অর্পণগাছিয়া নদী, কুঙ্গা নদী, মারজাত নদী, মানকি নদী, বল নদী, নলুয়া নদী,"
                " ঘনরাজ নদী।\n\n"
                "খুলনা জেলায় শিক্ষার হার, শিক্ষা প্রতিষ্ঠান গড় হার ৫৭.৮১%; পুরুষ ৬৩.২৬%, মহিলা ৫১.৮৩%।"
                " বিশ্ববিদ্যালয় ৬, মেডিকেল কলেজ ১, হোমিওপ্যাথিক কলেজ ১, কলেজ ২৭, আর্ট কলেজ ১, "
                "পলিটেকনিক ইনস্টিটিউট ৬, মাধ্যমিক বিদ্যালয় ৫০।\n\n"
                "জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি ৩৪.৯০%, অকৃষি শ্রমিক ৬.২২%, শিল্প ৩.৫১%, ব্যবসা ১৯.৬০%, পরিবহণ"
                " ও যোগাযোগ ৫.১৭%, চাকরি ১৮.২৭%, নির্মাণ ১.৯৯%, ধর্মীয় সেবা ০.২১%, "
                "রেন্ট অ্যান্ড রেমিটেন্স ০.৭৮% এবং অন্যান্য ৯.৩৫%।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
