//kustia Jela
import 'package:flutter/material.dart';

class kustiaJela extends StatelessWidget {
  const kustiaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে কুষ্টিয়া জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ইতিহাস: বহুপূর্বে কুষ্টিয়া অবিভক্ত ভারতের নদীয়া জেলার (বর্তমানে ভারতের পশ্চিমবঙ্গে) অন্তর্ভুক্ত ছিল। এছাড়াও পাবনা জেলার মহকুমা ও থানা হিসেবেও রাজশাহী বিভাগের অন্তর্ভুক্ত ছিল এ জেলাটি। কোম্পানি আমলে কুষ্টিয়া যশোর জেলার অধীনে ছিল। ১৮৬৯ সালে কুষ্টিয়ায় একটি পৌরসভা প্রতিষ্ঠিত হয়। হ্যামিলটন'স গেজেট প্রথম কুষ্টিয়া শহরের কথা উল্লেখ করে।\n\n"
                "ভৌগোলিক সীমানা: কুষ্টিয়া জেলার আয়তন ১,৬২১.১৫ বর্গকিলোমিটার । এর উত্তরে রাজশাহী, নাটোর ও পাবনা, দক্ষিণে চুয়াডাঙ্গা ও ঝিনাইদহ জেলা, পূর্বে রাজবাড়ী এবং পশ্চিমে মেহেরপুর জেলা ও ভারতের পশ্চিমবঙ্গের নদীয়া জেলা ও মুর্শিদাবাদ জেলা অবস্থিত ।"
                "কুষ্টিয়ার ভিতর দিয়ে বয়ে যাওয়া প্রধান নদীগুলো হল পদ্মা, গড়াই নদী, মাথাভাঙ্গা, কালীগঙ্গা ও কুমার নদী। জেলাটির গড় সর্বোচ্চ তাপমাত্রা ৩৭.৮°সে এবং গড় সর্বনিম্ন তাপমাত্রা ১১.২°সে । এখানকার বার্ষিক গড় বৃষ্টিপাতের পরিমাণ ১,৪৬৭ মি.মি.।\n\n"
                "প্রশাসন:  কুষ্টিয়া জেলা ৬টি উপজেলা, ৭টি থানা, ৫টি পৌরসভা, ৫৭টি ওয়ার্ড, ৭০টি মহল্লা, ৭১টি ইউনিয়ন পরিষদ, ৭১০টি মৌজা ও ৯৭৮টি গ্রামে বিভক্ত।\n\n"
                "জনসংখ্যা: কুষ্টিয়া জেলার জনসংখ্যা ২৩,৬৬,৮১১ জন, যার মধ্যে ৫০.৮৬% পুরুষ ও ৪৯.১৪% মহিলা। জনসংখ্যার ৯৫.৭২% মুসলিম, ৪.২২% হিন্দু ও ০.০৬% অন্যান্য ধর্মাবলম্বী।\n\n"
                "স্বাধীনতার পর বাংলাদেশে প্রতিষ্ঠিত প্রথম সরকারি বিশ্ববিদ্যালয় ইসলামী বিশ্ববিদ্যালয়, বাংলাদেশ কুষ্টিয়ায় অবস্থিত। কুষ্টিয়ায় প্রথম স্থাপিত বেসরকারি বিশ্ববিদ্যালয় হলো রবীন্দ্র মৈত্রী বিশ্ববিদ্যালয় ।\n\n"
                "উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠান: সিরাজুল হক মুসলিম (বহুমুখী) উচ্চ বিদ্যালয় (১৯৪৬), কুষ্টিয়া সরকারি বালিকা উচ্চ বিদ্যালয় (স্থাপিত ১৮৭৬),কুমারখালি এম এন পাইলট মডেল মাধ্যমিক বিদ্যালয়(স্থাপিত :১৮৫৬),কুমারখালি সরকারি বালিকা বিদ্যালয় স্থাপিত:১৮৬৩) মিশন প্রাথমিক বিদ্যালয় (স্থাপিত ১৮৯৮), কুষ্টিয়া সরকারি বিশ্ববিদ্যালয় কলেজ (স্থাপিত ১৯৪৭), কুষ্টিয়া ইসলামিয়া কলেজ (স্থাপিত ১৯৬৮), দৌলতপুর অনার্স কলেজ (স্থাপিত ১৯৮৫), কুষ্টিয়া হাই স্কুল এবং কুষ্টিয়া জিলা স্কুল (স্থাপিত ১৯৬১)। কুওয়াতুল ইসলাম কামিল (এম.এ) মাদরাসা, রক্সিগোলি, বড়বাজার, কুষ্টিয়া (প্রতিষ্ঠিত ১৯৫৫) ঐতিহ্যেবাহী হরিনারায়ণপুর হাইস্কুল (স্থাপিত. .১৮৯১)((আমলা সদরপুর বহুমুখী উচ্চ বিদ্যালয়)) (প্রতিষ্ঠিত ১৮৯৯) (আমলা সরকারি কলেজ,১৯৭২),(কুমারখালি সরকারি কলেজ,১৯৭০)।\n\n"
                "সাক্ষরতার হার:  ৪৬.৩%\n\n"
                "কৃষি: বাংলাদেশের অন্যান্য অঞ্চলের মত কুষ্টিয়াতেও প্রধানত ধান, পাট, আখ, ডাল, তৈলবীজ ইত্যাদি চাষ করা হয়। তবে জেলাটিতে তামাক ও পানের চাষও লক্ষণীয়।\n\n"
                "নদীসমূহ: কুষ্টিয়া জেলায় অনেকগুলো নদী রয়েছে। নদীগুলো হচ্ছে পদ্মা নদী, মাথাভাঙ্গা নদী, কুমার নদ, কালীগঙ্গা নদী, গড়াই নদী ও ডাকুয়া খাল নদী,সাগরখালী নদী।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
