//Meherpur Jela
import 'package:flutter/material.dart';

class meherpurJela extends StatelessWidget {
  const meherpurJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে মেহেরপুর জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান: মেহেরপুর জেলা ২৩.৪৪° থেকে ২৩.৫৯° উত্তর অক্ষাংশ এবং ৮৮.৩৪° থেকে ৮৮.৫৩° পূর্ব দ্রাঘিমাংশের মধ্যে অবস্থিত। বাংলাদেশের উচ্চতম জেলা গুলোর একটি হচ্ছে এ জেলা। সমুদ্রপৃষ্ঠ হতে এর গড় উচ্চতা ২১ মিটার। এটি বাংলাদেশের পশ্চিমাংশের সীমান্তবর্তী জেলা। এ জেলার উত্তরে কুষ্টিয়া জেলার দৌলতপুর উপজেলা ও পশ্চিমবঙ্গ (ভারত); দক্ষিণে চুয়াডাঙ্গা জেলার জীবননগর উপজেলা , দামুড়হুদা উপজেলা ও পশ্চিমবঙ্গ (ভারত); পূর্বে কুষ্টিয়া জেলার মিরপুর উপজেলা , চুয়াডাঙ্গা জেলার আলমডাঙ্গা উপজেলা , পশ্চিমে ভারতের পশ্চিমবঙ্গ। মেহেরপুরের পশ্চিমাঞ্চল জুড়ে উত্তর-দক্ষিণে বিস্তৃত প্রায় ৬০ কিলোমিটার ভারতীয় সীমান্ত রয়েছে।\n\n"
                "আয়তন ৭১৬.০৮ বর্গ কিলোমিটার। এটি ০৩টি উপজেলা, ০৩টি থানা, ০২টি পৌরসভা (১টি ‌‍'ক' শ্রেণীর, ১টি 'খ' শ্রেণীর), ১৮টি ইউনিয়ন, ১৯৯টি মৌজা, ২৫৯টি গ্রাম নিয়ে গঠিত। উপজেলাসমূহের নাম- মেহেরপুর সদর, মুজিবনগর ও গাংনী উপজেলা।\n\n"
                "প্রশাসনিক এলাকাসমূহ: দেশভাগের পূর্বে মেহেরপুর ভারতের নদীয়া জেলার অংশ ছিল। মেহেরপুর জেলা হিসাবে স্বীকৃতি পায় ১৯৮৪ সালে। বর্তমানে এ জেলায় ৩টি উপজেলা, ১৮টি ইউনিয়ন, ১৮০টি মৌজা, ২৮৫টি গ্রাম, ২টি পৌরসভা, ১৮টি ওয়ার্ড এবং ১০০টি মহল্লা রয়েছে।\n\n"
                "কৃষি:  এসব জমিতে ধান, গম, পাট, ভুট্টা,তামাক, পিঁঁয়াজ, রসুন, মরিচ, ডাল, বাঁধাকপি, ফুলকপি, ওলকপি এবং বিভিন্ন ধরনের সবজি উৎপন্ন হয়ে থাকে। এ জেলায় বিভিন্ন ধরনের ফল যেমন আম, কলা, কাঁঠাল প্রচুর পরিমাণে উৎপন্ন হয়ে থাকে। এ জেলার সুস্বাদু আমের সুনাম রয়েছে।\n\n"
                "শিক্ষা: মেহেরপুর জেলার স্বাক্ষরতার হার ৫৩.৬ শতাংশ। নারীদের ক্ষেত্রে এ হার ৫১ শতাংশ এবং পুরুষদের ক্ষেত্রে ৫৬.২ শতাংশ। মেহেরপুরে সরকারি কলেজ রয়েছে ৪টি, বেসরকারি কলেজ ১২টি, কারিগরি শিক্ষাকেন্দ্র ৬টি, কলেজিয়েট স্কুল ৫টি, সরকারি উচ্চ বিদ্যালয় ৩টি, বেসরকারি মাধ্যমিক বিদ্যালয় ১১৪টি, নিম্ন মাধ্যমিক বিদ্যালয় ১১টি, সরকারি প্রাথমিক বিদ্যালয় ২৯৬টি, নন-রেজিস্টার্ড প্রাথমিক বিদ্যালয় ৭টি এবং মাদ্রাসার সংখ্যা ৬০টি। উল্লেখযোগ্য শিক্ষাপ্রতিষ্ঠানের মধ্যে রয়েছেঃ মেহেরপুর সরকারি কলেজ, মেহেরপুর সরকারি মহিলা কলেজ, মুজিবনগর সরকারি ডিগ্রী কলেজ, গাংনী সরকারি কলেজ, মেহেরপুর সরকারি উচ্চ বিদ্যালয়।\n\n"
                "নদ-নদীর:  নদ-নদীর সংখ্যা ০৪টি, আয়তন ১১৪৪৫.২০ হেক্টর। হচ্ছে ভৈরব নদ, মাথাভাঙ্গা নদী, কাজলা নদী ও ছেউটিয়া।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
