//Narail Jela
import 'package:flutter/material.dart';

class narailJela extends StatelessWidget {
  const narailJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে নড়াইল জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক অবস্থানে নড়াইল জেলা ৮৯.৩১° দ্রাঘিমাংশে এবং ২৩.১১° অক্ষাংশে অবস্থিত। নড়াইল জেলার পশ্চিমে যশোর জেলার বাঘারপাড়া উপজেলা, যশোর সদর উপজেলা ও অভয়নগর উপজেলা , উত্তরে মাগুরা জেলার শালিখা উপজেলা ও মোহাম্মদপুর উপজেলা, পূর্বে ফরিদপুর জেলার আলফাডাঙ্গা উপজেলা, গোপালগঞ্জ জেলার কাশিয়ানী উপজেলা ও গোপালগঞ্জ সদর উপজেলা এবং দক্ষিণে বাগেরহাট জেলার মোল্লাহাট উপজেলা, খুলনা জেলার তেরখাদা উপজেলা , দিঘলিয়া উপজেলা ও ফুলতলা উপজেলা এবং যশোরের অভয়নগর উপজেলা। নড়াইলের ভূমি দক্ষিণ দিকে ঢালু। এ ভূ-প্রকৃতিকে তিনটি অঞ্চলে ভাগ করা যায়। উত্তর পশ্চিমের অপেক্ষাকৃত উচ্চভূমি, উত্তর ও পূর্ব অঞ্চলের মধুমতি নদী তীরবর্তী নিম্ন অঞ্চল এবং নবগঙ্গা নদী ও চিত্রা নদীর তীরবর্তী মধ্যম উচ্চতা বিশিষ্ট অঞ্চল। এই জেলার পাকা সড়ক ২৪৩ কি: মি:, আধাপাকা ৭৪ কি: মি:, কাঁচা রাস্তা ১৬১৫ কি: মি: এবং জলপথ ৬৭ নটিকাল মাইল। ঐতিহ্যগত পরিবহনের মধ্যে "
                "রয়েছে পালকি (বিলুপ্ত), ঘোড়ার গাড়ি, মহিষের গাড়ি, গরুর গাড়ি (প্রায় বিলুপ্ত) এবং নৌকা।\n\n"
                "প্রশাসনিক এলাকাসমূহ: নড়াইল জেলায় ৩টি উপজেলা ও একটি থানা আছে। নড়াইলে জাতীয় সংসদের সংসদীয় আসন ২টি। কালিয়া উপজেলা ও নড়াইল উপজেলার ৫টি ইউনিয়ন নিয়ে নড়াইল-১ এবং লোহাগড়া ও নড়াইল পৌরসভাসহ উপজেলার ৮টি ইউনিয়ন নিয়ে নড়াইল-২ আসন।\n\n"
                "জলবায়ু: বার্ষিক গড় তাপমাত্রা সর্বোচ্চ ৩৭.১০° সে. এবং সর্বনিম্ন ১১.২০° সে.। বার্ষিক বৃষ্টিপাতের পরিমাণ ১৪৬৭ মি.মি.।\n\n"
                "জনসংখ্যা:  নড়াইলের মোট জনসংখ্যা প্রায় ৯ লক্ষ। এর মধ্যে পুরুষ ৫৪.২২%, মহিলা ৪৫.৭৮%, মুসলিম ৭৫.৫৬%, হিন্দু ২৪.৩১% এবং অন্যান্য ০.১৩%। নড়াইলে গড় সাক্ষরতা ৩৫.৬৫%। এর মধ্যে পুরুষ ৪২.২৩% এবং মহিলা ২৮.৯৯%।\n\n"
                "নদ-নদী:  নড়াইল জেলায় অনেকগুলো নদী রয়েছে। নদীগুলো হচ্ছে আঠারোবাঁকি নদী, নবগঙ্গা নদী, চিত্রা নদী, মধুমতি নদী ও ভৈরব নদ। রয়েছে প্রচুর বিল ও বাওড়। এর মধ্যে সবচেয়ে উল্লেখযোগ্য ইছামতির বিল ও চাচুরি বিল।\n\n"
                "শিক্ষা:  কলেজ ১৭টি, কারিগরি কলেজ ১টি, উচ্চ বিদ্যালয় ৯৪টি, জুনিয়র হাইস্কুল ২২টি, মাদ্রাসা ৮৫টি, মক্তব ১৬০টি, সরকারী প্রাথমিক বিদ্যালয় ২৮৭টি, বেসরকারী প্রাথমিক বিদ্যালয় ১৭১টি, আর্ট স্কুল ১টি, বৃত্তিমূলক স্কুল ১টি, কারিগরি স্কুল ৩টি, অন্ধদের স্কুল ১টি, কিন্ডার গার্ডেন ২টি, কমিউনিটি স্কুল ৬টি এবং স্যাটেলাইট স্কুল ১৯টি।উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠানের মধ্যে রয়েছে নড়াইল সরকারী উচ্চ বিদ্যালয়(১৯০৩) ভিক্টোরিয়া কলেজিয়েট উচ্চ বিদ্যালয় (১৮৫৬), নড়াইল সরকারী ভিক্টোরিয়া কলেজ (১৮৮৬), কালিয়া পাইলট হাইস্কুল (১৮৬৫)।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
