//Zinaidha Jela
import 'package:flutter/material.dart';

class zinadhaJela extends StatelessWidget {
  const zinadhaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ঝিনাইদহ জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ঝিনাইদহ জেলা বাংলাদেশের দক্ষিণ-পশ্চিমাঞ্চলের খুলনা বিভাগের একটি প্রশাসনিক অঞ্চল।\n\n"
                "ঝিনাইদহ যশোর জেলার একটি মহকুমা ছিল। ঝিনাইদহ জেলাটি ১৮৬২ সালে মহকুমা হিসেবে প্রতিষ্ঠিত হয় এবং ১৯৮৪ সালে এটি একটি পৃথক জেলা হয়। স্বাধীনতা যুদ্ধে ঝিনাইদহ জেলা ৬ ডিসেম্বর ১৯৭১ সালে স্বাধীনতা লাভ করে।\n\n"
                "এই জেলার নামকরণ সম্পর্কে কিছুই জানা যায়নি। কথিত আছে যে, ক্যালসিয়াম উৎপাদনের জন্য '‘নবগঙ্গা’' নদী এবং '‘দহা’' নদী থেকে ঝিনুক সংগ্রহের জন্য এই এলাকা বিখ্যাত হয়ে উঠেছিল। এই জেলার নাম ঝিনাইদহ “ঝিনুক”এবং “দাহ”শব্দদ্বয় থেকে নেয়া হয়েছে বলে মনে করা হয়।\n\n"
                "ভৌগোলিক বিস্তৃতি ২৩° ১৩' উত্তর অক্ষাংশ থেকে ২৩° ৪৬' উত্তর অক্ষাংশ পর্যন্ত এবং ৮৮° ৪২' পূর্ব দ্রাঘিমা হতে ৮৯° ২৩' পূর্ব দ্রাঘিমা পর্যন্ত। জেলার আয়তন ১৯৬৪.৭৭ বর্গ কিলোমিটার(৭৫৮.৬০ বর্গ মাইল)। ঝিনাইদহ জেলার পূর্ব পার্শ্বে মাগুরা জেলা, উত্তরে কুষ্টিয়া জেলা, দক্ষিণে যশোর জেলা ও পশ্চিমবঙ্গের ২৪ পরগণা, এবং পশ্চিমে পশ্চিমবঙ্গের ২৪ পরগণা ও বাংলাদেশের চুয়াডাঙ্গা জেলা অবস্থিত। ৭টি নদ-নদী প্রবাহিত এ জেলার মধ্য দিয়ে: বেগবতী, ইছামতী, কোদলা, কপোতাক্ষ নদ, নবগঙ্গা নদী, চিত্রা নদী ও কুমার নদী। এ অঞ্চলের জলবায়ু উষ্ণ প্রকৃতির ও সমভাবাপন্ন। বার্ষিক গড় তাপমাত্রা ২২.২৪° সেলসিয়াস। বার্ষিক গড় বৃষ্টিপাত ১৫২.১৯০ সেন্টিমিটার।\n\n"
                "প্রশাসনিক এলাকাসমূহ: এই জেলা ৬টি উপজেলা, ৬৭ টি ইউনিয়ন, ৯৪৫ টি মউজা, ১১৪৪ টি গ্রাম, ৬টি পৌরসভা, ৫৪ টি ওয়ার্ড এবং ১৩৬ টি মহল্লা নিয়ে গঠিত।\n\n"
                "জনসংখ্যা: বাংলাদেশের আদমশুমারি ও গৃহগণনা-২০১১ অনুযায়ী, ঝিনাইদহ জেলার জনসংখ্যা হল ১৭,৭১,৩০৪ জন। জনসংখ্যার ঘনত্ব হল ৯০১.৫ জন/বর্গ কিমি। পুরুষ হল জনসংখ্যার ৫০.০৪% এবং মহিলা ৪৯.৯৬%। মুসলমানরা জনসংখ্যার ৯০.৩৯%, হিন্দু ৯.৪৮%, খ্রিস্টান ০.০৬% এবং অন্যান্যরা হল ০.০৮%। সাত বছর বা তার উপরের বয়সীদের মধ্যে ঝিনাইদহে সাক্ষরতার হার ৪৮.৪%।\n\n"
                "নদ-নদী:  ঝিনাইদহ জেলায় অনেকগুলো নদ নদী রয়েছে। নদ-নদীগুলো হচ্ছে কপোতাক্ষ নদ, নবগঙ্গা নদী, গড়াই নদী, কুমার নদ, ডাকুয়া নদী, বেতনা নদী, চিত্রা নদী, ভৈরব নদী ও বেগবতী নদী।\n\n"
                "প্রধান ফসল ও ফলমুল:  ধান, পান, পাট, গম, আখ, সরিষা,মরিচ, রসুন, পেয়াজ, বিভিন্ন ধরনের ডাল শাকসবজি হলো এই এলাকার প্রধান ফসল।তাছাড়াও প্রধান ফলমুলের মধ্যে রয়েছে আম, কাঁঠাল, কলা, পেয়ারা,লিচু, নারকেল, খেজুর, তাল,ড্রাগন ইত্যাদি। পাট, ধান, রসুন পেয়াজ, পটল, খেজুর গুড়, পান পাতা প্রয়োজন মিটিয়ে রপ্তানি করা হয়।\n\n"
                " শিক্ষার হার: ৬২%,মহাবিদ্যালয় ৫০টি (সরকারী ০৬, বেসরকারী ৪৪ টি)",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
