import 'package:flutter/material.dart';

//boyalmari
class boyalmari extends StatelessWidget {
  const boyalmari({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে বোয়ালমারী উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ইতিহাস:  প্রাচীন জনপদ ভূষণা থানা ১৮১২ সালে সৈয়দপুরে স্থানান্তরিত এবং ১৮১৪ সালে বোয়ালমারী পূর্ণাঙ্গ থানা হিসাবে আত্মপ্রকাশ করে। সেই সময় ১৯টি ইউনিয়ন নিয়ে বোয়ালমারী থানা গঠিত হলেও পরবর্তীতে বানা ও পাচুড়িয়া ইউনিয়ন আলফাডাঙ্গা থানায় অন্তর্ভুক্ত হয় এবং ১৯৮৩ সালে মধুখালী থানা গঠিত হয় বোয়ালমারী থেকে ৬টি ইউনিয়ন এবং বালিয়াকান্দি থানা থেকে ৩টি ইউনিয়নের সমন্বয়ে বোয়ালমারী উপজেলায় ১৯৮৩ সালে উন্নীত হওয়ার পরে এস আরও নং ১০১-আইন/২০০০ যেহেতু সরকার মন্ত্রণালয়ের প্রজ্ঞাপন নং এস আরও ১৭৫-আইন/৯৯ তাং ২৮ জুন ১৯৯৯ সালে বোয়ালমারী পৌর এলাকা ঘোষিত হয়।\n\n"
                "১৩.৫৬ বর্গ কিলোমিটার আয়তনের এ পৌরসভায় ৯ টি ওয়ার্ড রয়েছে। বোয়ালমারী পৌরসভাটি ‘‘গ’’ থেকে ‘‘খ’’ শ্রেণীতে ২৭/১২/০৯ তারিখে পৌর-২/ঢাবি-গ-৩৮/৯৮-১৫৮৪নং স্মারকে উন্নীত হয়েছে। ০৯ টি মৌজায় ১৫ টি মহল্লা নিয়ে ০৯টি ওয়ার্ড বিশিষ্ট বোয়ালমারী পৌরসভা জনগণের সেবা করে চলছে। বোয়ালমারী পৌরসভার জনসংখ্যা- ২৭৭৪৩ জন। ২০০৯ সালের গণনা অনুযায়ী ভোটার সংখ্যা- ১৬,৫০৮ জন। তন্মধ্যে পুরুষ- ৮,২০৫ জন এবং মহিলা- ৮,৩০৩ জন। পৌরসভায় ২টি হাটবাজার রয়েছে।\n\n"
                "শিক্ষা প্রতিষ্ঠানগুলি হচ্ছে- বোয়ালমারী সরকারী ডিগ্রী কলেজ, কাজী সিরাজুল ইসলাম মহিলা কলেজ, বোয়ালমারী সরকারী বালিকা উচ্চ বিদ্যালয়, বোয়ালমারী জর্জ একাডেমী, নদেরচাঁদ পি.সি. দাস একাডেমী, বোয়ালমারী ছোলনা সালামিয়া ফাজিল মাদরাসা, আল হাসান মহিলা দাখিল মাদরাসা। প্রাথমিক বিদ্যালয় গুলি হচ্ছে, বোয়ালমারী সরকারী প্রাথমিক বিদ্যালয়,বাগুয়ান সরকারি প্রাথমিক বিদ্যালয়, কামারহেলা সরকারি প্রাথমিক বিদ্যালয়, ছোলনা সরকারী প্রাথমিক বিদ্যালয়, পশ্চিম সোতাশী প্রাথমিক বিদ্যালয়, চতুল সরকারী প্রাথমিক বিদ্যালয় ও মধ্যেরগাতী রেজিঃ প্রাথমিক বিদ্যালয়। কেজি স্কুল- উপজেলা প্রি ক্যাডেট স্কুল, নিউ মডেল প্রি ক্যাডেট স্কুল, জিকে কিন্ডার গার্টেন, পাঞ্জেরী একাডেমী, গুনবহা প্রি ক্যাডেট স্কুল,গুনবহা স্টার প্রি ক্যাডেট স্কুল, ম্যাক্সিম কিন্ডার গার্টেন ও গ্রীন কিশলয়। এছাড়া কওমী মাদ্রাসা ৩টি ও এতিমখানা ৩টি রয়েছে।\n\n"
                "শিক্ষার হার ৭৪.৭৬%। পৌর এলাকায় হোল্ডিং সংখ্যা মোট- ৪,৬৯৫ টি, সরকারী ১৯টি, বেসরকারী ৮টি এবং ব্যক্তি মালিকানাধীন ৪,৯৬৮টি। পাকা রাস্তা ৪৪.০০ কিলোমিটার এবং কাঁচা রাস্তা ২৭.০০ কিলোমিটার। অন্যান্য তথ্য প্রকাশিত পত্রিকা ৪টি, সিনেমা হল ১টি, হাসপাতাল ১টি (৫০শয্যা), ক্লিনিক ৪টি(প্রাইভেট), কবর স্থান ৩টি, শ্মশান ২টি, ফায়ার সার্ভিস স্টেশন ১টি, মসজিদ ৫২টি, মন্দির ৮টি, খেলার মাঠ ৮টি, বাস টার্মিনাল ১টি, ব্যাংক ৬টি, রেল স্টেশন ১টি, শহীদ মিনার ২টি, গণকবর ১টি, ডাক বাংলা ১টি ও বারাশিয়া ও চন্দনা নদীর ঘাট ২টি।\n\n"
                "জনসংখ্যার উপাত্ত:  ১৯৯১ সালের আদম শুমারি অনুসারে বোয়ালমারীর জনসংখ্যা হল ১৯০৫৯৯। পুরুষ ৫০. ৬৩%, এবং নারী ৪৯.৩৭%। এই উপজেলায় আঠারো বছর বেশি বয়সের জনসংখ্যা ১৯০১৫৯। বোয়ালমারীর সাক্ষরতার হার ২৭% (৭+ বছর), এবং জাতীয় গড় সাক্ষরতার হার ৩২.৪%।\n\n"
                "প্রশাসন:  বোয়ালমারীতে ১১ টি ইউনিয়ন / ওয়ার্ড, ১৭৩ মাওজা / মহল্লা এবং ২৫১ টি গ্রাম রয়েছে।\n\n"
                "দর্শনীয় স্থান:  সাতৈর শাহী জামে মসজিদ, খাজা নওয়াব আবদুল লতিফের বাড়ি, নদেরচাঁদ বাওঁড় অ্যান্ড পিকনিক স্পট। ",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
