import 'package:flutter/material.dart';

//saltha
class saltha extends StatelessWidget {
  const saltha({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে সালথা উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  এ উপজেলার উত্তরে ফরিদপুর সদর উপজেলা, দক্ষিণে গোপালগঞ্জ এর মুকসুদপুর উপজেলা ও কাশিয়ানী উপজেলা, পূর্বে নগরকান্দা উপজেলা, পশ্চিমে বোয়ালমারী উপজেলা।\n\n"
                "প্রশাসনিক এলাকা:  ৮টি ইউনিয়ন নিয়ে সালথা উপজেলা গঠিত।\n\n"
                "ইতিহাস:  শুরু থেকেই (সালথা) এলাকাটি ছিল একটি জলাভূমি অঞ্চল। ধীরে ধীরে তা মানুষের বসবাসযোগ্য হয়ে উঠে। ১৯০৬ সালে সর্বপ্রথম প্রশাসনিক থানার ছোঁয়া লাগে এই অঞ্চলে। স্থানীয় জনসাধারনের অসচেতনতা ও ক্রমাগত নদী ভাংগনের প্রেক্ষিতে উক্ত থানা সদর দপ্তর স্থানান্তর অনিবার্য্য হয়ে পড়ে। তৎকালীন চৌদ্দরশি জমিদারগণ তাদের প্রশাসনিক সুবিধার্থে তাদেরই খাজনা আদায়ের কাঁচারীর পার্শ্বে বর্তমান সালথা থানা সদর কার্যালয়ের জন্য জমিদান করেন। ১৯৮৪ সালে নগরকান্দা উপজেলায় রুপান্তরিত হয়। গত ২৪ সেপ্টেম্বর, ২০০৬ সালে উপ-২/সি-১২/২০০৫/৩৪ নং প্রজ্ঞাপন মূলে নগরকান্দা উপজেলার মোট আটটি (০৮) ইউনিয়ন পরিষদের সমন্বয়ে সালথা উপজেলা গঠিত হয়। ১৯ নভেম্বর, ২০০৮ সাল থেকে নবসৃষ্ট এ উপজেলার প্রশাসনিক কার্যক্রম শুরু হয় ।\n\n"
                "জনসংখ্যার উপাত্ত:  এই উপজেলার মোট জনসংখ্যা ১,৬৭,৪৪৬ জন (আদমশুমারী-২০১১)। এদের মধ্যে পুরুষ ৮৩,০৯৮ জন, মহিলা ৮৪,৩৪৮ জন। প্রতি বর্গ কি.মি.-এ ১,০৩৮ জন (প্রায়) বাস করে।\n\n"
                "শিক্ষা:  এই উপজেলায় দুটি কলেজ, ১৪টি উচ্চ বিদ্যালয়, ৬টি দাখিল মাদ্রাসা, ১টি আলিম মাদ্রাসা, ১টি ফাজিল মাদ্রাসা, ৩১টি বে-সরকারী প্রাথমিক বিদ্যালয় (প্রস্তাবিত সরকারি), ৪০টি সরকারী প্রাথমিক বিদ্যালয় রয়েছে।\n\n"
                "নদনদী:  বিখ্যাত কাগদী বাঁওড় রয়েছে। সালথা উপজেলার ভিতর দিয়ে বিখ্যাত আঁকাবাঁকা কুমার নদী বয়ে গেছে। গ্রামের ভাষায় যাকে গাং বলে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
