import 'package:flutter/material.dart';

//vangha
class vangha extends StatelessWidget {
  const vangha({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ভাঙ্গা উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  ভাঙ্গা ফরিদপুর সদর থেকে ২৮ কিঃ মিঃ পূর্বে কাওরাকান্দি থেকে ২০ কিঃ মিঃ দক্ষিণ পশ্চিমে। ভৌগোলিক বিবেচনায় ভাঙ্গার পশ্চিমে ফরিদপুর জেলায় নগরকান্দা উপজেলা, পূর্বে মাদারীপুর জেলার রাজৈর উপজেলা, উত্তরে ফরিদপুর জেলার সদরপুর উপজেলা এবং দক্ষিণে গোপালগঞ্জ জেলার মুকসুদপুর উপজেলা। উত্তর পূর্ব কোনে মাদারীপুর জেলার শিবচর উপজেলা এটি ঢাকার অদূরে অবস্থিত।\n\n"
                "প্রশাসনিক এলাকা:  ইউনিয়ন ১২ টি, মৌজা ১৩৬ টি, গ্রাম ২২৭ টি।\n\n"
                "ইতিহাস:  ভাঙ্গা কুমার নদীর পাড়ে অবস্থিত। কথিত আছে কুমার নদীর পাড়ে কুমারগঞ্জ নামে একটি বিরাট হাট বসত। কোন এক সময় হাটকে কেন্দ্র করে কুমার নদীর এপার ওপারের লোকজনের মধ্যে দ্বন্দ্ব লাগে এবং দ্বন্দ্বের এক পর্যায়ে ওপারের লোকজন কুমারগঞ্জের হাট ভেঙ্গে ওপারের হাট চালু করে। চালুকৃত হাটকেই ভাঙ্গার হাট নামে নামকরণ করা হয়। এ থেকেই ভাংগা উপজেলার উৎপত্তি।\n\n"
                "জনসংখ্যার উপাত্ত:  এই উপজেলার মোট জনসংখ্যা ২,৩২,৩৮৬ জন (প্রায়)। যার মধ্যে পুরুষ ২,৩৪,৪৯৬ জন (প্রায়) এবং মহিলা ২,৩০,২৭৬ জন (প্রায়)।\n\n"
                "ধর্ম:  মুসলিম ৯০.৩৫%; সনাতন ধর্মী ৯.৫২%; অন্যান্য ০.১৩%।\n\n"
                "ধর্মীয় প্রতিষ্ঠান:  মসজিদ ৪০৬ টি, মন্দির ৪২ টি, তীর্থস্থান-১(খাটরা)\n\n"
                "নদনদী:  ভাঙ্গা উপজেলায় অনেকগুলো নদী আছে। সেগুলো হচ্ছে আড়িয়াল খাঁ নদী, কুমার নদী (ফরিদপুর-গোপালগঞ্জ) এবং পুরানো কুমার নদী।\n\n"
                "শিক্ষা:  এই উপজলার শিক্ষার হার ৬৫%। পুরুষ ৬৮% এবং মহিলা ৬২%।\n\n"
                "শিক্ষা প্রতিষ্ঠান:  কলেজ ৩ টি; উচ্চবিদ্যালয় ১৭ টি; জুনিয়র হাই স্কুল ২ টি; বালিকা বিদ্যালয় ১ টি; প্রাথমিক বিদ্যালয় ৭৩ টি; মাদ্রাসা ১৩ টি; এতিমখানা ২\n\n"
                "অর্থনীতি:  এই এলাকার অর্থনীতির মূল চালিকা শক্তি হচ্ছে কৃষি কাজ। মালিকগ্রামের পাটের হাট ও গরু হাটের সুনাম সারা বাংলাদেশে রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
