import 'package:flutter/material.dart';
class khulna extends StatelessWidget {
  const khulna({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
   return SafeArea(
        child: Scaffold(
          backgroundColor: Colors.white,
          body: SingleChildScrollView(
            child: Column(
              children: [
                SizedBox(height: 10),
                Container(
                  height: 50,
                  width: 400,
                  color: Colors.grey,
                  child: Center(
                    child: Text(
                      "এক নজরে খুলনা বিভাগ",
                      style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                    ),
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("assets/Divition/khulna divition.svg.png",height: 400,width: 400),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "খুলনা বিভাগ বাংলাদেশের আটটি বিভাগের মধ্যে একটি এবং এটি দেশের দক্ষিণ পশ্চিম দিকে অবস্থিত। ২০১১ সালের আদমশুমারী অনুয়ায়ী, বিভাগটির আয়তন ২২,২৮৫ বর্গ কিলোমিটার এবং জনসংখ্যা ১৫,৫৬৩,০০০ জন। "
                      "খুলনা বিভাগের সদর দপ্তর খুলনা শহর। ঢাকা এবং চট্টগ্রামের পরে বাংলাদেশের তৃতীয় বৃহত্তম শহর। "
                      "খুলনা বাংলাদেশের দক্ষিণ পশ্চিমাঞ্চলে রূপসা নদী এবং ভৈরব নদীর তীরে অবস্থিত। বাংলাদেশের প্রাচীনতম নদী বন্দরগুলোর মধ্যে খুলনা অন্যতম। খুলনা বাংলাদেশের অন্যতম শিল্প ও বাণিজ্যিক এলাকা হওয়ায় খুলনা শহরকে শিল্প নগরী হিসেবে ডাকা হয়। খুলনা শহর থেকে ৪৮ কি.মি. দূরে বাংলাদেশের দ্বিতীয় সমুদ্র বন্দর মংলা সমুদ্র বন্দর অবস্থিত। "
                      "পৃথিবী বিখ্যাত উপকূলীয় বন সুন্দরবন খুলনা বিভাগের দক্ষিণাংশে অবস্থিত। খুলনা বিভাগের খুলনা, বাগেরহাট ও সাতক্ষীরা জেলায় সুন্দরবনের বিস্তৃতি ঘটেছে। "
                      "খুলনাকে সুন্দরবনের প্রবেশদ্বার বলা হয়।[রাজধানী ঢাকা থেকে খুলনা শহরের দূরত্ব সড়কপথে ৩৩৩কি.মি.। রাজধানী সহ দেশের অন্যান্য অঞ্চলের সংগে স্থলপথ, আকাশপথ, জলপথ "
                      "ব্যবহার করা যায়। ১৯১২ সালে থেকে অত্র অঞ্চলে নদীপথে স্টিমার (স্টিমবোট) চলাচল করে।\n\nখুলনা বিভাগ এর পশ্চিমে পশ্চিমবঙ্গ রাজ্যের সীমানা, "
                      "উত্তরে রাজশাহী বিভাগ, পূর্বে ঢাকা বিভাগ ও "
                      "বরিশাল বিভাগ এবং দক্ষিণে বিখ্যাত ম্যানগ্রোভ বন নামে "
                      "পরিচিত সুন্দরবন সহ বঙ্গোপসাগরের উপর তটরেখা রয়েছে। "
                      "এটি গঙ্গা নদীর দ্বীপ বা গ্রেটার বেঙ্গল ডেল্টার একটি অংশবিশেষ। "
                      "অন্যান্য নদীর মধ্যে রয়েছে মধুমতি নদী, ভৈরব নদী ও কপোতাক্ষ নদী। "
                      "এছাড়াও অঞ্চলের বঙ্গোপসাগরের কয়েকটি দ্বীপ রয়েছে। পৃথিবীর মানচিত্রে খুলনা বিভাগের অবস্থান ২১০৪০' "
                      "উত্তর অক্ষাংশ হতে ২৪০১২ উত্তর অংশে এবং ৮৮০৩৪' পূর্ব দ্রাঘিমা হতে ৮৯০৫৭' পূর্ব দ্রাঘিমায়।\n\n"
                      "প্রতিষ্ঠা : ১৯৬০\n\n"
                      "বিভাগীয় কমিশনার : মোঃ ইসমাইল হোসেন\n\n"
                      "আয়তন : মোট ২২,২৮৪.২২ বর্গকিমি (৮,৬০৩.৯৯ বর্গমাইল)\n\n"
                      "জনসংখ্যা (২০১১ আদমশুমারি) : মোট ১,৫৬,৮৭,৭৫৯\n\n"
                      "জনঘনত্ব : ৭০০/বর্গকিমি (১,৮০০/বর্গমাইল)\n\n"
                      "জেলা : ১০টি\n\n"
                      "প্রশাসনিক কেন্দ্র : ১০টি\n\n"
                      "আইএসও ৩১৬৬ কোড : BD-D",
                  textAlign: TextAlign.justify,
                  style: TextStyle(fontWeight: FontWeight.bold),),
                SizedBox(height: 10),
                RaisedButton(
                  onPressed: () {
                    Navigator.pop(context);
                  },
                  child: Text("BACK",style: TextStyle(fontWeight: FontWeight.bold),
                ),
                ),
              ],
            ),
          ),
        ));
  }
}
