import 'package:flutter/material.dart';
class sylet extends StatelessWidget {
  const sylet({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
          backgroundColor: Colors.white,
          body: SingleChildScrollView(
            child: Column(
              children: [
                SizedBox(height: 10),
                Container(
                  height: 50,
                  width: 400,
                  color: Colors.grey,
                  child: Center(
                    child: Text(
                      "এক নজরে সিলেট বিভাগ",
                      style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                    ),
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("assets/Divition/sylet divition.svg.png",height: 400,width: 400),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "সিলেট নামের উৎপত্তি নিয়ে নানা মতবাদ রয়েছে। "
                      "প্রাচীন গৌড়ের রাজা ‘গুহক’ তার কন্যা শীলাদেবীর "
                      "নামে একটি হাট স্থাপন করেন। এ কারণে ‘শীলাহাট’ "
                      "থেকে সিলট বা সিলেট নামের পরিচিতি হতে পারে বলে অনেকে মনে করেন।\n\n"
                      "হযরত শাহ্জালাল (রঃ) কর্তৃক ‘সিল হট্ যাহ্’ আদেশ থেকে ‘সিল্হট্’ নামের উৎপত্তি বলেও "
                      "অনেকে মনে করেন। ৬৪০ খ্রিস্টাব্দে চীন দেশীয় বৌদ্ধ পন্ডিত ও পরিব্রাজক হিউয়েন সাং সিলেটকে "
                      "শি-লি-চা-ত-ল’ বলে উল্লেখ করেছেন। খৃষ্টীয় একাদশ শতাব্দীতে মুসলিম পরিব্রাজক মনিষী আল্ বেরুনীর ‘কিতাবুল হিন্দ’ গ্রন্থে সিলেটকে ‘সীলাহেত’ "
                      "বলে উলেস্নখ করা হয়। ইংরেজ আমলে কাগজ-পত্রে প্রথমে ‘Silhet'বলে উল্লেখ থাকলেও উনবিংশ শতাব্দির প্রথম দিকে কাছাড় ইংরেজ অধিকারে আসার পর "
                      "জেলার সদর স্টেশন ‘Silchar'থেকে পার্থক্য দেখাবার জন্য ‘Sylhet'  বলে উল্লেখ করা হয়। এভাবে আজকের সিলেট নামের গোড়াপত্তন হয়।\n\n"
                      "সিলেট বিভাগ ২৩°৫৮´উওর অক্ষাংশ থেকে ২৫°১২´উওর অক্ষাংশ এবং ৯০°৫৬´পূর্ব দ্রঘিমাংশ থেকে ৯২° ৩০´পূর্ব দ্রাঘিমাংশের মধ্যে অবস্থিত।\n\n"
                      "সিলেট বিভাগের মোট আয়তন ১২,৫৫৮ (বার হাজার পাঁচশত আটান্ন) বর্গ কিলোমিটার।\n\n"
                      "সিলেট বিভাগের উত্তর, পূর্ব ও দক্ষিণ দিকে উঁচু উঁচু পর্বত শ্রেণীর পাহাড়ী অঞ্চল। মূলত: মেঘালয়, খাসিয়া, জৈন্তিয়া, ত্রিপুরার পাহাড়ের মাঝামাঝি "
                      "বিস্তৃর্ণ এলাকাটিই হচ্ছে সিলেট বিভাগ বা প্রাচীন শ্রীহট্ট। অভ্যমত্মরীন সীমাভূমি বেশির ভাগ সমতল প্রামত্মর। স্থানে স্থানে জঙ্গল ও বালুকাময় ক্ষুদ্র ক্ষুদ্র টিলা রয়েছে।\n\n"
                      "সংসদীয় আসন : মোট ১৯ টি (সিলেট: ০৬টি; সুনামগঞ্জ :০৫টি ; মৌলভীবাজার: ০৪টি; হবিগঞ্জ: ০৪টি)\n\n"
                      "থানা : মোট ৪৪ টি (সিলেট: ১৭টি; সুনামগঞ্জ : ১১টি ; মৌলভীবাজার: ০৭টি; হবিগঞ্জ: ০৯টি)\n\n"
                      "ইউনিয়ন : মোট ৩৩৬ টি (সিলেট: ১০৫টি; সুনামগঞ্জ : ৮৭টি ; মৌলভীবাজার: ৬৭টি; হবিগঞ্জ: ৭৭টি)\n\n"
                      "মোট জনসংখ্যা : মোট ৯৮,০৭,০০০ জন\n\n"
                      "শিক্ষার হার : ৪৯.৩২%জন\n\n"
                      " শিক্ষা প্রতিষ্ঠান : মোট প্রতিষ্ঠান ৬,২৪২ টি",
                  textAlign: TextAlign.justify,
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                SizedBox(height: 10),
                RaisedButton(
                  onPressed: () {
                    Navigator.pop(context);
                  },
                  child: Text(
                    "BACK",
                    style: TextStyle(fontWeight: FontWeight.bold),
                  ),
                ),
              ],
            ),
          ),
        ));
  }
}
