import 'package:flutter/material.dart';
class dhakaJela extends StatelessWidget {
  const dhakaJela ({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
          backgroundColor: Colors.white,
          body: SingleChildScrollView(
            child: Column(
              children: [
                SizedBox(height: 10),
                Container(
                  height: 50,
                  width: 400,
                  color: Colors.grey,
                  child: Center(
                    child: Text(
                      "এক নজরে ঢাকা জেলা",
                      style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                    ),
                  ),
                ),
                SizedBox(
                  height: 10,
                ),
                Image.asset("assets/dhakaDivitionJela/BD_Dhaka_District_locator_map.svg.png",height: 400,width: 400),
                SizedBox(
                  height: 10,
                ),
                Text(
                  "ঢাকা জেলা বাংলাদেশের একটি অতি প্রাচীন প্রশাসনিক এলাকা যার ইতিহাস কয়েক শতাব্দী প্রাচীন। ভৌগোলিক অবস্থানগত দিক থেকে এ জেলা ২৩˚২২′৩০′′থেকে ২৪˚২২′২০′′উত্তর অক্ষাংশে এবং ৮৯˚৪১′৬′′  থেকে ৯০˚৫৯′২৩′′পূর্ব দ্রাঘিমাংশের মধ্যে গণপ্রজাতন্ত্রী বাংলাদেশের প্রায় কেন্দ্রস্থলে অবস্থিত।\n\n"
                      "অতীতে ঢাকা জেলা একটি বিরাট এলাকা নিয়ে গঠিত ছিল এবং বিভিন্ন নামে পরিচিত ছিল। বর্তমানে তা একটি ক্ষুদ্র এলাকা নিয়ে গঠিত এবং আয়তন মাত্র ১৪৬৩.৬০ বর্গ কি. মি.।\n\n"
                      "জেলার জলবায়ু সুষমভাবাপন্ন। সর্বোচ্চ উত্তাপ ১০৮০ ফারেনহাইট, সর্বনিম্ন ৪০০ ফারেনহাইট এবং গড় তাপমাত্রা ৭৮. ০২০ ফারেনহাইট। মৌঁসুমী জলবায়ুর প্রভাবে প্রচুর বৃষ্টিপাত হয়। সর্বোচ্চ বৃষ্টিপাত ১০৩.৮৬ ইঞ্চি, সর্বনিম্ন ৪৭.১৩ ইঞ্চি এবং স্বাভাবিকভাবে বৃষ্টিপাতের গড় ৭৩.৩৬ ইঞ্চি।"
                      " ঢাকার অধিবাসীরা অত্যন্ত সৌহার্দ্যপূর্ণ, একই সাথে কঠিন পরিশ্রমী যাদের বিভিন্ন শিল্পকলায় চূড়ান্ত সফলতা রয়েছে।\n\n"
                      "আয়তন : ১৪৬৩.৬০ বর্গকিঃমিঃ\n\n"
                      "মোট জনসংখ্যা : ১ কোটি ২৫ লক্ষ ১৭ হাজার ৩ শত ৬১ জন\n\nপুরুষ  :  ৬৮,১৩,৪৬৩\n\n"
                      "মহিলা  :  ৫৭,০৩,৯০৮\n\nশিক্ষারহার  :  ৭০.৫০ %\n\nখানা   (Household)  : ২৭,৮৬,১৩৩ টি\n\n"
                      "সেক্স রেসিও  :  ১১৯জনসংখ্যার\n\nঘনত্ব  :  ৮,২২৯ (প্রতি বর্গকিঃমিঃ)\n\nজনসংখ্যা প্রবৃদ্ধির হার   :  ৩.৪৮ (প্রতি বছর)\n\n"
                      "শহরায়ন (%)  :  ৭৭.৩৬\n\n"
                      "উপজেলার সংখ্যা   : ৫টি\n\n"
                      "মেট্রোপলিটন থানা  :  ৪১\n\nসিটি কর্পোরেশন  :  ২টি\n\nপৌরসভার সংখ্যা  :  ৩টি\n\n"
                      "ইউনিয়নের সংখ্যা  :  ৭৯টি\n\n"
                      "মৌজার সংখ্যা   :  ৯৭৪টি\n\nগ্রামসংখ্যা  :  ১ হাজার ৯ শত ৯৯ টি\n\nসিটি ওয়ার্ড  :  ৯২টি\n\nসিটি মহল্লা: ৮৫৫ টি\n\nপৌরওয়ার্ড  :  ২৭টি"
                      "\n\nপৌর মহল্লা  :  ১৩৩টি\n\nসংসদীয়আসন সংখ্যা  :  ২০ টি\n\nউন্নয়ন সার্কেল  :  ১টি\n\nকলেজের সংখ্যা   :  ১৬৭টি\n\nহাইস্কুলের সংখ্যা   :  ৪৭৯টি"
                      "\n\nমাদ্রাসার সংখ্যা   :  ১৬৫টি\n\nসরকারী প্রাথমিক বিদ্যালয়ের সংখ্যা  :  ৭২৮টি\n\nবেসরকারী প্রাথমিক বিদ্যালয়ের সংখ্যা  :  ৬৮৯টি মসজিদের সংখ্যা  :  ৩০৮৮টি"
                      "\n\nমন্দিরের সংখ্যা  :  ৮০৮টি"
                      "\n\nগীর্জার সংখ্যা  :  ৩৩টি\n\nমোট আবাদী জমির পরিমান  :  ১০৯১২৯ হেক্টর\n\nঅর্থকরী ফসল  :  পাট, তুলা, আখ\n\nশিল্পপ্রতিষ্ঠানের সংখ্যা  :  ১০ জনের অধিক জনবল ৯৪২৫ টি, ১০ জনের কম"
                      " জনবল- ৩২৪৪০টি।\n\nরাস্তার মোট সংখ্যা  :  ১৫৯৮টি\n\nরাস্তার মোট দৈর্ঘ্য  :  ৪১০৭কিঃমিঃ\n\nকাঁচারাস্তা  :  ৩১৪৬কিঃমিঃ"
                      "\n\nআধাপাকা  :  ৫৪৬কিঃমিঃ\n\nইটপাকা   :  ৩৯৯কিঃমিঃ"
                      "\n\nশক্ত আরসিসি রাস্তা  :  ১৬কিঃমিঃ\n\nখাদ্যগুদামের সংখ্যা   :  ০৭টি\n\nধারণক্ষমতা   :  ৪৬,২৫০মেঃটন\n\nজলাভূমির সংখ্যা   :  ১২টি(২০একরেরউর্দ্ধে)\n\nমোট মৌজার সংখ্যা   :  ১,০৯৬টি",
                  textAlign: TextAlign.justify,
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                SizedBox(height: 10),
                RaisedButton(
                  onPressed: () {
                    Navigator.pop(context);
                  },
                  child: Text(
                    "BACK",
                    style: TextStyle(fontWeight: FontWeight.bold),
                  ),
                ),
              ],
            ),
          ),
        ));;
  }
}