import 'package:flutter/material.dart';

class manikgongJela extends StatelessWidget {
  const manikgongJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
        child: Scaffold(
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Column(
          children: [
            SizedBox(height: 10),
            Container(
              height: 50,
              width: 400,
              color: Colors.grey,
              child: Center(
                child: Text(
                  "এক নজরে মানিকগঞ্জ জেলা",
                  style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                ),
              ),
            ),
            SizedBox(
              height: 10,
            ),
            Image.asset("assets/dhakaDivitionJela/BD_Manikganj_District_locator_map.svg.png",height: 400,width: 400),
            SizedBox(
              height: 10,
            ),
            Text(
              "মানিকগঞ্জ মহকুমা প্রতিষ্ঠিত হয় ১৮৪৫ সালের মে মাসে। মানিকগঞ্জ মহকুমা প্রথমে ফরিদপুর জেলার (১৮১১ সালে সৃষ্ট) অধীন ছিল। প্রশাসনিক জটিলতা নিরসন কল্পে ১৮৫৬ সালে মানিকগঞ্জ  মহকুমাকে ফরিদপুর  জেলা  থেকে  ঢাকা জেলায় অন্তর্ভূক্ত করা হয়। ০১ মার্চ ১৯৮৪ সালে মানিকগঞ্জ কে জেলায় উন্নীত করা হয়।\n\nমোট জনসংখ্যা:   ১৪,৪৭,২৯৮\n\nপুরুষ:  ৭,০২,৮০৭ জন (৪৮.৫%)\n\nমহিলা:  ৭,৪৪,৪৯১ জন (৫১.৫%)\n\nস্থূল জন্মহার:  ১৮.৩ (হাজারে)স্থূল মৃত্যুহার:  ৫.০ (হাজারে)\n\nমোট ভোটার সংখ্যা:  ১১,১০,৬৯৫ জন:  পুরুষ:    ৫,৫২,৭২১ জন (৪৯.৮%)\n\nমহিলা:  ৫,৫৭,৯৭৪ জন (৫০.২%)\n\nউপজেলা:  ০৭টি\n\nথানা:  ০৭টিপৌরসভা:  ০২টি\n\nইউনিয়ন:  ৬৫টি\n\nগ্রাম:  ১৬৬৮ টি\n\nসিটি কর্পোরেশন:.   নেই\n\nপ্রাথমিক বিদ্যালয়:  ৬৪৮ টি\n\nমাধ্যমিক বিদ্যালয়:  ১৫৮ টি\n\nমাদ্রাসা:  ২৮ টি\n\nকলেজ:  ৩১ টি\n\nমৌজা:  ১৩৫৭ টি\n\nনদী: প্রধান ০৫টি নদীঃ১) পদ্মা২) যমুনা৩) ধলেশ্বরী৪) ইছামতি৫) কালিগঙ্গা\n\nবদ্ধ জলমহাল ২০ একরের উর্ধ্বে ও অনুর্ধ্ব ২০ একর:  ২০ একরের    উধের্ব ১৬ টি, ২০ একরের নীচে ৬৫ টি\n\nউন্মুক্ত জলমহাল:  ২২টি\n\nহাট-বাজর:  ১২১ টি\n\nমোট জমি:  ১২০৭৯৭.৩২ হেক্টর।মোট আবাদী জমি:  ১০৭৮১৭ হেক্টর\n\nইউনিয়ন ভূমি অফিস:  ৬৬ টি\n\nপাকা রাস্তা:  ২৬৪ কিঃমিঃ\n\nকাঁচা রাস্তা:  ২২৬১ কিঃমিঃ\n\nআবাসন:  প্রস্তাবিত ১৭টি ,বাস্তবায়নকৃত ১৩টি\n\nআশ্রায়ন প্রকল্প:  ১৩টি\n\nআদর্শ গ্রাম:  ২২টি\n\nখেয়াঘাট/ নৌকাঘাট:  ৪৯ টি\n\nশিক্ষা:  ৫৬%  ( শিক্ষার হার )\n\nসংসদীয় আসন:  ০৩ টি মহকুমা প্রতিষ্ঠিত হয় ১৮৪৫ সালের মে মাসে। মানিকগঞ্জ মহকুমা প্রথমে ফরিদপুর জেলার (১৮১১ সালে সৃষ্ট) অধীন ছিল। প্রশাসনিক জটিলতা নিরসন কল্পে ১৮৫৬ সালে মানিকগঞ্জ  মহকুমাকে ফরিদপুর  জেলা  থেকে  ঢাকা জেলায় অন্তর্ভূক্ত করা হয়। ০১ মার্চ ১৯৮৪ সালে মানিকগঞ্জ কে জেলায় উন্নীত করা হয়।\n\nমোট জনসংখ্যা:   ১৪,৪৭,২৯৮\n\nপুরুষ:  ৭,০২,৮০৭ জন (৪৮.৫%)\n\nমহিলা:  ৭,৪৪,৪৯১ জন (৫১.৫%)\n\nস্থূল জন্মহার:  ১৮.৩ (হাজারে)স্থূল মৃত্যুহার:  ৫.০ (হাজারে)\n\nমোট ভোটার সংখ্যা:  ১১,১০,৬৯৫ জন:  পুরুষ:    ৫,৫২,৭২১ জন (৪৯.৮%)\n\nমহিলা:  ৫,৫৭,৯৭৪ জন (৫০.২%)\n\nউপজেলা:  ০৭টি\n\nথানা:  ০৭টিপৌরসভা:  ০২টি\n\nইউনিয়ন:  ৬৫টি\n\nগ্রাম:  ১৬৬৮ টি\n\nসিটি কর্পোরেশন:.   নেই\n\nপ্রাথমিক বিদ্যালয়:  ৬৪৮ টি\n\nমাধ্যমিক বিদ্যালয়:  ১৫৮ টি\n\nমাদ্রাসা:  ২৮ টি\n\nকলেজ:  ৩১ টি\n\nমৌজা:  ১৩৫৭ টি\n\nনদী: প্রধান ০৫টি নদীঃ১) পদ্মা২) যমুনা৩) ধলেশ্বরী৪) ইছামতি৫) কালিগঙ্গা\n\nবদ্ধ জলমহাল ২০ একরের উর্ধ্বে ও অনুর্ধ্ব ২০ একর:  ২০ একরের    উধের্ব ১৬ টি, ২০ একরের নীচে ৬৫ টি\n\nউন্মুক্ত জলমহাল:  ২২টি\n\nহাট-বাজর:  ১২১ টি\n\nমোট জমি:  ১২০৭৯৭.৩২ হেক্টর।মোট আবাদী জমি:  ১০৭৮১৭ হেক্টর\n\nইউনিয়ন ভূমি অফিস:  ৬৬ টি\n\nপাকা রাস্তা:  ২৬৪ কিঃমিঃ\n\nকাঁচা রাস্তা:  ২২৬১ কিঃমিঃ\n\nআবাসন:  প্রস্তাবিত ১৭টি ,বাস্তবায়নকৃত ১৩টি\n\nআশ্রায়ন প্রকল্প:  ১৩টি\n\nআদর্শ গ্রাম:  ২২টি\n\nখেয়াঘাট/ নৌকাঘাট:  ৪৯ টি\n\nশিক্ষা:  ৫৬%  ( শিক্ষার হার )\n\nসংসদীয় আসন:  ০৩ টি",
              textAlign: TextAlign.justify,
              style: TextStyle(fontWeight: FontWeight.bold),
            ),
            SizedBox(height: 10),
            RaisedButton(
              onPressed: () {
                Navigator.pop(context);
              },
              child: Text(
                "BACK",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
            ),
          ],
        ),
      ),
    ));
    ;
  }
}
