import 'package:flutter/material.dart';

class tangialJela extends StatelessWidget {
  const tangialJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/dhakaDivitionJela/BD_Tangail_District_locator_map.svg.png",height: 400,width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "আয়তন।  :   ৩৪১৩.৬৮বর্গকি:মি:\n\nআবাদী ও অনাবাদী জমি  :   ১৮১১.১৮ বর্গ কি:মি:\n\nবনভূমি   :  ৫০৯.৮১ বর্গ কি:মি:\n\nচতুর্সীমাউত্তরে জামালপুর জেলা, দক্ষিণে ঢাকা জেলা ও মানিকগঞ্জ জেলা, পূর্বে ময়মনসিংহ জেলা ও গাজীপুর জেলা, পশ্চিমে সিরাজগঞ্জ জেলা\n\n"
                    "সংসদীয় এলাকার সংখ্যা ও নাম   :   ০৮টি; মধুপুর-ধনবাড়ী-০১, গোপালপুর-ভূঞাপুর-০২,"
                    "ঘাটাইল-০৩, কালিহাতী-০৪,"
                    "টাঙ্গাইল-০৫,দেলদুয়ার-নাগরপুর-০৬,মির্জাপুর-০৭ ও সখিপুর-বাসাইল-০৮\n\nউপজেলার সংখ্যা ও নাম   :    ১২টি; টাঙ্গাইল সদর, মধুপুর, গোপালপুর, ভূঞাপুর, ঘাটাইল,কালিহাতী, দেলদুয়ার, নাগরপুর, মির্জাপুর, সখিপুর, বাসাইল ও ধনবাড়ী\n\nপৌরসভার সংখ্যা  :     ১১টি; টাঙ্গাইল, মধুপুর, ধনবাড়ী, গোপালপুর, ভূঞাপুর,"
                    "ঘাটাইল, কালিহাতী, মির্জাপুর, সখিপুর, বাসাইল ও এলেঙ্গা\n\nথানার সংখ্যা ও নাম :  ১৪ টি; টাঙ্গাইল সদর, মধুপুর, ধনবাড়ী, গোপালপুর, ভূঞাপুর, ঘাটাইল, কালিহাতী, দেলদুয়ার, নাগরপুর, মির্জাপুর, সখিপুর, বাসাইল, যমুনা সেতু পূর্ব ও হাইওয়ে থানা\n\nপুলিশ ফাঁড়ি   : ০৮টি\n\nমোট ইউনিয়ন পরিষদ / ইউডিসির সংখ্যা   :   ১১৮টি\n\nপিডিসির সংখ্যা :          ১১টি\n\nমোট মৌজার সংখ্যা   :   ১৮৫৫ টি\n\nগ্রামের সংখ্যা    :   ২৪২৯ টি  :   মহল্লার সংখ্যা   :   ২৩৯ টি\n\nইউনিয়ন ভূমি অফিসের সংখ্যা   :  ১০১টি\n\nজনসংখ্যা\n\n৪০,০৫,০৮৩ জন\n\nজনসংখ্যার ঘনত্ব   :   ১০৫৬ প্রতি বর্গ কি:মি:\n\nভোটার সংখ্যা   :   ২৫,১৫,৩২৭ জন\n\nসরকারি প্রাথমিক বিদ্যালয়    :    ৬২৬টি\n\nসরকারি মাধ্যমিক বিদ্যালয়  :     ০৫টি\n\nসরকারি কলেজ   :   ০৭টি\n\nক্যাডেট কলেজ   :   ০১টি\n\nবে-সরকারি কলেজ   :   ৬৬টি\n\nমাদ্রাসা:২৩৩ টি\n\nকওমী মাদ্রাসা:৮৮টি\n\nটেকনিক্যাল/ভোকেশনাল ইনস্টিটিউট:১৩টি\n\nসরকারি মেডিকেল কলেজ:০১টি\n\nবে-সরকারি মেডিকেল কলেজ:০১টি\n\nবিশ্ববিদ্যালয়-০১টি\n\nশিক্ষার"
                    " হার:৬৫.০৮%\n\nমেডিকেল কলেজ:০২ টি\n\nপুলিশ ট্রেনিং সেন্টার:০১টি\n\nপ্রধান নদ-নদী: ধলেশ্বরী, যমুনা, লৌহজং, বৈরান, ঝিনাই, বংশী, তুরাগ\n\nরেলপথ: ৮৫ কিঃ মিঃ। ব্রডগেজ ও মিটারগেজ এর মিশ্রণ (ডুয়েলগেজ)\n\nরেল স্টেশন: ৬টি\n\nমসজিদের সংখ্যা\n\n৫,৭৬৩ টি\n\nমন্দিরের সংখ্যা: ৭৫৯ টি\n\nগীর্জার সংখ্যা: ৫৬ টি\n\nঈদগাহ্ মাঠ\n\n১,৬৯১ ‍টি\n\nঅর্থকরী ফসল: ধান, পাট, গম, সরিষা, কলা, আনারস, আদা, ইক্ষু, আলু, তিল,তিশি  ইত্যাদি\n\nআদর্শ গ্রাম:১২ টি\n\nসাইক্লোন সেন্টার:     ০১টি\n\nপার্ক/ চিত্ত বিনোদন কেন্দ্র:   ০৭টি\n\nজুট মিল:   ০১টি\n\nগার্মেন্টস ফ্যাক্টরী:    ০৪ টি\n\nরাইস মিল:   ১০৮১ টি\n\nতাঁত শিল্প:৩১,৫৭৪ টি\n\nখাদ্য গুদামের সংখ্যা\n\n১৪ টি\n\nমোট ধারণ ক্ষমতা:   ৩৪,৬১৮ মেঃটন\n\nশিল্প প্রতিষ্ঠানের সংখ্যা    :    ১০,০৬০টি। বড়-১০টি, মধ্যম-৮০টি, কুটির শিল্প-৯,৯৭০টি\n\nক্ষুদ্র নৃ-গোষ্ঠী/ উপজাতি সম্প্রদায়    :    গারো, বংশী, কোচ, হাজং",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
    ;
  }
}
