import 'package:flutter/material.dart';

//kalkini
class kalkini extends StatelessWidget {
  const kalkini({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে কালকিনি উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  কালকিনি উপজেলার ভৌগোলিক অবস্থান ২৩°০০´ থেকে ২৩°১০´ উত্তর অক্ষাংশ এবং ৯০°০৬´ থেকে ৯০°২১´ পূর্ব দ্রাঘিমাংশ।[৭] এর মোট আয়তন ২৮৩.৪০ বর্গ কিলোমিটার। কালকিনি উপজেলার কেন্দ্র থেকে দক্ষিণে বরিশাল, উত্তরে মাদারীপুর জেলা সদর, উত্তর-পূর্বে শরীয়তপুর ও পশ্চিমে গোপালগঞ্জ জেলা অবস্থিত। এর উত্তরে মাদারীপুর সদর ও শরীয়তপুর সদর উপজেলা, দক্ষিণে গৌরনদী এবং আগৈলঝাড়া উপজেলা, পূর্বে গোসাইরহাট, মুলাদী ও ডামুড্যা উপজেলা, পশ্চিমে কোটালিপাড়া ও গৌরনদী উপজেলা অবস্থিত।\n\n"
                "প্রশাসন:  ১৮৫৪ সালে সৃষ্ট মাদারীপুর মহকুমার অধীনে ১৯০৯ সালে করিমগঞ্জ থানা গঠন করা হয় যা ১৯১৮ সালে কালকিনি নামে পরিবর্তিত হয়। ১৯৮৪ সালে মাদারীপুর জেলা হিসেবে স্বীকৃতি পায় এবং তখন কালকিনি থানা উপজেলায় রুপান্তরিত হয়। কালকিনি উপজেলায় ২টি থানা, ১টি পৌরসভা, ৯টি ওয়ার্ড, ৩৮টি মহল্লা, ১৫টি ইউনিয়ন, ১৬১টি মৌজা ও ২১০টি গ্রাম রয়েছে।\n\n"
                "অর্থনীতি:  কালকিনির জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৭০.২৩%, এছাড়া অকৃষি শ্রমিক ২.৭৮%, শিল্প ০.৪৮%, ব্যবসা ৯.৮০%, পরিবহন ও যোগাযোগ ১.৪৯%, চাকরি ৭.১২%, নির্মাণ ১.৫০%, ধর্মীয় সেবা ০.২৭%, রেন্ট অ্যান্ড রেমিটেন্স ১.০০% এবং অন্যান্য ৫.৩৩%। এ অঞ্চল মূলত খেজুর রস ও খেজুর গুড়ের জন্য বাংলাদেশে বিখ্যাত। এছাড়াও এখানে পাট, খেজুর গুড়, তিল, সরিষার তেল বাণিজ্যিকভাবে চাষ হয়। রবি ও খরিফ ফসল হিসেবে চীনাবাদাম চাষ হয়। ২০০১ সালের ভূমি জরিপ অনুসারে কালকিনির ৭৫.১১ শতাংশ বসবাসকারীর কৃষিভূমির মালিকানা রয়েছে। কালকিনির প্রধান কৃষিজ ফসল ধান, পাট, সরিষা, ডাল, গম, মিষ্টি আলু ও শাকসবজি। ফলের মধ্যে আম, কাঁঠাল, পেঁপে, নারিকেল, কলা সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, মৎস খামার ও নার্সারি রয়েছে।\n\n"
                "সংস্কৃতি ও খেলাধুলা:  কালকিনি উপজেলার আঞ্চলিক ভাষার সাথে পার্শ্ববর্তী বরিশালের ভাষার অনেকটা সাদৃশ্য রয়েছে এবং মানুষের আচার-আচরণ, খাদ্যাভ্যাস, ভাষা, সংস্কৃতিতে বরিশালের ব্যাপক প্রভাব রয়েছে বলে বিশেষজ্ঞরা মনে করেন।[১] কালকিনিতে বসবাসকারী বিভিন্ন সম্প্রদায় তাদের নিজ নিজ রীতি-নীতি মনে চলে। বাংলাদেশের অন্য অনেক অঞ্চলের মত বিয়ের অনুষ্ঠানে ডুলি এবং পালকির প্রচলন ছিল। কালকিনিতে মূলত গাজীর গান, কীর্তন, পাঁচালি গান, ধুয়াগান, বাউল গান, প্রবাদ-প্রবচন, ছড়া, ছিলকা, হেয়ালি, ধাঁধা, জারিগান উল্লেখযোগ্যভাবে পরিচিত। বিলুপ্ত বা বিলুপ্তপ্রায় সনাতন বাহন: পালকি, ঘোড়ার গাড়ি।\n\n"
                "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী কালকিনির গড় সাক্ষরতার হার শতকরা ৪৯% (পুরুষ ৫১%, নারী ৪৭.২%)। এ উপজেলায় ২১৭ টি সরকারি প্রাথমিক বিদ্যালয়, ২২ টি কমিউনিটি প্রাথমিক বিদ্যালয়, ৬১ টি মাধ্যমিক বিদ্যালয়, ৩১ টি মাদ্রাসা, ৬১ টি এবতেদায়ী মাদ্রাসা, ০৭ টি কলেজ, ০২ টি কারিগরি কলেজ রয়েছে।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। কালকিনি অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ৩টি বেসরকারি হাসপাতাল রয়েছে। ১১টি উপজেলা স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র, ৫টি উপ-স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র রয়েছে। এছাড়াও ৩১টি কমিউনিটি ক্লিনিক রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
