import 'package:flutter/material.dart';

//rajair
class rajair extends StatelessWidget {
  const rajair({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে রাজৈর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  রাজৈর উপজেলার ভৌগোলিক অবস্থান ২৩°০৬´ থেকে ২৩°২০´ উত্তর অক্ষাংশ এবং ৮৯°৫৬´ থেকে ৯০°০৬´ পূর্ব দ্রাঘিমাংশ। এর মোট আয়তন ২২৯.২৮ বর্গ কিলোমিটার।[৯] রাজৈর উপজেলার কেন্দ্র থেকে দক্ষিণে গোপালগঞ্জ, পূর্বে মাদারীপুর জেলা সদর অবস্থিত। এর উত্তরে ভাঙ্গা উপজেলা ও শিবচর উপজেলা, পূর্বে মাদারিপুর সদর উপজেলা, দক্ষিণে কোটালীপাড়া উপজেলা ও গোপালগঞ্জ সদর উপজেলা এবং পশ্চিমে মুকসুদপুর উপজেলা ও ভাঙ্গা উপজেলা অবস্থিত।\n\n"
                "প্রশাসন:  ১৮৫৪ সালে সৃষ্ট মাদারিপুর মহকুমার অধীনে ১৯১৪ সালে রাজৈর থানা গঠন করা হয়। ১৯৮৪ সালে মাদারীপুর জেলা হিসেবে স্বীকৃতি পায় এবং তখন রাজৈর থানা উপজেলায় রুপান্তরিত হয়। রাজৈর উপজেলায় ১টি পৌরসভা, ৯টি ওয়ার্ড, ১১টি ইউনিয়ন, ৯৫টি মৌজা ও ১৮৬টি গ্রাম রয়েছে।[১] ইউনিয়নগুলো হলো আমগ্রাম ইউনিয়ন, বদরপাশা ইউনিয়ন, বাজিতপুর ইউনিয়ন, হরিদাসদী-মহেন্দ্রদী ইউনিয়ন, হোসেনপুর ইউনিয়ন, ইশিবপুর ইউনিয়ন, কবিরাজপুর ইউনিয়ন, কদমবাড়ী ইউনিয়ন, খালিয়া ইউনিয়ন, পাইকপাড়া ইউনিয়ন, রাজৈর ইউনিয়ন।\n\n"
                "অর্থনীতি:  রাজৈরের জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি যা মোট আয়ের ৬০.৬৮%, এছাড়া অকৃষি শ্রমিক ২.৩৩%, শিল্প ১.০৪%, ব্যবসা ১৯.৫৫%, পরিবহন ও যোগাযোগ ১.৮২%, চাকরি ৪.০৯%, নির্মাণ ২.৬৫%, ধর্মীয় সেবা ০.২২%, রেন্ট অ্যান্ড রেমিটেন্স ০.৯৬% এবং অন্যান্য ৬.৬৬%। এ অঞ্চল মূলত খেজুর রস ও খেজুর গুড়ের জন্য বাংলাদেশে বিখ্যাত। এছাড়াও এখানে পাট, খেজুর গুড়, তিল, সরিষার তেল বাণিজ্যিকভাবে চাষ হয়। রবি ও খরিফ ফসল হিসেবে চীনাবাদাম চাষ হয়। ২০০১ সালের ভূমি জরিপ অনুসারে রাজৈরের ৬৯.০১ শতাংশ বসবাসকারীর কৃষিভূমির মালিকানা রয়েছে। রাজৈরের প্রধান কৃষিজ ফসল ধান, পাট, আখ, গম, মিষ্টি আলু, ডাল, সরিষা, তিল ও শাকসবজি। ফলের মধ্যে আম, কাঁঠাল, জাম, জামরুল, লিচু, কলা, পেঁপে, সবেদা সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, মৎস খামার ও নার্সারি রয়েছে।\n\n"
                "সংস্কৃতি ও খেলাধুলা:  রাজৈরের ভাষার মূল বৈশিষ্ট্য বাংলাদেশের অন্যান্য উপজেলার মতই, তবুও কিছুটা বৈচিত্র্য রয়েছে। যেমন কথ্য ভাষায় মহাপ্রাণ ধ্বনি অনেকাংশে অনুপস্থিত অর্থাৎ ভাষা সহজীকরণের প্রবণতা রয়েছে।[১] রাজৈরে বসবাসকারী বিভিন্ন সম্প্রদায় তাদের নিজ নিজ রীতি-নীতি মনে চলে। বাংলাদেশের অন্য অনেক অঞ্চলের মত বিয়ের অনুষ্ঠানে ডুলি এবং পালকির প্রচলন ছিল। রাজৈরে মূলত গাজীর গান, কীর্তন, পাঁচালি, ধুয়াগান, বাউল গান, প্রবাদ-প্রবচন, ছড়া, ছিলকা, হেয়ালি, ধাঁধা, জারিগান উল্লেখযোগ্যভাবে পরিচিত। বিলুপ্ত বা বিলুপ্তপ্রায় সনাতন বাহন: পালকি, ঘোড়ার গাড়ি।\n\n"
                "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী রাজৈরের গড় সাক্ষরতার হার শতকরা ৪৮.২%; (পুরুষ ৫০.৯%, নারী ৪৫.৬%)। এ উপজেলায় ১৩৯ টি সরকারি প্রাথমিক বিদ্যালয়, ৪৪ টি কমিউনিটি প্রাথমিক বিদ্যালয়, ২৯ টি মাধ্যমিক বিদ্যালয়, ০৫ টি মাদ্রাসা, ১৩ টি এবতেদায়ী মাদ্রাসা, ০৬ টি কলেজ, ০২ টি কারিগরি কলেজ রয়েছে।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। রাজৈর অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ৭টি বেসরকারি হাসপাতাল রয়েছে। ৫টি উপ-স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র রয়েছে। এছাড়াও ৮০টি স্যাটেলাইট ক্লিনিক রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
