//ptowakhali Jela
import 'package:flutter/material.dart';

class ptowakhali extends StatelessWidget {
  const ptowakhali({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে পটুয়াখালী জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "সূর্যোদয় ও সূর্যাস্তের জেলা খ্যাত পটুয়াখালী বাংলাদেশের দক্ষিণাঞ্চলের বরিশাল বিভাগের একটি প্রশাসনিক অঞ্চল ও বাংলাদেশের একটি উপকূলীয় জেলা। পটুয়াখালী দেশের অন্যতম প্রাচীন শহর ও দক্ষিণাঞ্চলের অন্যতম গুরুত্বপূর্ণ নদীবন্দর। অপরূপ প্রাকৃতিক সৌন্দর্যমণ্ডিত পটুয়াখালী বরিশাল বিভাগের একটি সম্ভাবনাময় জেলা।\n\n"
                "ভৌগোলিক সীমানা:  পটুয়াখালী জেলার উত্তরে বরিশাল জেলা, দক্ষিণে বঙ্গোপসাগর, পূর্বে ভোলা জেলা এবং পশ্চিমে বরগুনা জেলা অবস্থিত। জেলার আয়তন প্রায় ৩,২২১.৩১ বর্গ কিলোমিটার।\n\n"
                "প্রশাসনিক এলাকাসমূহ:  পটুয়াখালী জেলা ৮টি উপজেলা, ৯টি থানা, ৫টি পৌরসভা, ৭৬টি ইউনিয়ন ও ৪টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                "পটুয়াখালী জেলায় মোট ৮টি উপজেলা রয়েছে।\n\n"
                "জনসংখ্যার উপাত্ত:  ২০১১ সালের আদমশুমারি অনুযায়ী পটুয়াখালী জেলার মোট জনসংখ্যা ১৫,৩৫,৮৫৪ জন। এর মধ্যে পুরুষ ৭,৫৩,৪৪১ জন এবং মহিলা ৭,৮২,৪১৩ জন। মোট পরিবার ৩,৪৬,৪৬২টি।\n\n"
                "শিক্ষা:  ২০১১ সালের আদমশুমারি অনুযায়ী পটুয়াখালী জেলার সাক্ষরতার হার ৬৫%। জেলায় উচ্চ শিক্ষার জন্য একটি বিশ্ববিদ্যালয় পটুয়াখালী বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয় ও একটি মেডিকেল কলেজ পটুয়াখালী মেডিকেল কলেজ রয়েছে। এছাড়াও পটুয়াখালী শতবর্ষী তিনটি স্কুল রয়েছে। এগুলো হলো ১. লতিফ মিউনিসিপ্যাল সেমিনারী পটুয়াখালী ২. পটুয়াখালী সরকারি জুবিলী উচ্চবিদ্যালয় ৩. পটুয়াখালী সরকারি বালিকা মাধ্যমিক বিদ্যালয়\n\n"
                "উৎপাদিত ফল:  পটুয়াখালী জেলায় অনেক ধরনের ফল উৎপাদিত হয়। পটুয়াখালীতে অনেক তরমুজ চাষ হওয়ায় এই জেলাকে তরমুজের বাড়িও বলা হয়। ফলমূল ছাড়াও এ জেলায় প্রচুর শকসবজিও চাষ করা হয়। দেশের শতকরা ৬০ ভাগ ডাল আসে পটুয়াখালী জেলা থেকে। পটুয়াখালী জেলায় চাষ হয় পবিত্র কুরআনে বর্ণীত মরুভূমির ত্বীন ফল যা দেশে বিরল।\n\n"
                "বনভূমি:  পটুয়াখালী জেলার বনাঞ্চলের পরিমাণ খুবই কম। যেখানে বাংলাদেশের মোট ভূমির ১৫% বনভূমি সেখানে পটুয়াখালী জেলার মাত্র ২% বনাঞ্চল। বনাঞ্চলের উল্লেখযোগ্য গাছের নাম কেওড়া, গেওয়া, কাকড়া, বাবুল গোলপাতা ইত্যাদি।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
