//Vola Jela
import 'package:flutter/material.dart';

class volaJela extends StatelessWidget {
  const volaJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ভোলা জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভোলা জেলা বাংলাদেশের দক্ষিণাঞ্চলের বরিশাল বিভাগের একটি প্রশাসনিক অঞ্চল। এর পূর্বের নাম দক্ষিণ শাহবাজপুর।\n\n"
                "নামকরণের ইতিহাস:  ভোলার নামকরণের পেছনে স্থানীয়ভাবে একটি কাহিনি প্রচলিত আছে। ভোলা শহরের মধ্য দিয়ে বয়ে যাওয়া বেতুয়া নামক খালটি এখনকার মত অপ্রশস্ত ছিলনা। একসময় এটা পরিচিত ছিল বেতুয়া নদী নামে। খেয়া নৌকার সাহায্যে নদীতে পারাপার চলত। থুরথুরে বুড়ো এক মাঝি খেয়া নৌকার সাহায্যে লোকজনকে পারাপারের কাজ করতো। তার নাম ছিল ভোলা গাজি পাটনি। আজকের যোগীর ঘোলের কাছেই তার আস্তানা ছিল। এই ভোলা গাজির নামানুসারেই একসময় নামকরণ হয় ভোলা।\n\n"
                "অবস্থান ও আয়তন:  বাংলাদেশের বৃহত্তম দ্বীপ জেলা ভোলা। জেলা প্রশাসন যাকে কুইন আইল্যান্ড অব বাংলাদেশ বলে ঘোষণা করে। ভোলা জেলার উত্তরে বরিশাল জেলা ও মেঘনা নদী, দক্ষিণে বঙ্গোপসাগর, পূর্বে নোয়াখালী ও লক্ষ্মীপুর জেলা ও মেঘনা নদী এবং পশ্চিমে বরিশাল ও পটুয়াখালী জেলা ও তেঁতুলিয়া নদী। এর মোট আয়তন ৩৪০৩.৪৮ বর্গকিলোমিটার।\n\n"
                "প্রশাসনিক এলাকাসমূহ:  ভোলা জেলা ৭টি উপজেলা, ১০টি থানা, ৫টি পৌরসভা, ৭০টি ইউনিয়ন ও ৪টি সংসদীয় আসন নিয়ে গঠিত।\n\n"
                "জনসংখ্যার উপাত্ত:  ২০১১ সালের আদমশুমারি অনুযায়ী ভোলা জেলার মোট জনসংখ্যা ১৭,৭৬,৭৯৫ জন। এর মধ্যে পুরুষ ৮,৮৪,০৬৯ জন এবং মহিলা ৮,৯২,৭২৬ জন। মোট পরিবার ৩,৭২,৭২৩টি।\n\n"
                "যোগাযোগ ব্যবস্থা:  ভোলা শহর ঢাকা থেকে নদী পথে দূরত্ব ১৯৫ কি.মি.। সড়কপথে বরিশাল হয়ে দূরত্ব ২৪৭ কি.মি. এবং লক্ষীপুর হয়ে দূরত্ব ২৪০কি.মি.। ভোলার সাথে অন্য কোনো জেলার সরাসরি সড়ক যোগাযোগ নেই। অন্য জেলার সাথে যোগাযোগ ব্যবস্থা সচল রাখার জন্য ভোলাবাসীকে লঞ্চ,স্পিড বোট এবং ফেরীর উপর নির্ভর করতে হয়।\n\n"
                "বিবিধ:  দেশের দক্ষিণে বঙ্গোপোসাগর এবং দেশের সর্ববৃহৎ নদী মেঘনার কুল ঘেসে অবস্থিত একটি জেলা। যার সাথে কোনো জেলার সড়ক যোগাযোগ পথ নেই। প্রশ্ন উঠতে পারে, তাহলে ভোলা কি চর ? না, ভোলা কোনো চর নয়।দেশের সর্ব বৃহৎ দ্বীপ ভোলা এবং শুধু দ্বীপ নয় ভোলা দেশের সুসজ্জিত একটি জেলা।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
