import 'package:flutter/material.dart';
class dinazpurJela extends StatelessWidget {
  const dinazpurJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে দিনাজপুর জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/jela/rangpur divition jela/BD_Dinajpur_District_locator_map.svg.png",height: 400,width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "দিনাজপুর জেলা বাংলাদেশের উত্তর-পশ্চিমাঞ্চলের রংপুর বিভাগের একটি অন্যতম প্রাচীন ও বৃহৎ জেলা। উপজেলার সংখ্যানুসারে দিনাজপুর বাংলাদেশের একটি “এ” শ্রেণীভুক্ত জেলা।দিনাজপুর জেলা উত্তরবঙ্গের ১৬টি জেলার মধ্যে বৃহত্তম। এই অঞ্চল ভূতাত্ত্বিকভাবে ভারতীয় প্লেটের অংশ যা আদি জুরাসিক যুগে সৃষ্টি হওয়া গন্ডোয়ানাল্যান্ডের অংশ ছিল।\n\n"
                    "প্রাচীন যুগ:  দিনাজপুর একসময়ে পুণ্ড্রবর্ধনের অংশ ছিল। লক্ষ্ণৌতির রাজধানী দেবকোটের অবস্থান ছিল দিনাজপুর সদরের ১১ মাইল দক্ষিণে। "
                    "সম্প্রতি ঘোড়াঘাট উপজেলার সুর মসজিদের পাশের পুকুর থেকে গুপ্ত যুগের একটি শিলালিপি পাওয়া গেছে।\n\n"
                    "প্রশাসন: দিনাজপুরে ডেপুটি কমিশনার (DC) হিসাবে নিযুক্ত আছেন মোঃ মাহমুদুল আলম এবং জেলা পরিষদের প্রধান হলেন আজিজুল ইমাম চৌধুরী।\n\n"
                    "দিনাজপুর জেলায় মোট ১৩টি উপজেলা ও ৮টি পৌরসভা আছে। এর মধ্যে আয়তনের দিক থেকে সবচেয়ে বড় হলো বীরগঞ্জ উপজেলা (৪১৩ বর্গ কিমি; প্রায় ১২.০১% স্থান নিয়ে) এবং সবচেয়ে ছোট হলো হাকিমপুর উপজেলা (৯৯.৯২ বর্গ কিমি)।"
                    "এছাড়াও দিনাজপুর জেলায় মোট ১০৩টি ইউনিয়ন ও প্রায় ২১৪২টি গ্রাম রয়েছে।\n\n"
                    "জনসংখ্যা উপাত্ত: ধর্মবিশ্বাস অনুযায়ী দিনাজপুরের জনসংখ্যা"
                    "দিনাজপুর জেলার জনসংখ্যা ২৬,৪২,৮৫০ জন। এর মধ্যে পুরুষ ১৩,৬৩,৮৯২ জন ও মহিলা ১২,৭৮,৯৫৮ জন। দিনাজপুর জেলায় ২০,৫৭,০৩০ জন মুসলিম, ৫,২১,৯২৫ জন হিন্দু, ২৭,৯৯৬ জন বৌদ্ধ, ১,০৯৩ জন খ্রিস্টান এবং অন্যান্য ধর্মের প্রায় ৩৪,৮০৬ জন লোক বাস করে। দিনাজপুর জেলায় জনসংখ্যা বৃদ্ধির হার ১.২২%। নারী ও পুরুষের অনুপাত ১:১.০২। দিনাজপুর জেলায় সাঁওতাল, ওঁরাও, মাহলী, মালপাহাড়ী, কোল প্রভৃতি আদিবাসী জনগোষ্ঠীর বসবাস রয়েছে।\n\n"
                    "শিক্ষা:  দিনাজপুর জেলার শিক্ষার গড় হার ৪৫.৭%। পুরুষদের মধ্যে এই হার ৫১% এবং মহিলাদের মধ্যে ৪০%। দিনাজপুরে ১৭১৩টি প্রাথমিক বিদ্যালয়, ১১টি কমিউনিটি বিদ্যালয়, ২৯টি এনজিও স্কুল, ১০টি কিন্ডারগার্টেন, ৩৫১টি মাদ্রাসা, ৬১৭টি মাধ্যমিক বিদ্যালয়, ১১৮টি কলেজ, ১টি টেক্সটাইল ইনস্টিটিউট, ১ টি সরকারি পলিটেকনিক ইনস্টিটিউট, ১টি ভেটেরিনারি কলেজ ১০টি ভোকেশনাল ও অন্যান্য কেন্দ্র এবং ১টি বিশ্ববিদ্যালয় রয়েছে।\n\n"
                    "নদ-নদী: দিনাজপুর বাংলাদেশের উত্তরাঞ্চলে অবস্থিত হলেও অনেক নদী ও পানি সম্পদের অধিকারী। চাষাবাদের জন্য দিনাজপুরের মোহনপুরে ছোট যমুনা নদীতে রাবার ড্যাম দেওয়া হয়েছে। "
                    "চিরিরবন্দরের কাছে রেলসেতু থেকে তোলা কাঁকড়া নদীর দৃশ্য। ছোট যমুনা নদী "
                    "দিনাজপুর জেলা দিয়ে ২৬টিরও বেশি নদী প্রবাহিত হয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}