import 'package:flutter/material.dart';
class thakurgouJela extends StatelessWidget {
  const thakurgouJela({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ঠাকুরগাঁও জেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/jela/rangpur divition jela/BD_Thakurgaon_District_locator_map.svg.png",height: 400,width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভৌগোলিক সীমানা :  ঠাকুরগাঁও জেলার উত্তরে পঞ্চগড় জেলা, দক্ষিণে দিনাজপুর জেলা ও ভারতের পশ্চিমবঙ্গের উত্তর দিনাজপুর জেলা, পূর্বে দিনাজপুর জেলা ও পঞ্চগড় জেলার কিয়দংশ এবং পশ্চিমে ভারতের পশ্চিমবঙ্গের উত্তর দিনাজপুর জেলা অবস্থিত।\n\n"
                    "প্রশাসনিক এলাকাসমূহ: ঠাকুরগাঁও জেলা ৫টি উপজেলায় বিভক্ত।"
                    "ঠাকুরগাঁও জেলা ৫৩ টি ইউনিয়নেে বিভক্ত।\n\n"
                    "ভাষা:  ঠাকুরগাঁও অঞ্চলের স্থানীয় জনগণ সাধারণত কোচ রাজবংশীয় ভাষায় কথা বলে। এ ভাষাটি মূলত রাজবংশী, রংপুরী বা কামতাপুরী নামে পরিচিত যা ইন্দো-আর্য পরিবারভুক্ত একটি ভাষা। শ্রুতিমধুর এ ভাষা বাংলাদেশের দিনাজপুর, রংপুর অঞ্চলের মানুষ ছাড়াও ভারতের কোচবিহারের মানুষের মুখেও ব্যাপক প্রচলিত। রাজবংশী ভাষার কথ্যরূপগুলোর মধ্যে ৭৭-৮৯% মিল পাওয়া যায়। রাজবংশী ভাষা ৪৮-৫৫ ভাগ বাংলা, ৪৩-৪৯ ভাগ মৈথিলি এবং নেপালি শব্দ দ্বারা গঠিত।\n\n"
                    "শিক্ষা: শিক্ষা প্রতিষ্ঠানের সংখ্যা: বিশ্ববিদ্যালয়: ০(০১,প্রস্তাবিত); কলেজ : ২৭; মাধ্যমিক বিদ্যালয়: ২৪১; মাদ্রাসা : ৭৪; সরকারি পলিটেকনিক ইনস্টিটিউট: ১ এবং কারিগরি প্রশিক্ষণ কেন্দ্র: ১ টি।\n\n"
                    "নদীসমূহ: হরিপুর উপজেলায় বাংলাদেশ ভারতের সীমান্তে নাগর নদী। ঠাকুরগাঁওয়ে অনেকগুলো নদী রয়েছে। সেগুলো হচ্ছে টাঙ্গন নদী, ছোট ঢেপা নদী, কুলিক নদী, পুনর্ভবা নদী, তালমা নদী, পাথরাজ নদী, কাহালাই নদী, তীরনই নদী, নাগর নদী, তিমাই নদী, এবং নোনা নদী। এছাড়াও আছে শুক নদী, ছোট সেনুয়া নদী, আমনদামন নদী, লাচ্ছি নদী এবং ভুল্লী নদী।\n\n"
                    "প্রত্নতাত্ত্বিক স্থাপনা: জামালপুর জামে মসজিদ, ঠাকুরগাঁও জেলায় বাংলাদেশ প্রত্নতত্ত্ব অধিদপ্তর এর তালিকাভুক্ত দুটি প্রত্নতাত্ত্বিক স্থাপনা আছে। সেগুলো হচ্ছে ঢোলার হাট মন্দির ও জামালপুর জামে মসজিদ। এছাড়াও বাংলাদেশ সরকার নিয়ন্ত্রিত গুরুত্বপূর্ণ স্থাপনা হচ্ছে হরিপুর রাজবাড়ি, রাজা টংকনাথের রাজবাড়ি, বাংলা গড়, জগদল রাজবাড়ি, গড়গ্রাম দুর্গ প্রভৃতি।\n\n"
                    "হাট-বাজার ও মেলা: প্রধান প্রধান হাট-বাজারসমূহ:— শিবগঞ্জ বাজার, খোচাবাড়ী হাট, রুহিয়া রামনাথ হাট, গড়েয়া হাট, কালমেঘ হাট, যাদুরানী হাট, ফাড়াবাড়ী হাট, বেগুনবাড়ী হাট,কাতিহার হাট, লাহিড়ী হাট। মেলাসমূহ:— কালিমেলা, রুহিয়া আজাদ মেলা, নেকমরদ মেলা।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}