import 'package:flutter/material.dart';

//narayongongSodar
class narayongongSodor extends StatelessWidget {
  const narayongongSodor({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে নারায়নগঞ্জ সদর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  নারায়ণগঞ্জ সদর উপজেলা রাজধানী ঢাকা থেকে মাত্র ১৬ কিঃমিঃ দূরে দক্ষিণ-পূর্বে ঢাকা শহরের উপকন্ঠে ২৩.৬০০০° উত্তর ৯০.৫০০০° পূর্ব অবস্থিত। উত্তরে ও পশ্চিমে ঢাকা জেলা, দক্ষিণে মুন্সিগঞ্জ জেলা ও পূর্বে শীতলক্ষ্যা নদী। পশ্চিম সীমানার কিছু অঞ্চল দিয়ে বুড়িগঙ্গা নদী এবং দক্ষিণ পশ্চিম অঞ্চলে ধলেশ্বরী নদী প্রবাহিত হচ্ছে।\n\n"
                "প্রশাসনিক এলাকা:  নারায়ণগঞ্জ সদর উপজেলার আয়তন ১০০.৭৪ বর্গ কিঃমিঃ। নারায়ণগঞ্জ, ০১ টি ‍সিটি কর্পোরেশন (আংশিক), ০৭ টি ইউনিয়ন, ০৩ টি থানা, ১৭৮ টি মৌজা, ৩০৫ টি গ্রাম নিয়ে গঠিত। নারায়ণগঞ্জ সদর, ফতুল্লা ও সিদ্ধিরগঞ্জ এই তিনটি পুলিশ স্টেশন নারায়ণগঞ্জ সদর, ফতুল্লা ও সিদ্ধিরগঞ্জ নিয়ে গঠিত। ইউনিয়ন পরিষদের সংখ্যা ০৭ (সাত)টি। এর মধ্যে বক্তাবলী ও আলীরটেক ইউনিয়ন অনেকটাই চরাঞ্চল ও দুর্গম এলাকা। মোট ওয়ার্ড সংখ্যা ৬৩ টি, গ্রাম ১৩৩টি, মহল্লা ৭৪টি। নারায়ণগঞ্জ সদর উপজেলার অন্তর্ভুক্ত নারায়ণগঞ্জ ও সিদ্ধিরগঞ্জ পৌরসভা ২০১১ সালে নারায়ণগঞ্জ সিটি কর্পোরেশনে উন্নীত হয়েছে। ৫টি ইউনিয়ন নিয়ে সুখ্যাত শহর রক্ষা বাধঁ ডি.এন.ডি এলাকা গঠিত। আয়তন ৮,৫৪০ একর।\n\n"
                "ইতিহাস:  ১৮৮২ সালে নারায়ণগঞ্জকে মহকুমা ঘোষিত হয়, যা ১৯৮৪ সালে নারায়ণগঞ্জ সদর উপজেলাকে নিয়ে জেলায় উন্নীত হয়। ২০১১ সালের ৫ই মে নারায়ণগঞ্জ সদরকে সিটি কর্পোরেশন করা হয়।\n\n"
                "জনসংখ্যার উপাত্ত:  বাংলাদেশ পরিসংখ্যান ব্যুরো এর ২০১১ সালের অদমশুমারি অনুযায়ী নারায়ণগঞ্জ সদর উপজেলার জনসংখ্যা ১৩,২৩,৬০০ জন। এদের মাঝে পুরুষ ৬,৯০,৬৪১ জন এবং মহিলা ৬,৩২,৯৫৯ জন।\n\n"
                "শিক্ষা:  নারায়ণগঞ্জ সদরে শিক্ষার হার ৬২.৭%। সরকারী প্রাথমিক বিদ্যালয় ১০৪ টি, রেজিস্টার্ড প্রাথমিক বিদ্যালয় ১৩ টি, কমিউনিটি প্রাথমিক বিদ্যালয় ১ টি, মাধ্যমিক বিদ্যালয় এমপিও ভূক্ত ৪১ টি, মাধ্যমিক/ কিন্ডার গার্ডেন এমপিও বিহীন ৫১ টি, দাখিল মাদ্রাসা ৮ টি, আলিম মাদ্রাসা ০৯ টি, ফাজিল মাদ্রাসা ০৩ টি, কামিল মাদ্রাসা ০১ টি, এমপিও ভূক্ত কলেজ ১১ টি এবং এমপিও বিহীন কলেজ ০২ টি এখানে অবস্থিত। নারায়ণগঞ্জ সদরে ১৮৮৫ সালে নারায়ণগঞ্জ হাই স্কুল, ১৯০৬ সালে নারায়ণগঞ্জ বার একাডেমী এবং ১৯৩৭ সালে সরকারী তোলারাম (বিশ্ব:) কলেজ প্রতিষ্ঠিত হয়।\n\n"
                "অর্থনীতি:  নিট গার্মেন্টস ও হোসিয়ারী শিল্পের জন্য সুপরিচিত। নিটওয়্যার রপ্তানীকারকদের সংগঠন বিকেএমইএ ও বাংলাদেশের প্রাচীন সুতার বাজার এবং সুতা ব্যবসায়ীদের সংগঠন বাংলাদেশ ইয়ার্ন মার্চেন্টস এসোসিয়েশন ও হোসিয়ারী শিল্প উদ্যোক্তাদের প্রধান কার্যালয় হোসিয়ারী সমিতি, পাট ব্যবসায়ী ও রপ্তানীকারকদের সংগঠন বাংলাদেশ জুট এসোসিয়েশন বা বিজেএ এর প্রধান কার্যালয় নারায়ণগঞ্জ সদরে অবস্থিত। তাছাড়া রঙ ও কেমিক্যাল ব্যবসা এখানে অনেক পুরনো। এছাড়া নারায়ণগঞ্জ সদরের নিতাইগঞ্জের গম, আটা ও ময়দা পাইকারী বাজার অর্থনীতিতে উল্লেখযোগ্য অবদান রাখছে। নারায়ণগঞ্জ কে প্রাচ্যের ডান্ডি খ্যাত সুনামের পিছনে এই জায়গার অবদান রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
