import 'package:flutter/material.dart';

//nariya
class nariya extends StatelessWidget {
  const nariya({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে নড়িয়া উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  এ উপজেলার মোট আয়তন ২০৩.৫৮ বর্গ কিলোমিটার। নড়িয়া উপজেলার উত্তরে জাজিরা উপজেলা ও মুন্সিগঞ্জ জেলার লৌহজং উপজেলা ও টংগিবাড়ী উপজেলা, দক্ষিণে শরীয়তপুর সদর উপজেলা ও ভেদরগঞ্জ উপজেলা, পূর্বে ভেদরগঞ্জ উপজেলা ও মুন্সিগঞ্জ সদর উপজেলা এবং পশ্চিমে জাজিরা উপজেলা অবস্থিত।\স\স"
                "প্রশাসনিক এলাকা:  নড়িয়া উপজেলা ১টি পৌরসভা, ৯টি ওয়াআর্ড, ৩৪টি মহল্লা, ১৪৮ মৌজা, ১৯০টি গ্রাম ও ১৪টি ইউনিয়ন পরিষদ নিয়ে গঠিত।\n\n"
                "ইতিহাস:  নড়িয়া উপজেলার নামকরণের ঐতিহাসিক ভিত্তি পাওয়া যায় নাই। তবে কথিত আছে যে, অত্র এলাকার সবচেয়ে বড় মৌজা নড়িয়া কে ১৯৩০ সালে নড়িয়া থানায় রুপান্তর করা হয় এবং ১৯৮৩ সালে ১৪ টি ইউনিয়ন নিয়ে নড়িয়া উপজেলা গঠিত হয়।\n\n"
                "জনসংখ্যা:  জনসংখ্যা: ২,৩১৬৪৪ জন(প্রায়) পুরুষ: ১,০৯৯৬৭ জন(প্রায়) মহিলা: ১,২১৬৭৭ জন(প্রায়) লোক সংখ্যার ঘনত্ব: ৯৩৯ (প্রতি বঃ কিঃমিঃ)।\n\n"
                "শিক্ষা:  সরকারী প্রাথমিক বিদ্যালয়: ৮৮টি। বে-সরকারী প্রাথমিক বিদ্যালয়: ৬১টি। কমিউনিটি প্রাথমিক বিদ্যালয়: ১২টি। উচ্চ বিদ্যালয়: ৫টি। দাখিল মাদ্রাসা: ০৪টি। আলিম মাদ্রাসা:০১টি। ফাজিল মাদ্রাসা: ০১টি। কামিল মাদ্রাসা: ০০টি। কলেজ(সহপাঠ): ০৫টি। শিক্ষার হার: ৫৬.৪৩%।\স\স"
                "অর্থনীতি:  নড়িয়া উপজেলা মূলত কৃষি এবং বৈদেশিক রেমিটেন্সের উপর নির্ভরশীল। এছাড়াও বর্তমানে কিছু ব্যবসায়িক প্রতিষ্ঠান গড়ে উঠেছে। এ উপজেলার ভোজেশ্বর বাজার ও ঘড়িষার বাজার প্রাচীন বাণিজ্যিক কেন্দ্র। এখান থেকে ধান, গম, পাটসহ বিভিন্ন দ্রব্যসামগ্রী একসময় কলিকাতা ও ঢাকা সহ দেশের বিভিন্ন স্থানে নদী পথে বাণিজ্যিকভাবে আনা নেয়া হতো। এছাড়া সুরেশ্বর ঘাট ও কার্তিকপুর লঞ্চঘাট থেকে কলিকাতা ও ঢাকা সহ দেশের বিভিন্ন স্থানে লঞ্চ ও স্টীমার চলাচল করত। বতমানে ভোজেশ্বর হাট-বাজার, ঘড়িষার হাট-বাজার , নড়িয়া বাজার ও মূলফত গঞ্জ বাজার প্রধান প্রধান বাণিজ্যিক কেন্দ্র। এছাড়া ওয়াপদা ঘাট, চন্ডীপুর ঘাট, সুরেশ্বরঘাট, নড়িয়া, ভোজেশ্বরঘাট দিয়ে নদী পথে ব্যবসা বাণিজ্য পরিচালিত হয়। এখন সড়ক পথে দেশের বিভিন্ন স্থানের সাথে ব্যবসা বাণিজ্য পরিচালিত হচ্ছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
