import 'package:flutter/material.dart';

//bouapur
class bouapur extends StatelessWidget {
  const bouapur({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ভুয়াপুর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  এই উপজেলার ভৌগোলিক অবস্থান ২৪.৪৫৮৩° উত্তর ৮৯.৮৬৬৭° পূর্ব। ভূঞাপুর টাঙ্গাইল জেলার উত্তর পশ্চিমাংশে অবস্থিত। উত্তরে টাঙ্গাইল জেলার গোপালপুর উপজেলা ও জামালপুর জেলার সরিষাবাড়ি উপজেলা, পূর্বে গোপালপুর উপজেলা, ঘাটাইল উপজেলা ও কালিহাতি উপজেলা, দক্ষিণে কালিহাতি উপজেলা এবং পশ্চিমে সিরাজগঞ্জ জেলা। ভূঞাপুর উপজেলা প্রায় ২৪০২৩' থেকে ২৪০৩৫' উত্তর অক্ষাংশ এবং ৮৯০৪৩' থেকে ৮৯০৫৪' পূর্ব দ্রাঘিমাংশের মধ্যে অবস্থিত। ভূঞাপুর উপজেলার আয়তন ১৩৪.৪৬ বর্গকিলোমিটার।\n\n"
                "প্রশাসনিক এলাকা:  ভূঞাপুর পৌরসভা ও ৬টি ইউনিয়ন\n\n"
                "ইতিহাস:  বৃহত্তর ময়মনসিংহ জেলার অংশ হিসাবে এককালে এ জনপদের গুরুত্ব কম ছিল না। ১৮৬৬ সালের পূর্ব পর্যন্ত সিরাজগঞ্জ ও ময়মনসিংহ জেলায় অধিভূক্ত থেকে ভূঞাপুরের সঙ্গে যুক্ত ছিল অথবা ভূঞাপুর অঞ্চল সিরাজগঞ্জের সীমারেখা ভূক্ত ছিল। ১৮৬৬ সালের ১৫ ফেব্রুয়ারি সিরাজগঞ্জ উপজেলা ময়মনসিংহ জেলা থেকে বিচ্ছিন্ন হয়ে যায়। ১৯৭৪ সালের ৭ আগস্ট গোপালপুর থেকে বিচ্ছিন্ন হয়ে ভূঞাপুর স্বতন্ত্র থানার মর্যাদা লাভ করে। ১৯৮৩ সালের ২৪ মার্চ ভূঞাপুরকে উপজেলা ঘোষণা করা হয়। ১৯৯৪ সালের ২০ মার্চ ভূঞাপুরে পৌরসভা স্থাপিত হয়। বর্তমানে ভূঞাপুর একটি পরিচ্ছন্ন জনবহুল ও কর্মচঞ্চল পৌরশহর।\n\n"
                "জনসংখ্যার উপাত্ত:  ভূঞাপুর উপজেলার মোট জনসংখ্যা ১,৯০,৯১০ জন। আদমশুমারি রিপোর্ট ২০০১, বাংলাদেশ পরিসংখ্যান ব্যুরো ও ভূঞাপুর উপজেলা সাংস্কৃতিক সমীক্ষা প্রতিবেদন ২০০৭ অনুসারে মোট জনসংখ্যার মধ্যে পুরুষ ৯৬,৫০৫ জন, মহিলা ৯৪,৪০৫ জন। মোট জনসংখ্যার ১,৮৪,৬০৭ জন মুসলিম, ৬,২২৬ জন হিন্দু, ৮ জন বৌদ্ধ এবং ৬৯ জন অন্যান্য ধরর্মের অনুসারী।\n\n"
                "শিক্ষা :  ইবরাহিম খাঁ সরকারি কলেজ, গোবিন্দাসী ঊচ্চ  বিদ‍্যালয়, শহীদ জিয়া মহিলা কলেজ, হাজী ইসমাইল খাঁ বেসরকারি কারিগরি কলেজ, প্রিন্সিপাল ইব্রাহীম খাঁ বিশ্ববিদ্যালয় কলেজ, শমসের ফকির ডিগ্রি কলেজ, লোকমান ফকির মহিলা কলেজ, মমতাজ ফকির উচ্চ বিদ্যালয়, শেহাব উদ্দিন কলেজ, ফলদা রামসুন্দর ইউনিয়ন উচ্চ বিদ্যালয়, ভূঞাপুর সরকারী পাইলট উচ্চ বিদ্যালয়, ভূঞাপুর পাইলট বালিকা উচ্চ বিদ্যালয়, ভূঞাপুর মডেল সরকারি প্রাথমিক বিদ্যালয়, চর অলোয়া দাখিল মাদ্রাসা। ",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
