import 'package:flutter/material.dart';

//dhonbari
class dhonbari extends StatelessWidget {
  const dhonbari({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ধনবাড়ী উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  ধনবাড়ী উপজেলার ভৌগোলিক অবস্থান ২৪.৬৮০৫৭৮৪° উত্তর ৮৯.৯৩৯১৮৪১° পূর্ব অর্থাৎ ২৩°৩৭´ থেকে ২৪°৪৫´ উত্তর অক্ষাংশ এবং ৯০°১০´ থেকে ৯০°০০´ পূর্ব দ্রাঘিমাংশ। এটি মধুপুর উপজেলা ও জামালপুর জেলার সংযোগ সড়কের দুপাশে অবস্থিত। এর মোট আয়তন ১৩০.৫০ বর্গকিলোমিটার। ভৌগোলিকভাবে ধনবাড়ীর মাটি মধুপুর কর্দম দিয়ে গঠিত। ধনবাড়ী উপজেলার কেন্দ্র থেকে উত্তরে জামালপুর জেলা, পূর্বে মধুপুর উপজেলা, দক্ষিণে গোপালপুর উপজেলা এবং পশ্চিমে জামালপুর জেলার সরিষাবাড়ী উপজেলা অবস্থিত। মধুপুর উপজেলার মধুপুর গড়ের শেষ পশ্চিম অংশ থেকে ধনবাড়ী উপজেলার সীমানা শুরু হয়ে টাঙ্গাইল জেলার উত্তর প্রান্তে শেষ হয়েছে। এ উপজেলার উপর দিয়ে ঝিনাই নদী প্রবাহিত হয়েছে। টাঙ্গাইল জেলা সদর থেকে সড়কপথে ধনবাড়ীর দূরত্ব ৬৩ কিলোমিটার।\n\n"
                "সংখ্যাগত উপাত্ত:  ২০১১ সালের আদমশুমারি অনুযায়ী, ধনবাড়ী উপজেলার মোট জনসংখ্যা ১৮৩২৮৩ জন। এদের মধ্যে পুরুষ ৮৯৩৬২ জন এবং মহিলা ৯৩৯২১ জন। জনসংখ্যার ঘনত্ব ১৩১৬ জন, মোট ভোটার সংখ্যা ১৪২১৪০ জন, পুরুষ ভোটার ৬৯৬৪৮ জন, মহিলা ভোটার ৭২৪৯২ জন। ইসলাম ধর্মের অনুসারী ১৭৮৩৪৪ জন, হিন্দু ধর্মের অনুসারী ৪৮৫৩ জন এবং অন্যান্য ৮৬ জন। এ উপজেলায় গারো ও কোচ জাতির বসবাস রয়েছে।\n\n"
                "শিক্ষা: ২০১১ সালের হিসেব অনুযায়ী, ধনবাড়ী উপজেলার গড় সাক্ষরতার হার শতকরা ৪৪ ভাগ (পুরুষ ৪৫.৯%, মহিলা ৪২.২%)। উপজেলায় ১১টি কলেজ, ২৭টি উচ্চ বিদ্যালয় ও ২টি বালিকা উচ্চ বিদ্যালয়, ৪টি নিম্ন মাধ্যমিক বিদ্যালয়, ফাজিল পর্যায়ে ১টি মাদ্রাসা, ১৩টি দাখিল মাদ্রাসা, ২টি আলিম মাদ্রাসা এবং ২টি স্বতন্ত্র ভোকেশনাল সেন্টার রয়েছে।\n\n"
                "ভাষা ও সংস্কৃতি:  আদিকাল থেকেই বৃহত্তর ময়মনসিংহের পাহাড়ী এ অঞ্চলটিতে মুসলিম, হিন্দু, গারো সম্প্রদায়, কচি, বামনসহ বিভিন্ন জাতির বসবাস। ধনবাড়ীতে গারো ও কচি সম্প্রদায়ের লোকজন বসবাস করে তাই ভাষা ও সংস্কৃতি বৈচিত্র লক্ষ্য করা যায়। ধনবাড়ী উপজেলার প্রধান ভাষা বাংলা। তবে গারো সম্প্রদায়ের লোকজন গারো ভাষায় কথা বলে। গারো ভাষার আঞ্চলিক আবেং উপভাষাটি এখানে বেশি ব্যবহার দেখা যায়। তবে এ ভাষার লিখিত কোনো বর্ণমালা নেই। ধনবাড়ীতে বসবাসকারী বিভিন্ন সম্প্রদায় তাদের নিজ নিজ রীতি-নীতি মনে চলে। বাংলাদেশের অন্য অনেক অঞ্চলের মত বিয়ের অনুষ্ঠানে ডুলি এবং পালকির প্রচলন ছিল। পূর্বে ধনবাড়ীতে অতিথি আপ্যায়নের পর বস্ত্র ও অন্যান্য সামগ্রী উপঢৌকনস্বরূপ দেওয়ার রীতি প্রচলিত ছিল। এ উপজেলায় ১টি পাবলিক লাইব্রেরী, ৬টি সিনেমা হলসহ বিভিন্ন সাংস্কৃতিক সংগঠন রয়েছে।\n\n"
                "অর্থনীতি:  ধনবাড়ী মূলত কৃষিপ্রধান অঞ্চল। এ অঞ্চলের ৭৭.৩৭% জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি। প্রধান কৃষি ফসলের মধ্যে রয়েছে ধান, পাট, আখ, আলু এবং শাকসবজি। পূর্বে এ অঞ্চলে খেসারি, মটর, মিষ্টিআলু, মাষকলাই ডাল, তিল, তিসি ও গমের আবাদ করা হত। এছাড়াও এখানে কলা, কাঁঠাল, আনারস, আম, পেঁপে এবং জাম বাণিজ্যিকভাবে চাষ হয়। ২০০১ সালের ভূমিজরিপ অনুসারে উপজেলার শহরে ৩২.২৭% এবং গ্রামে ৫০.৭৪% পরিবার কৃষিজমির মালিক। কৃষি নির্ভর অর্থনীতির বাইরে মৎস্য, গবাদিপশু, হাঁস-মুরগির খামার, আসবাবপত্রের কারখানা, কুটিরশিল্প, মৃৎশিল্প, লৌহশিল্প ও ইটভাটাসহ প্রভৃতি এ উপজেলার অর্থনীতির অন্যতম চালিকা শক্তি।\n\n"
                "যোগাযোগ ব্যবস্থা:  সড়কপথ ধনবাড়ী উপজেলার প্রধান যোগাযোগ মাধ্যম। বাংলাদেশের জাতীয় মহাসড়ক এন৪ (জয়দেবপুর (এন৩, আর৩১০) - কাড্ডা (এন১০৫) - টাঙ্গাইল (এন৪০৪) - এলেঙ্গা (এন৪০৫) - মধুপুর (এন৪০১) - জামালপুর) ধনবাড়ী শহরকে জয়দেবপুর থেকে টাঙ্গাইল হয়ে জামালপুরের সাথে সংযোগ স্থাপন করেছে। এন৪ সড়কটি মধুপুর উপজেলা থেকে এন৪০১ নাম্বার সড়ক হিসেবে ময়মনসিংহকে (এন৩) ধনবাড়ীর সাথে সংযুক্ত করেছে। অর্থাৎ টাঙ্গাইল-জামালপুর সড়কের মধুপুর উপজেলার পর এবং জামালপুর সদর উপজেলার পূর্বে ধনবাড়ীর অবস্থান। ধনবাড়ী থেকে ঢাকাগামী অধিকাংশ বাস মহাখালী বাস টার্মিনালে এসে থামে। ধনবাড়ী জিরো পয়েন্ট থেকে সড়ক পথে টাঙ্গাইল জেলা সদরের দূরুত্ব ৬৩ কিলোমিটার, ময়মনসিংহের দূরত্ব ৬৭ কিলোমিটার, রাজধানী ঢাকার দূরত্ব ১৩৯ কিলোমিটার। এ উপজেলায় মোট রাস্তার পরিমাণ ৫১৭.১৮ কিলোমিটার যার মধ্যে ১০৫.৫৩ কিলোমিটার পাকারাস্তা ও ৪২১.২৫ কিলোমিটার কাঁচারাস্তা।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। ধনবাড়ী অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় একটি সরকারি হাসপাতালের সাথে সাথে ইউনিয়ন পর্যায়ে ৪টি উপ-স্বাস্থ্যকেন্দ্র, ৩টি ক্লিনিক, ১টি দাতব্য চিকিৎসাকেন্দ্র এবং ১টি পরিবার কল্যাণ কেন্দ্র রয়েছে। উপজেলার ৯৩.৮৩% মানুষ নলকূপ থেকে, ০.১৮% পুকুরের, ০.৪৫% ট্যাপ থেকে ও ৫.৫৪% অন্যান্য উৎস থেকে পানি পান করেন। ৫১.২৬% পরিবারে স্বাস্থ্যকর স্যানিটেশন ব্যবস্থার মধ্যে গ্রামে ২৫.৪৬% ও শহরে ৬৫.১৩% এবং ৪৯.৩৬% পরিবারের স্যানিটেশন ব্যবস্থা অস্বাস্থ্যকর। এছাড়া, ১২.১৭% পরিবারের কোন স্যানিটেশন ব্যবস্থা নেই।\n\n"
                "উল্লেখযোগ্য স্থান:  ধনবাড়ীতে বেশ কয়েকটি পর্যটন আকর্ষণ ও ঐতিহাসিক স্থান রয়েছে। যার মধ্যে উল্লেখযোগ্য হল-ধনবাড়ি জমিদার বাড়ি ও ধনবাড়ী মসজিদ - চার গম্বুজবিশিষ্ট মোগল স্থাপত্যরীতিতে তৈরি এই জমিদার বাড়িটি নবাব বাড়ি বা নবাব মঞ্জিল নামেও পরিচিত। নবাব বাড়ির পাশে রয়েছে ৩০ বিঘার দিঘি ও ধনবাড়ী মসজিদ। ১৯২৯ সালে সৈয়দ নওয়াব আলী চৌধুরীর মৃত্যুর পর থেকে এখানে ২৪ ঘণ্টা ‘কোরআন তিলাওয়াত’ বা পাঠ করা হয় যা কখনো বন্ধ করা হয় না।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
