import 'package:flutter/material.dart';

//ghatil
class ghatil extends StatelessWidget {
  const ghatil({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে ঘাটাইল উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  ঘাটাইল উপজেলার ভৌগোলিক অবস্থান অবস্থান ২৪°২৩´ থেকে ২৪°৩৪´ উত্তর অক্ষাংশ এবং ৮৯°৫৩´ থেকে ৯০°১৫´ পূর্ব দ্রাঘিমাংশ। এটি টাঙ্গাইল ও ময়মনসিংহ জেলার মহাসড়কের দুপাশে এবং টাঙ্গাইল জেলার উত্তরে অবস্থিত। এর মোট আয়তন ৪৫১.৭১ বর্গ কিলোমিটার। এটি সমুদ্র পৃষ্ঠ থেকে ১৮ মিটার উচ্চতায় অবস্থিত। পুরো উপজেলাটি বনাঞ্চল বেষ্টিত পাহাড়ি জনপদ নিয়ে গঠিত। ভৌগোলিকভাবে ঘাটাইলের মাটি লাল। ঘাটাইল উপজেলার কেন্দ্র থেকে দক্ষিণে টাঙ্গাইল, পশ্চিমে সিরাজগঞ্জ এবং উত্তরে ময়মনসিংহ জেলা সদর অবস্থিত। টাঙ্গাইল জেলা সদর ঘাটাইলের দূরুত্ব ৩০ কিলোমিটার। এর উত্তরে গোপালপুর ও মধুপুর উপজেলা, দক্ষিণে কালিহাতি ও সখিপুর উপজেলা, পূর্বে ময়মনসিংহ জেলার ফুলবাড়িয়া ও ভালুকা উপজেলা, পশ্চিমে ভুঞাপুর ও গোপালপুর উপজেলা অবস্থিত।\n\n"
                "প্রশাসন:  ঘাটাইল উপজেলা মোট ১৪টি ইউনিয়ন, ১টি পৌরসভা, ৪২৭টি গ্রাম ও ৩০৬টি মৌজায় বিভিক্ত। ইউনিয়নগুলো হলো, দেউলাবাড়ী, ঘাটাইল, জামুরিয়া, দিগড়, দিঘলকান্দি, আনেহলা, দেওপাড়া, ধলাপাড়া, সন্ধানপুর, লোকেরপাড়া, রসুলপুর, সংগ্রামপুর, সাগরদিঘি এবং লক্ষিন্দর। ব্রিটিশ শাসনামলে ১৯৬১ সালে এখানে থানা বা পুলিশ স্টেশন স্থাপন করা হয়। বাংলাদেশ স্বাধীনতা লাভের পর ১০৮৩ সালে ঘাটাইলকে উপজেলা করা হয়। উপজেলা প্রশাসনের আবেদনের ভিত্তিতে স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয় ২০১৪ সালের ২১ আগস্ট ধলাপাড়া, রসুলপুর ও সন্ধানপুর ইউনিয়নকে ভেঙে সংগ্রামপুর, সাগরদিঘি ও লক্ষিন্দর নামে আরো তিনটি নতুন ইউনিয়ন তৈরির গেজেট প্রকাশ করে। ১৯৯৮ সালের ১২ সেপ্টেম্বর স্থানীয় সরকার মন্ত্রণালয় ঘাটাইল শহরের ১১.০২ বর্গ কিলোমিটার এলাকাকে পৌরসভা হিসেবে ঘোষণা করে। পৌরসভাটি ১১টি গ্রাম ও ৯টি ওয়ার্ড নিয়ে গঠিত। পৌরসভাটির বর্তমান মেয়ার হিসেবে দায়িত্ব পালন করছেন শহিদুজ্জামান খান।\n\n"
                "জনসংখ্যা উপাত্ত:  ২০১১ সালের আদমশুমারি অনুযায়ী, উপজেলার মোট জনসংখ্যা ৪,৩৪,৩০০ জন। এর মধ্যে পুরুষ ২,১৩,৫২৬ জন এবং মহিলা ২,২০,৮০৪ জন। মোট জনসংখ্যার ৯৫.৪% মুসলিম, ৩.৪% হিন্দু এবং ১.২% অন্যান্য ধর্মালম্বী। উপজেলায় মোট ভোটার ২,৮৬,২০৭ জন। পুরুষ ভোটার ১,৪১,৬২৪ এবং মহিলা ভোটার ১,৪৪,৫৮৩ জন। উপজেলায় মোট ১,০৪,০৩০ টি পরিবার রয়েছে।\n\n"
                "অর্থনীতি:  ঘাটাইল মূলত কৃষিপ্রধান অঞ্চল। এ অঞ্চলের ৬৪.৭৫% জনগোষ্ঠীর আয়ের প্রধান উৎস কৃষি। প্রধান কৃষি ফসলের মধ্যে রয়েছে ধান, পাট, আখ, সরিষা, ডাল, আদা, হলুদ, বাদাম, শাকসবজি। পূর্বে এ অঞ্চলে রসুন, তিল, তিসি ও গমের আবাদ করা হত। এছাড়াও এখানে কলা, কাঁঠাল, আনারস, আম, তরমুজ, পেঁপে এবং জাম বাণিজ্যিকভাবে চাষ হয়। ২০০১ সালের ভূমিজরিপ অনুসারে উপজেলার ৬৮.৩৪% পরিবার কৃষিজমির মালিক। উপজেলায় মোট ৩১৫০ হেক্টর আবাদি জমি রয়েছে।\n\n"
                "শিক্ষাব্যবস্থা:  ২০১১ সালের হিসেব অনুযায়ী ঘাটাইল উপজেলার গড় সাক্ষরতার হার শতকরা ৪৪ ভাগ (পুরুষ ৪৭.৬%, মহিলা-৪০.৬%)। উপজেলায় ১টি মহিলা কলেজসহ মোট ৭টি কলেজ, ৩৬টি বালক উচ্চ মাধ্যমিক বিদ্যালয় ও ৭টি বালিকা উচ্চ মাধ্যমিক বিদ্যালয়, ৪টি উচ্চ মাধ্যমিক সংলগ্ন প্রাথমিক বিদ্যালয়, ২৪টি উচ্চ বিদ্যালয়, ২টি বালিকা উচ্চ বিদ্যালয়, ৬টি নিম্ন মাধ্যমিক বিদ্যালয়, ফাজিল পর্যায়ে ৫টি সিনিয়র মাদ্রাসা, ২৭টি দাখিল মাদ্রাসা, ১৫৯টি সরকারি প্রাথমিক বিদ্যালয় এবং ১৭টি স্বল্পব্যয়ী প্রাথমিক বিদ্যালয়।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। ঘাটাইল অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় একটি সরকারি হাসপাতালের সাথে সাথে ৬টি উপ-স্বাস্থ্যকেন্দ্র, ৫৪টি কমিউনিটি ক্লিনিক ও ১১টি পরিবার কল্যাণ কেন্দ্র রয়েছে। বাংলাপিডিয়ার তথ্য অনুযায়ী, উপজেলার ৮৯.৮৭% মানুষ নলকূপ থেকে, ০.২২% পুকুরের, ১.২১% ট্যাপ থেকে ও ৮.৭০% অন্যান্য উৎস থেকে পানি পান করেন। ৫১.২৬% পরিবারে স্বাস্থ্যকর স্যানিটেশন ব্যবস্থার মধ্যে গ্রামে ৪৯.২১% ও শহরে ৮৫.৬৮% এবং ২৩.৮৯% পরিবারের স্যানিটেশন ব্যবস্থা অস্বাস্থ্যকর। এছাড়া, ২৪.৮৫% পরিবারের কোন স্যানিটেশন ব্যবস্থা নেই।\n\n"
                "ধর্মীয় প্রতিষ্ঠান:  ঘাটাইলের ৯৫.৪% মানুষ ইসলাম ধর্মের অনুসারী। এছাড়া ৩.৪% হিন্দু এবং ১.২% অন্যান্য ধর্মালম্বী মানুষ বসবাস করে। এ উপজেলায় ৩৬২টি মসজিদ, ৩০টি মন্দির ও ১টি গির্জা রয়েছে। উল্লেখযোগ্য ধর্মীয় প্রতিষ্ঠানের মধ্যে রয়েছে, সাত গম্বুজ বিশিষ্ট ধলাপাড়া জামে মসজিদ যা ১৯১৭ সালে স্থানীয় জমিদার ছমির উদ্দিন চৌধুরী উপজেলার ধলাপাড়া গ্রামে নির্মাণ করেন। গুপ্ত বৃন্দাবন সনাতন ধর্মাবলম্বীদের কাছে গুরুত্বপূর্ণ স্থান। অনুকূলচন্দ্র চক্রবর্তীর প্রতিষ্ঠিত সৎসঙ্গ আন্দোলনের বাংলাদেশে বর্তমানে দুটি দল রয়েছে যাদের মধ্যে একটি হল পাবনার ‘হিমাইতপুর সৎসঙ্গ আশ্রম’ ও ঘাটাইলের পাকুটিয়ায় অবস্থিত ‘সৎসঙ্গ বাংলাদেশ’ আশ্রম। অনুকূলচন্দ্র চক্রবর্তী পাবনায় সৎসঙ্গ প্রতিষ্ঠার পর ১৯৪৬ সালে ভারত গমন করেন ও সেখানেই তিনি মৃত্যুবরণ করেন। ভারত বিভাজনের পর পূর্ব পাকিস্তান সরকার পাবনার সৎসঙ্গের স্থানটি অধিগ্রহণ করার পর এর প্রধান কার্যালয় পাকুটিয়াতে স্থানান্তরিত হয়।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
