import 'package:flutter/material.dart';

//golappur
class golappur extends StatelessWidget {
  const golappur({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে গোপালপুর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "অবস্থান:  এই উপজেলার ভৌগোলিক অবস্থান ২৪°৩৩′২৯.৮৮″ উত্তর ৮৯°৫৫′০.১২″ পূর্ব। গোপালপুর উপজেলা টাঙ্গাইল জেলা সদর থেকে ৪৫ কিঃ মিঃ উত্তরে অবস্থিত।\n\n"
                "প্রশাসনিক এলাকা:  একটি পৌরসভা এবং ৭টি ইউনিয়ন নিয়ে এ উপজেলা গঠিত।[১৬] ইউনিয়নগুলো হলো- হাদিরা ইউনিয়ন, নগদা শিমলা ইউনিয়ন, ঝাওয়াইল ইউনিয়ন, হেমনগর ইউনিয়ন, আলমনগর ইউনিয়ন, মির্জাপুর ইউনিয়ন এবং ধোপাকান্দি ইউনিয়ন।\n\n"
                "জনসংখ্যার উপাত্ত:  এর আয়তন ১৯৩.৩৭ বর্গ কিমি। ২০১১ সালের হিসেব অনুযায়ী লোক সংখ্যা ২,৫২,৩৩১ জন। এর মধ্যে ১,২৩,৫০৪ জন পুরুষ ও ১,২৮,৮২৭ জন মহিলা। শিক্ষার হার শহরে ৪২.৬% ও গ্রামে ৪১.১%।\n\n"
                "অর্থনীতি:  গোপালপুর মূলত কৃষিপ্রধান অঞ্চল। একসময় পাট ব্যবসায় বিশেষ প্রসিদ্ধ ছিল। প্রধান শস্য ধানের পাশাপাশি প্রচুর পাট উৎপাদন করত স্থানীয় কৃষকরা। নদীপথে দূর দুরান্তের বিভিন্ন স্থানে নৌকা বোঝাই পাট যেত। কিন্তু পাট ব্যবসা ধীরে ধীরে ধ্বংস হয়ে যায়। ২০০১ সালের ভূমিজরিপ অনুসারে গোপালপুরের জনগণের আয়ের প্রধান উৎস ছিল কৃষি ৬৬.৯৩%। বর্তমানে প্রধান কৃষিজ ফসল হল ধান, গম, পাট, আলু, শাকসবজি। ফলমূলের মধ্যে কাঁঠাল, আম, কলা, পেঁপে সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, গরু মোটা তাজাকরণ, মৎস চাষ ও পোলট্রিশিল্প রয়েছে। এ উপজেলায় টেক্সটাইল মিল, টুপি ফ্যাক্টরি, চাল কল, ইট ভাটা, ওয়েল্ডিং, তেল কল, স্টিল ও কাঠের আসবাবপত্র তৈরির কারখানা রয়েছে। এছাড়া বাঁশ ও বেতের কাজ, স্বর্ণশিল্প, মৃৎশিল্পের কাজও হয় এ উপজেলায়।\n\n"
                "শিক্ষা:  হেমচন্দ্র চৌধুরী ১৯০০ সালে হেমনগরে একটি স্কুল প্রতিষ্ঠা করেন। এ স্কুলের জন্য তিনি কোন সরকারি সাহায্য নেননি। স্কুলটি এখন শশীমুখি উচ্চবিদ্যালয় নামে পরিচিত। এটি সেই সময়কার গোপালপুর থানার প্রথম শিক্ষা প্রতিষ্ঠান। কেদারনাথ মজুমদারের ‘ময়মনসিংহের বিবরণ’ গ্রন্থে দেখা যায়, ১৯০৪ সালে হেমনগর হাইস্কুলের শিক্ষার্থী ছিল ২০১ জন। ১৯০৪ সালে গোপালপুর উপজেলায় ইংরেজি জানা লোকের সংখ্যা ছিল ৬৯৯ জন। এরপর ব্রিটিশ শাসনামলেই ঝাওয়াইল হেমন্তকুমারী হাইস্কুল, নন্দনপুর গার্লস হাইস্কুল, সূতি ভিএম হাইস্কুল এবং ভুটিয়া প্রাইমারি বিদ্যালয় প্রতিষ্ঠিত হয়।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
