import 'package:flutter/material.dart';

//mdhupur
class mdupur extends StatelessWidget {
  const mdupur({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: Scaffold(
        backgroundColor: Colors.white,
        body: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(height: 10),
              Container(
                height: 50,
                width: 400,
                color: Colors.grey,
                child: Center(
                  child: Text(
                    "এক নজরে মধুপুর উপজেলা",
                    style: TextStyle(fontWeight: FontWeight.w900, fontSize: 20),
                  ),
                ),
              ),
              SizedBox(
                height: 10,
              ),
              Image.asset("assets/800px-Un-bangladesh.png",
                  height: 400, width: 400),
              SizedBox(
                height: 10,
              ),
              Text(
                "ভূগোল:  মধুপুর উপজেলার ভৌগোলিক অবস্থান ২৪.৬১৬৭° উত্তর ৯০.০২৫০° পূর্ব। এটি টাঙ্গাইল ও ময়মনসিংহ জেলার মহাসড়কের দুপাশে এবং টাঙ্গাইল জেলার সর্ব উত্তরে অবস্থিত। এর মোট আয়তন ৩৭০,৪৭ বর্গ,কি:মি:। পুরো উপজেলাটি বনাঞ্চল বেষ্টিত পাহাড়ি জনপদ নিয়ে গঠিত। ভৌগোলিকভাবে মধুপুরের মাটি লাল। মধুপুর উপজেলার কেন্দ্র থেকে দক্ষিণে টাঙ্গাইল, পশ্চিমে জামালপুর এবং উত্তরে ময়মনসিংহ জেলা সদর অবস্থিত। প্রতিটি জেলা সদর মধুপুরের কেন্দ্র থেকে ৪৫ কি:মি দূরুত্বে অবস্থিত। এর উত্তরে ময়মনসিংহ বিভাগের মুক্তাগাছা উপজেলা ও জামালপুর জেলা, দক্ষিণে ঘাটাইল উপজেলা, পশ্চিমে গোপালপুর ও ধনবাড়ী উপজেলা এবং পূর্বে ময়মনসিংহের ফুলবাড়িয়া উপজেলা অবস্থিত।\n\n"
                "প্রশাসন:  মধুপুর উপজেলা মোট ১১টি ইউনিয়ন ও ১টি পৌরসভা নিয়ে গঠিত। ইউনিয়নগুলো হলো, আলোকদিয়া, আরণখোলা, আউশনাড়া, গোলাবাড়ী, মির্জাবাড়ী, শোলাকুড়ি, মহিষমারা, ফুলবাগচালা, বেরীবাইদ, কুড়ালিয়া এবং কুড়াগাছা। ১৮৯৮ সালে মুধুপরে থানা স্থাপনের পর ১৯৮৩ সালে এটিকে উপজেলায় উন্নীত করা হয়। ২০০৬ সাল পর্যন্ত ধনবাড়ী উপজেলা, মধুপুর উপজেলার অধীন ছিল। ২০০৬ সালের ১১ জুলাই মধুপুর উপজেলাকে বিভক্ত করে মধুপুর ও ধনবাড়ী নামে দুটি পৃথক উপজেলার সৃষ্টি হয়। এ সময় মধুপুর উপজেলাকে ৬টি ইউনিয়ন এবং ১টি পৌরসভায় ভাগ করা হয়। ইউনিয়ন ছয়টি হল, আলোকদিয়া, আরণখোলা, আউশনাড়া, গোলাবাড়ী, মির্জাবাড়ী ও শোলাকুড়ি। ২০১৬ সালের শুরুতে এই ছয়টি ইউনিয়নের মধ্যে তিনটিকে ভেঙ্গে আরও নতুন ইউনিয়ন গঠিত হয়। আউশনারা ইউনিয়নকে পৃথক করে আউশনারা, মহিষমারা ও কুড়ালিয়া, অরণখোলা ইউনিয়নকে পৃথক করে অরণখোলা, বেরীবাইদ ও কুড়াগাছা এবং শোলাকুড়ী ইউনিয়নকে পৃথক করে শোলাকুড়ী ও ফুলবাগচালা নামে নতুন ইউনিয়ন তৈরি হয়।\n\n"
                "অর্থনীতি:  মধুপুর মূলত কৃষিপ্রধান অঞ্চল। শালবন বেষ্ঠিত এ অঞ্চলটি আনরসের জন্য বাংলাদেশে বিখ্যাত। এছাড়াও এখানে কলা, কাঁঠাল, আম, হলুদ এবং ধান বাণিজ্যিকভাবে চাষ হয়। ২০০১ সালের ভূমিজরিপ অনুসারে মধুপুরের ৬৪.৪০ শতাংশ বসবাসকারীর কৃষিভূমির মালিকানা রয়েছে। মধুপুরের প্রধান কৃষিজ ফসল হল ধান, গম, হলুদ, আখ, পাট, আলু, আদা, তুলা, পান, কাসাভা ও শাকসবজি। কাঁঠাল, আম, আনারস, কলা, পেঁপে, লিচু ও জলপাই ফল সবচেয়ে বেশি উৎপাদিত হয়। উপজেলার অনেক ইউনিয়নে গবাদি পশু পালন, মৎস খামার ও নার্সারি রয়েছে।\n\n"
                "শিক্ষা:  ২০১১ সালের হিসেব অনুযায়ী মধুপুর শহরের গড় সাক্ষরতার হার শতকরা ৫৬.৭ ভাগ (পুরুষ ৫৮.৭%, মহিলা-৫৪.৫%)। ১৯৩৯ সালের ২ জানুয়ারি মধুপুরে নাটোরের রাণী ভবানীর পৃষ্ঠপোষকতায় রাণী ভবানী উচ্চ বিদ্যালয় প্রতিষ্ঠিত হয়। উপজেলায় একটি মহিলা কলেজসহ মোট ৭টি মহাবিদ্যালয়, ২টি উচ্চ মাধ্যমিক বিদ্যালয়, ২৪টি উচ্চ বিদ্যালয়, ২টি বালিকা উচ্চ বিদ্যালয়, ৩নি নিম্ন মাধ্যমিক বিদ্যালয়, ফাজিল পর্যায়ে ৬টি সিনিয়র মাদ্রাসা, আলিম পর্যায়ে ১টি সিনিয়র মাদ্রাসা, ১৩টি দাখিল মাদ্রাসা, ১০৩টি সরকারি প্রাথমিক বিদ্যালয়, ৭টি স্বল্পব্যয়ী প্রাথমিক বিদ্যালয় এবং ৭টি নিবন্ধিত এবতেদায়ী মাদ্রাসা রয়েছে। উল্লেখযোগ্য শিক্ষা প্রতিষ্ঠানের মধ্যে রয়েছে, মধুপুর শহীদ স্মৃতি উচ্চ মাধ্যমিক বিদ্যালয়, মধুপুর কলেজ, রাণী ভবানী মডেল উচ্চ বিদ্যালয়, আলোকদিয়া উচ্চ বিদ্যালয় প্রভৃতি। এ উপজেলার ইউনিয়নগুলোর মধ্যে, আলোকদিয়া ইউনিয়নের শিক্ষার হার প্রায় ৮৫% ও শোলাকুড়ি ইউনিয়নের ৪৮%।\n\n"
                "স্বাস্থ্য:  সামগ্রিকভাবে বাংলাদেশের শিক্ষা ও স্বাস্থ্য হার তুলনামূলক কম হলেও এটি মূলত দারিদ্র্যতার সাথে সম্পর্কিত হওয়ায়, এর উন্নতির সাথে সাথে বর্তমানে স্বাস্থ্য সেবাও বৃদ্ধি পাচ্ছে। মধুপুর অঞ্চলে অপুষ্টি, পরিবেশগত স্যানিটেশন সমস্যা, ডায়াবেটিস, সংক্রামক রোগ প্রভৃতি বেশি দেখা যায়। উপজেলায় ৫০ শয্যা বিশিষ্ট একটি সরকারি হাসপাতালের সাথে সাথে ৪টি বেসরকারি হাসপাতাল রয়েছে। ৪টি উপ-স্বাস্থ্য ও পরিবার কল্যাণ কেন্দ্র রয়েছে। এছাড়াও ৮০টি স্যাটেলাইট ক্লিনিক রয়েছে।",
                textAlign: TextAlign.justify,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              RaisedButton(
                onPressed: () {
                  Navigator.pop(context);
                },
                child: Text(
                  "BACK",
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
